{
  "book_key": "trade_what_you_see",
  "title": "Trade What You See - How To Profit from Pattern Recognition 2007.pdf",
  "tier": "high_value",
  "focus": "pattern_recognition",
  "description": "Pattern recognition methodology",
  "total_pages": 225,
  "relevant_pages": 152,
  "highly_relevant_pages": 28,
  "extracted_pages": [
    {
      "page": 1,
      "text": "",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 2,
      "text": "",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 3,
      "text": "Trade What\nYou See\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 4,
      "text": "Founded in 1807, John Wiley & Sons is the oldest independent publish-\ning company in the United States. With ofﬁces in North America, Europe,\nAustralia and Asia, Wiley is globally committed to developing and marketing\nprint and electronic products and services for our customers’ professional\nand personal knowledge and understanding.\nThe Wiley Trading series features books by traders who have survived\nthe market’s ever-changing temperament and have prospered—some by\nreinventing systems, others by getting back to basics. Whether a novice\ntrader, professional or somewhere in between, these books will provide the\nadvice and strategies needed to prosper today and well into the future.\nFor a list of available titles, please visit our Web site at www.\nWileyFinance.com.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 5,
      "text": "Trade What\nYou See\nHow to Proﬁt from\nPattern Recognition\nLARRY PESAVENTO\nLESLIE JOUFLAS\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 6,
      "text": "Copyright C⃝2007 by Larry Pesavento and Leslie Jouﬂas. All rights reserved.\nPublished by John Wiley & Sons, Inc., Hoboken, New Jersey\nPublished simultaneously in Canada.\nWiley Bicentennial Logo: Richard J. Paciﬁco\nNo part of this publication may be reproduced, stored in a retrieval system, or transmitted in any\nform or by any means, electronic, mechanical, photocopying, recording, scanning, or otherwise,\nexcept as permitted under Section 107 or 108 of the 1976 United States Copyright Act, without\neither the prior written permission of the Publisher, or authorization through payment of the\nappropriate per-copy fee to the Copyright Clearance Center, Inc., 222 Rosewood Drive, Danvers,\nMA 01923, (978) 750-8400, fax (978) 646-8600, or on the web at www.copyright.com. Requests to\nthe Publisher for permission should be addressed to the Permissions Department, John Wiley\n& Sons, Inc., 111 River Street, Hoboken, NJ 07030, (201) 748-6011, fax (201) 748-6008, or online\nat http://www.wiley.com/go/permissions.\nLimit of Liability/Disclaimer of Warranty: While the publisher and author have used their\nbest efforts in preparing this book, they make no representations or warranties with respect\nto the accuracy or completeness of the contents of this book and speciﬁcally disclaim any\nimplied warranties of merchantability or ﬁtness for a particular purpose. No warranty may be\ncreatedorextendedbysalesrepresentativesorwrittensalesmaterials.Theadviceandstrategies\ncontained herein may not be suitable for your situation. You should consult with a professional\nwhere appropriate. Neither the publisher nor author shall be liable for any loss of proﬁt or any\nother commercial damages, including but not limited to special, incidental, consequential, or\nother damages.\nFor general information on our other products and services or for technical support, please\ncontact our Customer Care Department within the United States at (800) 762-2974, outside the\nUnited States at (317) 572-3993 or fax (317) 572-4002.\nWiley also publishes its books in a variety of electronic formats. Some content that appears\nin print may not be available in electronic books. For more information about Wiley products,\nvisit our web site at www.wiley.com.\nLibrary of Congress Cataloging-in-Publication Data:\nPesavento, Larry.\nTrade what you see : how to proﬁt from pattern recognition / Larry\nPesavento, Leslie Jouﬂas.\np.\ncm. – (Wiley trading series)\nIncludes index.\nISBN 978-0-470-10676-1 (cloth)\n1.\nSpeculation.\n2.\nStocks.\n3.\nInvestment analysis.\n4.\nFibonacci numbers.\nI.\nJouﬂas, Leslie, 1957– II. Title.\nHG6041.P382 2008\n332.63′228–dc22\n2007034476\nPrinted in the United States of America\n10 9 8 7 6 5 4 3 2 1\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 7,
      "text": "To all traders, past and present, who have dedicated themselves to\nbecoming successful at making a living in the profession of trading.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 8,
      "text": "",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 9,
      "text": "Contents\nPreface\nxi\nAcknowledgments\nxv\nAbout the Authors\nxvii\nPART ONE\nIntroduction to Trading with\nPattern Recognition\nCHAPTER 1\nOpening Thoughts\n3\nHow to Use This Book\n3\nSucceeding or Failing in Trading\n4\nSteps to Take for Successful Trading\n7\nCHAPTER 2\nGeometry of the Patterns and Fibonacci\nRatios\n9\nHistory of Geometry in the Markets\n11\nFibonacci Ratios\n12\nApplying the Fibonacci Ratios\n16\nSummary\n18\nCHAPTER 3\nHarmonic Numbers and How to Use Them\n19\nWhere the Term Harmonic Numbers Originated\n19\nDeﬁning a Harmonic Number\n20\nVibrations in Price Swings\n21\nRepetition in Price Swings\n24\nvii\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 10,
      "text": "viii\nCONTENTS\nFinding Harmonic Numbers\n28\nHarmonic Numbers Found in Other Markets\n34\nPART TWO\nThe Price Patterns and How to Trade Them\nCHAPTER 4\nThe AB=CD Pattern\n39\nHistory of the AB=CD Pattern\n39\nAB=CD Pattern Description\n41\nAB=CD Pattern Structure\n41\nImportant Characteristics of the AB=CD Pattern\n44\nCD Leg Variations\n45\nSlope and Time Frames\n48\nPsychology of the AB=CD Pattern\n50\nTrading the AB=CD Pattern\n51\nCHAPTER 5\nThe Gartley “222” Pattern\n55\nHistory of the Gartley “222” Pattern\n55\nGartley “222” Pattern Description\n57\nGartley “222” Pattern Structure\n58\nImportant Characteristics of the Gartley “222” Pattern\n59\nPsychology of the Gartley “222” Pattern\n61\nTrading the Gartley “222” Pattern\n62\nCHAPTER 6\nThe Butterﬂy Pattern\n69\nHistory of the Butterﬂy Pattern\n69\nButterﬂy Pattern Description\n70\nButterﬂy Pattern Structure\n72\nImportant Characteristics of the Butterﬂy Pattern\n73\nPsychology of the Butterﬂy Pattern\n74\nTrading the Butterﬂy Pattern\n75\nCHAPTER 7\nThe Three Drives Pattern\n85\nHistory of the Three Drives Pattern\n85\nThree Drives Pattern Description\n86\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 11,
      "text": "Contents\nix\nThree Drives Pattern Structure\n87\nImportant Characteristics of the Three Drives Pattern\n88\nPsychology of the Three Drives Pattern\n89\nTrading the Three Drives Pattern\n89\nCHAPTER 8\nRetracement Entries and Multiple\nTime Frames\n95\nFibonacci Retracement Entries\n96\nFibonacci Retracement Pattern Structure\n96\nTrading the Fibonacci Retracement Pattern\n98\nOpening Price Retracement Setups\n103\nMarket Setup for the Opening Price Retracement Trade\n103\nTrading the Opening Price Retracement Setup\n105\nMultiple Time Frames\n108\nCHAPTER 9\nClassical Technical Analysis Patterns\n117\nA Brief History of Technical Analysis\n118\nBasics of Technical Analysis\n119\nDouble Bottom and Top Patterns\n119\nHead and Shoulders Pattern\n125\nBroadening Top and Bottom Patterns\n130\nCHAPTER 10\nLearning to Recognize Trend Days\n135\nIdentifying a Trend Day\n136\nPatterns Found on Trend Days\n139\nFibonacci Ratios on Trend Days\n142\nControlling Risk on a Trend Day\n144\nTrading a Trend Day\n145\nPART THREE Essential Elements of Trading\nCHAPTER 11\nTrade Management\n153\nThinking in Probabilities\n154\nWarning Signs and Conﬁrmation Signs\n155\nMoney Management\n159\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 12,
      "text": "x\nCONTENTS\nCHAPTER 12\nUsing Options with the Fibonacci Ratios\nand Patterns\n165\nCall and Put Options Deﬁned\n165\nFactors That Inﬂuence the Price of an Option\n166\nControlling Risk with Options\n167\nExamples of Using Options with Extension Patterns\n168\nCHAPTER 13\nBuilding a Trading Plan\n173\nDaily Trading Plan\n174\nTrading as a Business\n180\nDisaster Plans\n183\nSummary\n187\nCHAPTER 14\nDaily Routines\n189\nTrade Preparation\n189\nMental Preparation\n192\nPhysical Preparation\n195\nAppendix\n197\nIndex\n201\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 13,
      "text": "Preface\n“Trading is a journey—not a destination.”\nS\neveral hundred years ago, technical analysis began its journey to help\ninvestors and traders determine, with reasonable probability, what\ndirection prices might take. Technical analysis allows investors and\ntraders to identify moments of opportunity to proﬁt in the markets. It does\nso by identifying and quantifying speciﬁc patterns that form and repeat with\nenough regularity that trading methods and strategies can be developed and\nimplemented with success.\nTrade What You See: How to Proﬁt from Pattern Recognition focuses\non trading patterns with an underlying root structure based on simple geo-\nmetric forms and Fibonacci ratios. The patterns are easily identiﬁable once\nthe trader has spent some time observing and learning the basic structures.\nEach of these patterns can be quantiﬁed and a sound money management\nstrategy applied.\nWriting a book about pattern recognition based on geometric patterns\nand Fibonacci ratios requires acknowledging the early scholars of geome-\ntry, including Pythagoras, Archimedes, and of course the great mathemati-\ncian Leonardo di Pisa (better known as Fibonacci). These great scholars\nhad all traveled to Egypt during their lifetimes and had studied the Great\nPyramids. Pythagoras, the father of modern geometry, was obsessed by the\nmathematics of the pyramids. The actual mass of the structure was not as\nimportant to him as the fact that all of the angles on all sides were within .01\npercent. Part of the mystery of the Great Pyramids is how the mathematics\nrelates to the golden ratio, which is also referred to as the divine proportion,\nor .618.\nIt was not so many years ago that a book of this nature, based on\ntechnical analysis, would not have been taken seriously by many. We begin\nwith a look at a point in time when technical analysis had begun to take\nroot in the academic community.\nxi\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 14,
      "text": "xii\nPREFACE\nVALIDATION FROM THE SCIENTIFIC\nCOMMUNITY\nFor years technical analysis was shunned by many Wall Street profession-\nals, looked upon as one step above tea leaf reading. A turning point occurred\non April 17, 2000, when a paper by Dr. Andrew W. Lo of the Massachusetts\nInstitute of Technology (MIT) was published in BusinessWeek. The title of\nthe article was “This Alchemy Will Yield Pure Gold.” The article substanti-\nated and veriﬁed that indeed there is an edge in technical analysis after all.\nThis, of course, did not surprise any market technician who had successfully\nbeen using pattern recognition.\nThe article did, however, bring technical analysis from the age of\nalchemy into the realm of academia. Princeton University Press published\na book by Dr. Lo and A. Craig MacKinlay, A Non-Random Walk Down Wall\nStreet, which analyzed why patterns work and how they repeat. This could\nbe one of the reasons that the ﬁnancial public is now exposed to so many\nchart patterns in the ﬁnancial press and on television.\nLong before Lo and MacKinlay’s book was published, there were many\ngreat technical analysts to whom today we owe a debt of gratitude. Some\nof these technical analysts who have contributed groundbreaking work are\nH.M. Gartley, William Garrett, Edwards and McGhee, Frank Tubbs, R.W.\nSchabacker, William Dunnigan, Ralph Elliott, John Murphy, Linda Raschke,\nJohn Hill, Bryce Gilmore, Charles Lindsay, and Richard Wyckoff. We regret\nif we unintentionally omitted any famous names.\nWhat this book teaches is a simple, pragmatic approach to pattern\nrecognition. It’s designed to be hands-on and to appeal to new students\nof technical analysis as well as seasoned traders.\nThe motto that we trade by is “Trade what you see, not what you be-\nlieve.” A true technician is interested only in price bars and the summation\nof these price bars—the only truth in trading. Traders must learn to believe\nin what the market is telling them based on price. This is best accomplished\nby studying price behavior through pattern recognition.\nOVERVIEW OF THE BOOK\nThis book was written to give the reader a comprehensive view of the spe-\nciﬁc patterns presented. We use a variety of stocks and markets in the chart\nexamples throughout the book to illustrate that these particular patterns\ndo form in all markets, and in all time frames. We present patterns derived\nfrom some of the classic technical analysis patterns as well as the geometry\nand Fibonacci-based patterns. Here is an overview of each chapter:\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 15,
      "text": "Preface\nxiii\nChapter 1: Opening Thoughts—We give the reader some of our observa-\ntions on what is needed to successfully use the information in this book.\nWe also offer our insights after dealing with hundreds of traders on what\ncan make a successful trader and also what leads to failure.\nChapter 2: Geometry of the Markets and Fibonacci Ratios—This\nchapter covers the simple geometry of the markets and how the x-axis\nand y-axis provide just another way of illustrating triangles. We also cover\nthe history of Fibonacci ratios and present the ones we apply to our\ntrading.\nChapter 3: Harmonic Numbers and How to Use Them—This chapter\nshows that all ﬁnancial markets have what we refer to as harmonic and\nrepetitive swings that are inherent in each particular market. This chapter\nbegins to outline the basic structure of each pattern.\nChapter 4: The AB=CD Pattern—The AB=CD pattern is one of the sim-\nplest to identify in any market, on any time frame, and is the basis of\nseveral other patterns presented.\nChapter 5: The Gartley “222” Pattern—Derived from Gartley’s work in\nthe 1930s, this pattern is a classic retracement pattern.\nChapter 6: The Butterﬂy Pattern—The Butterﬂy pattern is seen at ex-\ntreme turning points in tops and bottoms; it is ideal for options trades\nand allows low-risk entries.\nChapter 7: Three Drives Pattern—This pattern can signal either a major\nturning point or a more complex correction in a trend. It is very easy to\nsee on a price chart when it forms.\nChapter 8: Retracement Entries and Multiple Time Frames—We\ncover simple retracement patterns with Fibonacci ratios that we use to\nenter in the direction of a trend. We also look at how to combine multiple\ntime frames.\nChapter 9: Classical Technical Analysis Patterns—Patterns such as\nHead and Shoulders, Double Tops and Bottoms, and Broadening Tops\nand Bottoms are discussed using Fibonacci ratios.\nChapter 10: Learning to Recognize Trend Days—This chapter could\npay for the book many times over. It teaches traders how to identify\ntrending conditions and offers techniques for entering in the direction\nof the trend. We also show how to use Fibonacci ratios as support and\nresistance in trends. We emphasize the importance of staying out of coun-\ntertrend trades when a strong trend is in progress.\nChapter 11: Trade Management—The secret to trade management is\nin understanding that risk is the most important element in trading. We\nlook at position sizes and methods for determining total risk. This chapter\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 16,
      "text": "xiv\nPREFACE\ncovers which warning signs we use and the conﬁrmation signals for trade\nentry or for passing on a trade altogether.\nChapter 12: Using Options with the Fibonacci Ratios and Patterns—\nOptions are available on nearly every liquid trading vehicle. Pattern recog-\nnition, because it is a leading indicator, is applicable to options. We\npresent some basic option strategies that minimize risk and allow for\nsubstantial proﬁts.\nChapter 13: Building a Trading Plan—Once readers have studied the\npatterns, they can then move on to a trading plan. This chapter gives a\nsolid foundation to build a plan that can be expanded upon as the trader\ngains experience. Over half a century of trading experience was used to\ndescribe the formulation of a trading plan.\nChapter 14: Daily Routines—Routines and rituals are a necessary part\nof the trading profession. The difference between successful traders and\nunsuccessful traders is in the thought process and the preparation. The\nsuccessful trader does the same things every day to prepare for trading.\nThis chapter gives suggestions for daily routines.\nThe appendix includes our lists of recommended books, magazines,\nand web site resources.\nAs a trader using pattern recognition, it is your job to learn these repeti-\ntivepatternsanddiscovertheunderlyingpriceratiosthatleadtoapredictive\nnature. We hope that you ﬁnd this book a valuable guide and reference as\nyou progress. We wish you a long and prosperous trading journey.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 17,
      "text": "Acknowledgments\nW\ne would like to thank Robin Farina and Rich Crane for their pa-\ntience, time, and outstanding help with this book. We also would\nlike to thank our friends John Arrington and Howard Arrington at\nEnsign Software; all the chart examples in this book were generated from\ntheir software, which is user friendly to our methodology. We’d like to thank\nShelliSimonforhereffortsandtime.ThankstoJohnHillfromFutures Truth\nfor his willingness to share some of the information obtained and some of\nthe rare books mentioned. Thank you to Mark Douglas and Linda Raschke\nfor their reviews and comments. Thanks to Jon and Liz Maresca for their\nsupport in everything.\nSpecialthankstoGaryPorter,whopatientlyreadeachwordandchapter\nas though he were a student of this methodology. His comments and insights\nare greatly appreciated.\nA grateful thank-you to all those at John Wiley & Sons, Inc., who gave\nus the opportunity to write this book. Thank you, Emilie Herman, for all of\nyour time—it is greatly appreciated.\nIt would be impossible to list all the great masters who have since\npassed on to that big trading room, but some of the more important ones\nto us do have their names mentioned in the book, as well as the ones\nstill with us. The contributions of those mentioned in this book cannot\nbe underestimated in the development of technical analysis of speculative\nmarkets.\nSPECIAL THANKS AND ACKNOWLEDGMENT\nI would like to give special thanks and gratitude to Larry Pesavento. You\nintroduced me to seeing the fascinating, harmonic world of Fibonacci ratios\nin the markets. Thank you for inspiring me and helping me develop my\nxv\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 19,
      "text": "About the Authors\nL\narry Pesavento is registered with the Commodity Futures Trading\nCommission, National Futures Association, and Securities and Ex-\nchange Commission, and is a former member of the Chicago Mer-\ncantile Exchange (1981–1983). He has a BS in Pharmaceutical Chemistry\n(Indiana State University, 1963) and an MBA in Finance from Indiana\nState University (1970). Books he has written on the subject of trading\ninclude: Astro-cycles: The Traders Viewpoint (Traders Press, 1987); Plane-\ntary Harmonics for Speculative Markets (Traders Press, 1990); Harmonic\nVibrations: A Metamorphosis from Traditional Cycle Theory to Astro-\nHarmonics (Traders Press, 1990); Fibonacci Ratios with Pattern Recogni-\ntion (Traders Press, 1997); Proﬁtable Patterns for Stock Trading (Traders\nPress, 1999); The Opening Price Principle, with Peggy MacKay (Traders\nPress, 2000); Private Thoughts from a Trader’s Diary, with Peggy MacKay\n(Traders Press, 2002); Essentials of Trading: It’s Not WHAT You Think,\nIt’s HOW You Think, with Leslie Jouﬂas (Traders Press, 2006). Larry can be\ncontacted at larry@tradingtutor.com.\nLeslie Jouﬂas began trading in 1996 and left a 17-year airline career\nin 2000 to pursue a full-time trading career. She has studied many trading\nmethodologies, including Elliott Wave, options strategies, momentum trad-\ning, classical technical analysis, and Fibonacci ratios and patterns. After\ntrading stocks and options on stocks, she now trades futures and commodi-\nties with an emphasis on the S&P 500 market. She manages private accounts\nas well as trading her own private account. Leslie has written several arti-\ncles for such publications as Trader’s Journal, Active Trader, and Technical\nAnalysis of Stocks & Commodities. She co-authored Essentials of Trad-\ning: It’s Not WHAT You Think, It’s HOW You Think (Traders Press, 2006).\nLeslie teaches workshops and is available for speaking engagements. She\nalso coaches and tutors students in pattern recognition trading with an em-\nphasis on improving and reﬁning execution skills. Leslie can be contacted\nat ljouﬂas@msn.com or at www.tradingliveonline.com.\nxvii\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 24,
      "text": "4\nTRADE WHAT YOU SEE\nwill help you build a solid foundation and understanding of what we are\nteaching.\nWe include many examples of trades in each pattern chapter. Once\nyou have a basic foundation in place of the pattern structures, you will be\nready to study how these patterns are traded, and begin to think in terms\nof implementing these into your trading. We always recommend traders\ndo some form of paper trading or simulated trading before committing\nreal funds.\nLearning how markets work is accomplished through time and experi-\nence. This is invaluable to the trader or investor. Determining what type of\ntrading environment one is in, such as a trend environment versus a range\nenvironment, is important. Recognizing the subtle symmetry in all markets\nis an absolute prerequisite for a pattern recognition trader; this is done only\none way: practice, practice, and more practice.\nThe only way the information in this book can be used to make money\nis to understand each pattern and apply sound trading principles. To help\neach trader accomplish this, we offer guidelines on developing a trad-\ning plan, covering pattern recognition, thinking in terms of probabilities,\nmoney management, risk assessment, and techniques for entering and ex-\niting trades. Other subjects include setting up trading as a business and\npreparing for the unexpected. Treating trading as anything other than a\nbusiness is a mistake. Even if the trader is not trading full-time, trading\nactivities should be treated and set up as a second business.\nA note on some of the charts throughout the book: Many of the chart\nexamples are of the S&P 500 E-mini contract. This is an extremely popular\nmarket for traders and very conducive to the patterns presented in this\nbook. You will ﬁnd some of these charts labeled as “ES,” which is the root\nsymbol for the S&P 500; others are labeled as S&P 500.\nSUCCEEDING OR FAILING IN TRADING\nIt is each trader’s responsibility to develop the skills and discipline neces-\nsary for successful trading. We have not found and do not know of a holy\ngrail in trading or an easy trading method. In many classic trading books,\nlike Proﬁts in the Stock Market, by H.M. Gartley (1935), there are observa-\ntions about what accounts for successful versus unsuccessful trading. In-\nterestingly, we have not seen many changes over the decades in this area.\nIt seems to be the same aspects that constantly plague traders. There are,\nhowever, many actions the individual trader can implement to succeed.\nTrading is like any other profession; the student ﬁrst learns the ba-\nsics, and then expands to more sophisticated and in-depth learning in\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 25,
      "text": "Opening Thoughts\n5\nthe chosen ﬁeld. There are no skilled professionals in any ﬁeld who have\nnot reached a level of expertise without hard work and substantial expe-\nrience. Any professional ﬁeld requires a commitment and willingness to\ngo through successes as well as failures. The failures can be the greatest\nteachers. Study the failures to develop into a better trader. Perseverance\nwill be a key to a successful trading career.\nDeveloping a mind-set that is conducive to trading will be essential to\na trader’s success. This will include thinking in terms of probabilities, and\naccepting the fact that losses are as much a part of trading as wins. This\nis a process in itself to learn. These concepts must be internalized so they\nbecome a part of what you do each day without conscious thought.\nLarry Schneider, director of business developments for the Zaner\nGroup, futures and commodities brokers, states that often too much time is\nfocused on learning the method or system in the beginning. This approach\nis contrary to the steps that must be done to meet success in trading. In his\nview and experience, focusing on learning a mental approach ﬁrst would\nbe more beneﬁcial to novice traders. He says it is imperative for traders to\nunderstand that there is a learning curve and money can be lost if traders\ndo not take steps to protect their capital.\nEvery trader has to go through essentially the same learning curve; no\none seems to be exempt from it. Schneider suggests, from his experience of\n34 years in the futures business, that traders start small, perhaps with the\nmini contracts available, while they are learning. If traders take the time to\ninvestigate the mental approach they will need to execute their plan, they\nwill be far ahead of the game. His advice is to approach trading from the\nmental side ﬁrst, then develop your trading methodology and plan.\nWhy Traders Succeed\nWe work with, coach, and mentor many traders. We see and have experi-\nenced the full gamut of things that can happen in trading. Here are some of\nthe reasons we feel traders succeed:\nĹ Solid knowledge and understanding of the markets they are trading.\nĹ Technical expertise on how to trade their markets.\nĹ A sound trading methodology with a proven edge.\nĹ A trading plan based on the methodology.\nĹ Sufﬁcient capital.\nĹ Thinking in terms of probabilities, rather than emphasis on the out-\ncome of any one trade.\nĹ Good money management; adherence to money management rules.\nĹ Having mentors or seeking out experts and peers to gain trading knowl-\nedge.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 26,
      "text": "6\nTRADE WHAT YOU SEE\nĹ Assessing risk ﬁrst, proﬁts second.\nĹ Employment of a set of trading rules.\nĹ A foundation of daily routines, including mental preparation.\nĹ Use of stop-loss protection.\nĹ Maintenance of a high level of conﬁdence and a positive attitude.\nĹ Commitment to the process of trading.\nĹ Perseverance.\nĹ Taking 100 percent responsibility for each and everything that happens\nin their trading.\nĹ Being in the habit of forgetting their last trade, win or lose, and moving\non to the next trade.\nWhy Traders Fail\nConversely, we also see particular reasons traders fail. We would like to\nshare these observations with you in the hope you can learn from these er-\nrors and avoid some of these pitfalls. An ancient proverb states, “The smart\nman learns from his mistakes—the wise man learns from the mistakes\nof others.”\nĹ Lack of knowledge; traders enter the business constantly without a\nsolid understanding of what the business of speculation involves.\nĹ Lack of capital; small accounts typically lose money. Those few with\nsmaller accounts who do succeed eventually hang on until they under-\nstand how leverage can be friend or foe.\nĹ No trading methodology; they use a seat-of-the-pants approach.\nĹ No trading plan.\nĹ Failure to apply a solid money management system.\nĹ Not seeking help from experts or mentors; not wanting to invest in an\neducation of trading.\nĹ Lack of understanding of the inherent risks present in trading.\nĹ Failure to recognize the mental preparation necessary for successful\ntrading.\nĹ No trading rules applied.\nĹ Altering a sound trading plan; early entries, early exits, moving stops,\nnot entering trade setups.\nĹ Random trading, which is trading anything outside of their trading plan\nand is usually emotion-based.\nĹ Failure to develop the discipline necessary to trade successfully.\nĹ Not learning from previous mistakes.\nĹ Lack of commitment to the process of trading.\nĹ Failure to use stop-loss orders, which is the number one way to turn a\nsmall loss into a large loss.\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 27,
      "text": "Opening Thoughts\n7\nĹ Blaming outcomes on external sources and not taking 100 percent re-\nsponsibility for each and every aspect of their trading.\nSTEPS TO TAKE FOR SUCCESSFUL TRADING\nOne very important item to keep in mind while learning to trade: Each ac-\ntion you take repeatedly will become a habit. The habits that form will\nlead to either your success or your failure. Habits in and of themselves are\nneutral; they do not know if they have a positive or negative effect. How-\never, the results of the habits will have a negative or positive outcome in\nyour trading. Therefore, it is in the best interest of each trader to strive to\nform the very best habits that will ensure success.\nTraders want to strive for a point in their trading where they are just\ndoing the necessary actions. They should have a high conﬁdence level that\nover time the edge in their trading will have a positive expectation. This will\nbe developed through testing and implementing a speciﬁc trading strategy.\nWe hope the items we have listed will help you determine which direction\nyou are taking.\nIf you are an experienced trader and you have already formed habits\nthat are not producing the desired results, then take time to evaluate\nyour trading and begin to form new habits that will get you the results\nyou desire in trading. Chapter 13 has a worksheet titled “Twenty Sam-\nple Trades Worksheet” (Figure 13.2), designed to help traders instill new\ntrading habits. It focuses on doing the same positive action through a se-\nries of trades to create new habits and to observe how the trading edge is\nplayed out.\nPositive habits will produce positive results. Negative habits will pro-\nduce negative results and will be self-defeating. It may be helpful to make\na list of any negative habits that are present in your trading, and a separate\nlist of positive habits to replace those.\nAn example of a negative habit may be that the trader consistently ex-\nits a trade before the proﬁt objective is reached. The new positive habit\nwill have the trader hold for the proﬁt objective. Another example may be\nthat the trader enters early before a pattern is completed. The new positive\nhabit will have the trader enter at the correct entry point. Once traders un-\nderstand and know what their edge is, they will begin to see the importance\nof consistently executing their plan. They will see if there is a gap between\nwhere they are and where they want to be. This is a point where the trader\ncan then ﬁll in the necessary steps to close that gap.\nConversely, pay attention to your positive habits. The actions you are\ndoing right in your trading can be developed further into strengths.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 29,
      "text": "C H A P T E R 2\nGeometry of the\nPatterns and\nFibonacci Ratios\nA\nll of the patterns presented in this book are based in geometry; the\nstructure of each pattern is geometrical. As we go through each pat-\ntern chapter, we discuss and present the structure of each pattern\nso that you will learn and understand how each pattern is formed. First,\nthough, this chapter gives an overview and brief history of geometry in the\nmarkets. We hope to impart to you the importance that geometry plays in\nthe markets and especially in the patterns presented in this book.\nWe will give you a glimpse into the studies of some of the market fore-\nfathers who pioneered this aspect of market study, such as W.D. Gann,\nGeorge Bayer, and Bryce Gilmore, author of The Geometry of Markets.\nFigure 2.1 gives a clear idea of what we are referring to throughout\nthe book when we mention a geometric triangle or symmetrical pattern.\nIt shows a perfect triangle that was formed by price, creating a trading\nopportunity.\nFigure 2.2, in contrast, shows an asymmetrical geometric pattern, and\ngenerally we want to ﬁlter out those patterns and look for the ones with\nthe best symmetry. This example shows an extreme expansion in this\nmarket that was trending. Note the long range bars signifying a wide price\n9\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 31,
      "text": "Geometry of the Patterns and Fibonacci Ratios\n11\nHISTORY OF GEOMETRY IN THE MARKETS\nThe history of technical analysis and its relationship to geometry began in\nthe 1930s with the work of W.D. Gann. Gann became famous for the use\nof Gann angles, which are now found in many charting software packages.\nThese angles were especially well known for the 45-degree line and his\nsquare of 9 charts, which basically divided a circle into 12 30-degree sec-\ntions. In fact, this was a way of using harmonic numbers (see Chapter 3\non harmonic numbers), but was arrived at very differently than how we\ndiscuss them in this book.\nThere was always much speculation around Gann’s life and work after\nhis death in the early 1950s. There are stories that he made more than $55\nmillion trading, although his surviving four children attested that this was\nnot the case and that his estate had been worth around $250,000, which in\nthe 1950s was still a considerable amount.\nIn the 1930s, a trader by the name of George Bayer introduced the to-\ntal Fibonacci summation series to traders. He wrote several books; one in\nparticular, called The Egg of Columbus, was once offered for sale in the\nmid-1980s for $25,000. Extremely rare and less than 100 pages long, the\nbook was difﬁcult for most readers to understand. In it Bayer described\nthe progression of the Fibonacci series using diagrams of birds, ﬁsh, and\nmammals as a type of mystical code. The code was apparent to those famil-\niar with the Fibonacci summation series but very difﬁcult for anyone not\nfamiliar with it. He may have been trying to alert his readers to the strong\nnumerical ties that linked Fibonacci numbers and astronomy.\nUnlike Gann’s children, Bayer’s daughter stated that her father had\nmade a very successful living from the business of speculation. Each year\nhe would take his private rail car from his home in Carmel, California, and\ntravel to the Chicago Board of Trade to trade the grains.\nOne unique common interest that Gann and Bayer shared as market\nspeculators was an additional study of astrology in the markets, then and\nnow referred to as astro cycles. Although we do not cover the subject of\nastro cycles in this book, it is worth noting an article by Lisa Burrell in the\nHarvard Business Review of November 2006 that cites research by Ilia\nD. Dichev and Troy D. Janes into stock prices during the 28.5-day cycle\nbetween a new moon and a full moon. The article says the cycle may have\nan application in predicting stock prices.\nThis is not at all surprising, given the fact that the markets are fueled by\nthe energy of market participants. Changes in people’s moods and behavior\naround moon cycles have been well documented throughout the years, and\nthese can also be found in the changes of price behavior in the markets.\nEven the legendary twentieth-century ﬁnancier J. Pierpont Morgan was\nquoted as saying, “Millionaires don’t use astrology, but billionaires do.” For\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 32,
      "text": "12\nTRADE WHAT YOU SEE\nmany years he employed a full-time ﬁnancial astrologer by the name of\nEvangeline Adams.\nArch Crawford is probably the best-known of the contemporary mar-\nket astrologists and has produced some of the most accurate market pre-\ndictions, published in his newsletter The Crawford Perspectives. Craw-\nford is a well-known and respected market technician in the trading\narena today.\nAnother trader and important pioneer in using geometry in the markets\nwas William Garrett. In 1972 his book Torque Analysis of Stock Market Cy-\ncles was published (it is now available through Traders Press). In this book\nGarrett describes the progression of a price chart. On page 89, he explains\nhow it is dissected into triangles that lead through a normal progression\nof expansions. These expansions form a circle, which leads to the squar-\ning of the circle (unifying the two shapes by making them equal in area or\nperimeter), leading to an ellipse. This is done through the progression of\nFibonacci numbers:\nĹ .618 – 1.618.\nĹ 1.618 – 2.618.\nĹ Pi, 3.14, which is the ratio of the circumference of a circle to its diam-\neter.\nWe assure you the patterns we present in this book are not nearly\nas complicated as this may sound. Several extremely accomplished mar-\nket technicians over the years have made a lifetime study of the markets\nthrough the use of geometry. Because of their breakthroughs and develop-\nments, we now have the patterns in this book rooted in geometry, sacred\ngeometry, and the application of Fibonacci ratios. It should be noted here\nthat the basis of sacred geometry is not one of a religious nature but rather\none made up of the ratios, square roots, and reciprocals of the numbers 1\nthrough 5.\nFIBONACCI RATIOS\nSo what are Fibonacci ratios, and where did they come from? Let’s start\nwith what they are; we will go back to ancient times to answer this ques-\ntion. Pythagoras (ca. 580–500 B.C.E.) is considered to be the father of\nmodern geometry. He was also a great philosopher of ancient Greece and\nfounder of the Pythagorean brotherhood. He and his students believed and\ntaught that reality is mathematical in nature. They believed that numbers\nand proportion were harmonic and that everything was related through\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 33,
      "text": "Geometry of the Patterns and Fibonacci Ratios\n13\nFigure 2.3\nExample of two symmetrical triangles forming an AB=CD pattern.\nmathematics. However, the mathematical system we use today was still\nmany centuries away and was not used by Pythagoras and his students, so\nthey were limited in proving their theories.\nThis belief in proportion and harmony has been intricately linked\nthroughout history to what is referred to as the golden mean. Other terms\nfor this include divine proportion, golden section, and golden ratio. These\nall refer to phi, which is the mathematical term to describe the proportion\nof the whole to its parts, which is considered to be the perfect proportion.\nThese teachings and many others of Pythagoras were passed down\nthrough the centuries. It is even alleged that the Freemasons were an off-\nshoot of the secret school of Pythagoras.\nIf we move up the time line to circa 300 B.C.E., this was when one of\nthe last great ancient Greek philosophers, Euclid, lived. He was the ﬁrst to\ncoherently express the golden mean as a mathematical ratio. Figure 2.4 is\nan illustration of this proportion. The line AB represents the whole. The\nratio of AB to AC will be the same as the ratio of AC to CB. This calculates\nto a ratio of 1.618 to 1, which can also be referred to as phi, the golden\nmean.\nFigure 2.4\nExample of proportion using the golden mean ratio.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 34,
      "text": "14\nTRADE WHAT YOU SEE\nThe ratio and proportions of the golden mean are abundantly appar-\nent in nature, music, art, science, and the cosmos. The Great Pyramid of\nGiza, one of the seven wonders of the world, is structured with these pro-\nportions. Other examples include the Parthenon and works of great artists\nsuch as Leonardo da Vinci, Rembrandt, and the nineteenth-century English\nartist J.M.W. Turner, to name a few. These are just a few. If you delve into\nart history books you will ﬁnd a plethora of artists who employed these\nproportions seeking balance and harmony, some consciously and others\nintuitively.\nIn nature these proportions are endless. They live and grow around us\nin all corners of the world. Many species of ﬂowers—sunﬂowers, roses,\ndaisies—are all fantastically imbued with these proportions. Seashells,\npineapples, and even our faces, bodies, and limbs are in proportion to the\ngolden mean. If you were to measure the distance from your elbow to the\ntips of your ﬁngers, then the distance between your ﬁngertip to your wrist,\nand then wrist to elbow, these proportions would mirror the golden mean\nillustrated in Figure 2.4.\nIn the cosmos there are many examples of these proportions. Planets\nmove in elliptical fashion, and their orbits coincide with the expansion of\nthe Fibonacci summation series. An example is Earth’s orbit in relation\nto the Venus/Uranus cycle. These planetary orbits possess the unique Fi-\nbonacci relationship of.618; it takes 225 days for Venus and Uranus to make\na complete cycle from conjunction to conjunction. If we take 365 days\n(Earth’s cycle) and multiply it by.618, we come out with 225. There are\nmany relationships that repeat these same types of cycles, too numerous\nto list here.\nOn our time line we now move forward to Pisa, Italy, in the twelfth\ncentury A.D. It was here that Leonardo of Pisa (ca. 1170–1240) was born.\nHe was brought up in times of a revived interest in education, especially in\nthe Greek sciences and philosophies.\nLeonardo was given the nickname “Fibonacci” posthumously, possibly\nderived from his father’s name, Bonacci. At any rate, his name today is\nsynonymous with the famous Fibonacci sequence.\nLeonardo initially studied mathematics with a system derived from\nRoman numerals. He would soon make an enormous contribution to the\nevolution of mathematics that remains with us today. He had learned the\nEastern (Indian) system of using nine numerals and studied intensively\nwith mathematicians in several Mediterranean countries. It is known that\nLeonardo did travel to Egypt and studied the proportions of the pyramids,\nincluding Giza. It must have been of great interest to him to ﬁnd that the\ndimensions of this great pyramid contain the Fibonacci ratios or golden\nmean.\nOut of these studies he wrote a book called Liber abaci (Book of Cal-\nculation). This book introduced to the world, although one copy at a time,\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 35,
      "text": "Geometry of the Patterns and Fibonacci Ratios\n15\nthe system of using nine numerals. He expanded his impressive mathemat-\nical knowledge, and eventually this is what has been adopted and applied\nas the standard mathematical system we now use.\nAll calculations before this revolutionary system were done labo-\nriously with an abacus. Errors, of course, were difﬁcult to track, be-\ncause one had to start over each time. His new mathematical symbols\nopened the doors for simplifying what had been complicated mathemat-\nical calculations—multiplication and division, not to mention mathemati-\ncal problems beyond those. They also allowed for an enhanced commerce,\nwith these new mathematical symbols enabling businesspeople to enrich\ntheir businesses. Commerce at the time was on the verge of ﬂourishing\nin Europe.\nThe Fibonacci numbers came about from a problem with rabbits that\nLeonardo solved, which led to the discovery of the Fibonacci series. In his\nbook Liber abaci a problem is solved regarding how many rabbits would\nbe produced in one year’s time beginning with two rabbits. The answer is\nwhat we know today as the Fibonacci summation series:\n1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1,597,\n2,584, 4,181, 6,765, 10,946 . . .\nThe sequence goes on into inﬁnity. Each number is the sum of the two\npreceding numbers, such as: 1 + 1 = 2; 1 + 2 = 3; 2 + 3 = 5; 3 + 5 = 8.\nMany things are fascinating about this sequence, but in particular is the\nrelationship it has to the golden mean. If you take two numbers past the\neighth sequence and divide the smaller number into the larger, you will get\n.618.\nHere are three examples:\n1. 89 ÷ 144 = .618\n2. 987 ÷ 1,597 = .618\n3. 6,765 ÷ 10,946 = .618\nIf you divide the larger number into the smaller number after the eighth\nsequence you will arrive at 1.618, which is one of the extension ratios you\nwill see us using in the chart examples later in the book. For example:\n377 ÷ 233 = 1.618\nIt took many years for Leonardo’s contribution to take hold and change\ncommerce, which was his vision, and propel the world of mathematics for-\nward. It is doubtful that his vision could have included or that he could\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 36,
      "text": "16\nTRADE WHAT YOU SEE\nhave known this incredible sequence would centuries later be applied to\nthe art of speculation and trading markets.\nIn the next section of this chapter we take a look at the speciﬁc Fi-\nbonacci ratios we use on a daily basis in our chart patterns.\nAPPLYING THE FIBONACCI RATIOS\nThere are many Fibonacci ratios as you can imagine from looking at the\nFibonacci sequence. We focus on just a few in our trading. In later chapters\nyou will ﬁnd many chart examples using these ratios.\nThese are the main Fibonacci ratios we use in the chart pattern struc-\ntures:\nĹ .618—\u0001\nĹ .786—square root of .618\nĹ 1.000\nĹ 1.272—square root of 1.618\nĹ 1.618\nWe do look at and use occasionally some secondary ratios, and these\nare:\nĹ .382—used mainly in trending conditions\nĹ .500—used mainly in trending conditions\nĹ .707—used with AB=CD patterns that complete between .618 and .786\nĹ .886—square root of .786; used with AB=CD patterns completing be-\nlow .786\nĹ 2.000—used in markets expanding beyond 1.272 and 1.618 extension\nnumbers\nSee Figure 2.5 for a chart example of how the Fibonacci ratios look\nas applied with a Fibonacci retracement tool. In this example we show\nthe .382, .500, .618, .786, 1.000, 1.272, and 1.618. This is a standard setting\nusing a Fibonacci retracement tool found in many software packages, and\nis generally the standard setting we use.\nNow we can take a look at how these Fibonacci ratios look placed\nonto an actual price chart in Figure 2.6. You can see how the price reacted\nat each Fibonacci ratio level. This is a swing from low to high, and point\nX is the low of the swing. In this example the price found support almost\nexactly on the .618 level. This means that the price retraced down from the\nhigh of the swing at point A to the.618 price level. That is approximately\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 37,
      "text": "Geometry of the Patterns and Fibonacci Ratios\n17\nFigure 2.5\nExample of Fibonacci ratios used.\ntwo-thirds of the total swing length. A retracement of .382 is approximately\none-third of the total swing length, and the .500 level is half of the swing\nlength. The .786 level is approximately three-quarters of the entire swing\nlength.\nFigure 2.6\nExample of Fibonacci ratios applied to a price chart.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 38,
      "text": "18\nTRADE WHAT YOU SEE\nWe want to note here that we do not always get a perfect support or\nresistance at a Fibonacci ratio, as you will see in the many chart exam-\nples in this book. We always use the ratios in combination with the var-\nious charting patterns and also with current market conditions—that is,\na range trading environment (contracting) versus a trending environment\n(expanding).\nThe approach using geometric triangles is simple in that we are looking\nat points that connect from highs to lows and vice versa. Triangles that are\ncontracting are contracting by the numbers of .618 and .786.\nTriangles that are equal are those that have AB=CD legs (see\nChapter 4 on the AB=CD pattern). The triangles that are expanding are\nexpanding to the 1.272 and the 1.618 ratios. Patterns that have to be forced\nare usually in the asymmetrical category and should be avoided. There\nare many opportunities with well-formed symmetrical patterns, and the\ntrader should focus on those. Refer back to Figure 2.3. As with any trad-\ning method, all trades are only a probability and never a certainty.\nWhat you will observe as you study and learn these patterns is that\nsome stocks and markets tend to repeat one Fibonacci ratio more than\nothers. As an example, you may notice that a particular stock tends to trade\nto the .786 more frequently than the .618. Or you may notice one of the\nsecondary numbers more frequently in one stock or market, such as the\n.707. It will be helpful to note these observations when you see them.\nSUMMARY\nAs you can see in a review of this chapter, geometry and the price patterns\nformed are interchangeable. Geometry is an important foundation for each\npattern presented in this book. The patterns are all triangles of varying\ndegrees and sizes, and some we have given clever names to, such as the\nGartley “222” pattern (Chapter 5) or the Butterﬂy pattern (Chapter 6).\nThe basic principles remain the same: These patterns are geometric;\nthey repeat and can be quantiﬁed. As you study and gain experience, you\nwill train your eye to the symmetrical versus the asymmetrical patterns.\nAs those of us who have studied and now apply these principles have\nlearned, these patterns based in geometry have always been in the price\nchart, and it was a matter of someone teaching us how to see them. Our\nhope is that many of you reading this book who have never looked at a\nprice chart from this perspective will be as taken as we were when we ﬁrst\nlearned about these phenomena.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 40,
      "text": "20\nTRADE WHAT YOU SEE\nwho was a broker at the Conti Commodity Trading ofﬁce in Westwood,\nCalifornia, had studied W.D. Gann extensively and is considered an expert\non Gann. He had worked for over a year in the 1970s at a bookstore called\nThe Investment Center, which was located a short distance from the Conti\nCommodity Trading ofﬁce. The bookstore had an extensive library of over\n5,000 investment books. This gave Twentyman an opportunity to study all\nof Gann’s works, including the astrology books Gann had worked on.\nTwentyman’s knowledge of numbers from sacred geometry evolved\nfrom these studies. He had worked with one of Gann’s concepts of squaring\nprice and time together. By utilizing Gann’s square of 9 (which was a circle\nof 360 degrees divided into 12 30-degree segments) and the numbers from\nthe Fibonacci summation series, he discovered what are now known as\nharmonic numbers. These are the numbers that repeat in all markets in all\ntime frames.\nDEFINING A HARMONIC NUMBER\nLet’s start with a deﬁnition of the word harmonic as it pertains to physics:\nHar-mon-ic—Physics—Any component of a periodic oscillation\nwhose frequency is an integral multiple of the fundamental fre-\nquency.\nAs you study the markets or individual stocks, you will see that they\ndo only one of three things at any given time:\n1. Move up.\n2. Move down.\n3. Move sideways.\nMarkets are always in a process of either expanding or contracting.\nGenerally, markets spend more time contracting—trading in a range, trad-\ning sideways, forming support and resistance areas—than they do in a\ntrend. Refer to Figure 3.1 for an example of a sideways-trading market.\nA trend can be deﬁned as higher highs and higher lows for an uptrend,\nand lower highs and lower lows for a downtrend. See Figure 3.2 for an\nexample of a downtrend and Figure 3.3 for an example of an uptrend. When\nmarkets are in a range they are contracting, and when they are in a trend\nthey are expanding. Here is where we would like you to think in terms of\nvibrations, repetitions, and swings.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 46,
      "text": "26\nTRADE WHAT YOU SEE\nrepetitive swing. What you see in Figure 3.8 are harmonic swings of the 60-\nminute price chart of the Dow futures. This clearly illustrates the repetition\nthat is present in this market on this time frame.\nLet’s look at a few more charts illustrating these repetitions. Figure 3.9\nis a 15-minute chart of IBM. This chart shows repetitive upswings. The two\nswings form an AB=CD pattern, which is the ﬁrst pattern we will present\n(see Chapter 4, “The AB=CD Pattern.”) You can start to get a sense of the\nimportance of these harmonic swings and the role they will play in learning\nand trading the patterns in this book.\nThe next example is Figure 3.10, a 30-minute time frame chart of\nGoogle. It shows repetitive swings or harmonics forming both up and\ndown. If you study the chart, you will notice a set of smaller harmonics\nthat form the second upswing in the chart. Again, those swings are forming\nanother pattern in this book, a Gartley sell pattern. (See Chapter 5, “The\nGartley ‘222’ Pattern.”)\nLater in this chapter we will show you, using the S&P 500 E-mini, vari-\nations of a harmonic number using multiples of that number and Fibonacci\nratios.\nThe S&P 500 E-mini 60-minute chart in Figure 3.11 shows the har-\nmonic swings in terms of points, as well as equal length in the swings. The\nFigure 3.9\nIBM 15-minute chart showing harmonic swings forming an AB=CD\npattern.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 48,
      "text": "28\nTRADE WHAT YOU SEE\nFigure 3.12\nWheat futures 60-minute chart showing repetition, vibration, and\nsmaller harmonic within a larger harmonic.\nupswings are within 2 points of each other and the corrective swings down\nare within 1 point.\nAlso interesting to note is that each of the corrective downswings in\nFigure 3.11 relate to the .618 retracement levels. They are each a .618 re-\ntracement from the swing low to high. You want to learn to identify mul-\ntiple areas of support and resistance using harmonic numbers, Fibonacci\nratios, and patterns. At times you may have several Fibonacci ratios at one\nprice level with a pattern completing, and most likely if you also study the\nharmonics you will ﬁnd those present as well.\nFigure 3.12 shows an easy-to-identify example of harmonic numbers\nthat include vibration and repetition. The dashed lines in this wheat futures\nchart show the smaller harmonic within the larger harmonic or swing. It is\nnot unusual to see this occurrence, where one swing is broken into two or\nmore harmonic swings that make up the larger harmonic.\nFINDING HARMONIC NUMBERS\nTo ﬁnd the harmonic or vibratory number in a stock or market is not dif-\nﬁcult. You want to ﬁnd the common swings using length, or in terms of\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 51,
      "text": "Harmonic Numbers and How to Use Them\n31\nFigure 3.14\nS&P 500 E-mini harmonics at work. Harmonic swings on a 5-minute\nS&P 500 chart.\nAnother example of the harmonics in the S&P 500 is shown in\nFigure 3.15. In this example we see a large range of the harmonic numbers\nover a short time period of two days. We see a corrective move up that\nformed an AB=CD sell pattern. (See Chapter 4, “The AB=CD Pattern.”)\nWhen we see this type of pattern form using the harmonic numbers, we\nalso want to combine Fibonacci ratios to help us ﬁnd additional areas of\nsupport or resistance, in this case resistance.\nThe corrective pattern completed very close to the 16.2 harmonic num-\nbers (within 1.25 points), at the .618 level, as seen in Figure 3.16. By com-\nbining these two resistance levels—the harmonic numbers and the .618 Fi-\nbonacci retracement level—we are able to then determine the entry point\nand stop placement for this type of setup.\nIt is worth repeating that we are not trying to ﬁnd exact harmonic num-\nbers to the tick to enter trades. We are working with ranges, price zones,\nand common areas of support or resistance. We use the harmonic numbers\nas a tool in conjunction with the patterns and the Fibonacci ratios.\nWhen to Use Expansions of Harmonic Numbers\nSince harmonic numbers are repetitive and are part of vibrations in the\nmarkets, and we know that the price will not remain in a range forever,\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 52,
      "text": "32\nTRADE WHAT YOU SEE\nFigure 3.15\nLarge ranges of harmonic numbers over a two-day period.\nFigure 3.16\nCombining Fibonacci ratios with harmonic numbers in S&P 500\nE-mini 15-minute chart.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 53,
      "text": "Harmonic Numbers and How to Use Them\n33\nthen we must look at occurrences when we see expansion and then look\nat multiples of the harmonic numbers. Practical experience has shown that\nonce a market goes beyond its primary harmonic number, then that market\nor stock can see a multiple of two to three times that harmonic number and\nsometimes more. This is related to a concept Gann worked on, which was\nthe concept of overbalancing. When both price and time exceeded normal\ncorrections, the main trend has most probably changed. This may be seen\non a lower time frame ﬁrst and then on the longer-term time frames as price\ncontinues to reverse.\nUsing the 3 Percent Rule for Finding a Harmonic\nNumber and Practical Applications\nAnother method for ﬁnding the harmonic numbers in a stock or market\nis to use 3 percent of the value of the stock, commodity, or currency. If\nwe use IBM as an example (see Figure 3.17), the ﬁrst swing shows a high\nat $99.48. The 3 percent harmonic would be approximately $2.98 (this can\nbe rounded up or down a few cents). The market retraced approximately\none-half of that harmonic, or $1.52. We can use $2.98 for placing a stop-loss\norder if buying the pullback. Conversely, if short from that high, then the\n$2.98 could also be used for placing a stop-loss order.\nFigure 3.17\nUsing harmonic numbers for placing stop-loss orders and initiating\ntrades in an IBM 60-minute chart.\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 54,
      "text": "34\nTRADE WHAT YOU SEE\nThe area in Figure 3.17 marked #2 has a harmonic number using 3 per-\ncent of $100.44 per share, or approximately $3.00. We would then look for\na pullback of approximately $3.00 per share. This area can be used as a\nproﬁt target area for any short sales from the swing highs.\nFigure 3.17 also shows an AB=CD pattern (see Chapter 4, “The AB=CD\nPattern”) that formed into the area of the harmonic number. Again, this\ncombines two elements: harmonic numbers and a pattern. The trader, if\ninitiating a long trade, could then use the harmonic of $3.00 to place a stop-\nloss order.\nLet’s review the different applications of the harmonic numbers in Fig-\nure 3.17:\nĹ If the trader had entered a short trade near the swing highs, a stop-\nloss order could be placed just beyond the harmonic $3.00 per share\n(3 percent).\nĹ A projection down from the highs, using the harmonic number, could\nbe used to take proﬁts from a short-sale trade.\nĹ A long trade could be initiated at the completion of the AB=CD pattern,\nwhich is also at the $3.00 harmonic.\nĹ A stop-loss order can be placed on long trades in this example using\nthe $3.00 harmonic.\nUsing harmonic numbers as a guideline should help you in several\nways:\nĹ They can help you understand the rhythm and price swings of a partic-\nular market.\nĹ They should help you in stop-loss placement by reducing risk in a trade\nto a manageable level and within speciﬁc money management guide-\nlines. (See Chapter 11, “Trade Management.”)\nĹ You’re aware of the combinations and different elements for trade se-\ntups, such as harmonic numbers, Fibonacci ratios, and patterns for ini-\ntiating trade setups, and taking proﬁt objectives.\nFinally, harmonic numbers are an integral part of forming many pat-\nterns presented in this book.\nHARMONIC NUMBERS FOUND\nIN OTHER MARKETS\nHere are some of the harmonic numbers found in other markets:\n",
      "candlestick_hits": 4,
      "is_highly_relevant": true
    },
    {
      "page": 55,
      "text": "Harmonic Numbers and How to Use Them\n35\nĹ Bond market—20 ticks.\nĹ Crude oil—44 and 88.\nĹ Dow Jones—35, 105, and 70.\nĹ Euro market—35 and 70.\nĹ Gold market—11 and 17.\nĹ Silver market—18, 36, and 12.\nĹ Wheat—11 and 17.\nĹ Soybeans—18 and 36.\nUse multiples of these numbers in strong markets. Remember that dif-\nferent variations of these numbers will be found in swings depending on\nwhether the market is contracting or expanding. The harmonic for a 5-\nminute chart may vary as opposed to a 30-minute chart. They will be re-\nlated, however, by percentages. The harmonic on a smaller time frame such\nas a 5-minute chart may be one-half or .618 percent of the larger harmonic\nnumber.\nThe only way to learn is to observe these numbers for yourself. If on\na daily basis you were to track the swings in any given market on a 5-,\n15-, or 30-minute chart and keep a record, you would then begin to see the\nrepetitions that occur frequently. If you did this over a 30-day period, you\nwould see almost every type of pattern occur within that time period: up,\ndown, and sideways, contracting and expanding. You would also see the\ntheory of harmonic numbers unfold and the relationship they have to the\nFibonacci summation series.\nThe basic geometry, Fibonacci ratios, and harmonic numbers, as you\nwill see, are the foundations for the patterns presented in Chapters 4\nthrough 10.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 59,
      "text": "C H A P T E R 4\nThe AB=CD\nPattern\nI\nt has been said many times in trading to study, learn, and trade methods\nthat are simple in nature. The AB=CD pattern is one of the most basic\nand simple patterns in technical analysis. If the trader will take the time\nto learn this pattern and its variations, it will be time well spent.\nWe teach you this pattern here both in structure and from a trading\nstandpoint using real chart examples. In coming chapters we show you\nhow this simple pattern is also formed within other patterns such as the\nGartley “222” pattern, Butterﬂy pattern, Three Drives pattern, and some of\nthe classic technical analysis patterns.\nHISTORY OF THE AB=CD PATTERN\nIn 1935 a book was published for sale to investors at an incredible price\nof $1,500. That book was Proﬁts in the Stock Market by H.M. Gartley. On\npage 249, under “Practical Use of Trend Lines,” Gartley describes a chart\npattern that we now call the AB=CD pattern. (See Figure 4.1.)\n39\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 60,
      "text": "40\nTRADE WHAT YOU SEE\nFigure 4.1\nIllustration of the Parallel Trend Lines chart found in H.M. Gartley’s\nbook, Proﬁts in the Stock Market (1935).\nCourtesy of Lambert Gann Publishing. P.O. Box 0, Pomeroy, WA 99347. www.\nwdgann.com.\nThis pattern has appeared in another work, one by Frank Tubbs. Tubbs\noffered a correspondence course in the 1950s called The Frank Tubbs\nStock Market Course. This course was based on the pattern that Gartley\nhad explained in his 1935 book.\nTubbs used many charts from the 1920s and 1930s in his description\nof the pattern and brought the work forward into the 1950s, validating this\nclassic pattern. Charles Lindsay also used this pattern in his book Trident:\nA Trading Strategy written in 1976. Lindsay identiﬁed trends as micro,\nminor, intermediate, and major. He illustrated that the parallel price swings\nwere apparent on all charts and in all time frames. The system described\nwas identical to Gartley’s pattern. Lindsay labeled his pattern with P1, P2,\nP3, and P4, which were nothing more than A, B, C, and D.\nLindsay took the AB=CD pattern and made it into a formula that would\ngive the pattern a completion target at D (P4), so the formula would be:\nP4 = P2 + P3\nP1\nThis is equivalent to:\nD = B + C\nA\nHe then came up with a formula that said P3 should be a ratio of .625\nof P1 to P2. This is equivalent to a .618 retracement by the BC leg from the\nAB swing. (See Figure 4.2.) He took 25 percent of the P1 or the ﬁrst leg as\na risk factor.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 61,
      "text": "The AB=CD Pattern\n41\nFigure 4.2\nMerck (MRK) daily chart showing AB=CD pattern with .618 retrace-\nment of the AB leg. This is similar to Lindsay’s .625 retracement of the P1 to P2\nleg.\nAB=CD PATTERN DESCRIPTION\nGartley’s description of the AB=CD pattern illustrated how the market\nwould rally in an uptrend and then retrace. It would then rally to another\nuptrend then make another retracement, forming an upsloping parallel\nchannel. It was from this description that the AB=CD pattern achieved its\nnickname, the lightning bolt. (See Figure 4.1.)\nGartley spent several pages referring to these trend lines and parallel\nlines as excellent signals when used in conjunction with other working\ntools. He also applied these lines to price ratios. He used mainly ratios of\none-third and one-half for retracements.\nAB=CD PATTERN STRUCTURE\nThe AB=CD pattern is found in all markets and all time frames. This pat-\ntern is the foundation for the Gartley buy and sell patterns (discussed in\nChapter 5). It is also an integral part of the Butterﬂy pattern (Chapter 6)\nand also forms a part of the Three Drives pattern (Chapter 7). The pattern\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 62,
      "text": "42\nTRADE WHAT YOU SEE\nis a measured move where the CD leg is similar in length to the AB leg. It\nshould be noted, though, that the CD leg can extend and will not always be\nexactly equal to the AB leg; this is discussed in “Important Characteristics\nof the AB=CD Pattern” later in this chapter. Figure 4.3 shows the shape of\nthe basic AB=CD buy and sell patterns.\nThere are three legs that form this pattern. (See Figure 4.4.) The ﬁrst\nleg of the pattern is labeled AB. After the completion of the ﬁrst leg, a re-\ntracement or correction occurs that will usually ﬁnd support or resistance\nat one of these Fibonacci levels: .382, .50, .618, or .786. This correction\nor retracement is labeled BC and is the second leg of the pattern. (Note:\nStrongly trending markets will usually see only a retracement to the .382\nlevel. See the chart in the “Slope and Time Frames” section later in the\nchapter for an example of a shallow retracement at the .382 level.)\nFigure 4.3a\nBasic structure of the AB=CD pattern, illustrating the “lightning bolt”\nshape of the buy and sell patterns.\nFigure 4.3b\nAB=CD buy and sell patterns with S&P E-mini chart price.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 64,
      "text": "44\nTRADE WHAT YOU SEE\nFigure 4.5\nEuro daily chart. Once price exceeds B, we assume the pattern will\ncomplete at point D.\nIMPORTANT CHARACTERISTICS OF THE\nAB=CD PATTERN\nAbout 40 percent of the time, the AB=CD pattern will be perfectly symmet-\nrical, meaning AB equals CD. The other 60 percent of the time variations\nof the pattern will be present. What this means is that after the AB leg\nhas formed and the retracement leg, BC, has completed, the CD leg will\nbe different from the AB leg. The two legs may or may not be perfectly\nsymmetrical.\nSome of the ways the CD leg can vary from the AB leg include:\nĹ The CD leg is an extension of AB anywhere from 1.27 to 2.00 (or\ngreater). See Figure 4.6 as an example.\nĹ The CD leg has a slope or angle steeper or wider than AB.\nAt ﬁrst glance this variation might make the trader think the pattern\nis not tradable. The key lies in identifying the BC leg. The most important\nthing is to watch the price action coming after point C has formed. Many\nof the examples that you will see in this chapter will show that the CD leg\ndetermines the relationship to the AB leg.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 68,
      "text": "48\nTRADE WHAT YOU SEE\nFigure 4.11\nA very long bar from the C turning point in this Intel (INTC) daily\nchart indicates that the CD leg will be an expansion of the AB leg.\ngasoline. It would be easy to understand the Ferrari powered with high-\ntech gasoline getting to the ﬁnish line ﬁrst. Watch the CD leg, because if it\nstarts fast, that is the faster Ferrari going further faster.\nSLOPE AND TIME FRAMES\nThe slope or time frame of the BC move can also be helpful in determin-\ning the pattern. BC legs generally correct to one of the Fibonacci ratios:\n.382, .50, .618, or .786. The slope of this BC leg is usually a good indica-\ntion of what the next CD leg will be. For example, assume that the AB leg\ntook 15 trading bars to reach point B, and now the BC leg has taken 8 bars\nbut has retraced only .382 percent of the AB leg. This is a sign of the mar-\nket absorbing a lot of selling at a high price; it is a shallow retracement,\nand the price has not been able to retrace to .50, .618, or .786 percent. We\nwould assume that prices would go much higher and possibly quite rapidly\nonce the selling slows. However, if the market retraces to a .618 or .786\nretracement, the CD leg will most probably be a normal move equaling\nAB=CD.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 69,
      "text": "The AB=CD Pattern\n49\nTo ﬁgure the extension of the CD leg, take the difference between A\nand B and multiply it by 1.272 or 1.618; then add the resulting ﬁgure to the\nlow (or subtract it from the high) of C. The steps in Figure 4.12 to ﬁnd the\n1.618 projection would be calculated like this:\nĹ B = 1274 −A = 1256 = 18 points\nĹ 18 points × 1.618 = 29.12\nĹ Add this to the low of C: 1266.25 + 29.12 = 1295.37\n(If ﬁguring 1.272 or any other extension number, simply use that num-\nber in place of 1.618.)\nThe number of time bars in the AB=CD pattern will usually range from\nﬁve to eight bars. When the CD leg is extending beyond eight bars in an up\nor down move, the probability is for a price extension where CD will be\n1.272, 1.618, or greater of the AB swing.\nThe examples in this chapter give a good point of reference to study\nthese types of patterns. The reader should keep in mind that these pat-\nterns are only probabilities; they are not certainties, and trying to use these\npatterns without a solid understanding of them and a sound money man-\nagement strategy is equivalent to trading suicide.\nFigure 4.12\nIn this S&P E-mini 30-minute chart, the 1.618 extension can be ﬁg-\nured by taking the diﬀerence between the high and low of AB, multiplying it by 1.618,\nand adding it to the low (or subtracting it from the high) of C.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 70,
      "text": "50\nTRADE WHAT YOU SEE\nPSYCHOLOGY OF THE AB=CD PATTERN\nClassic crowd psychology also forms the legs of the AB=CD pattern. There\nare two mechanisms that make the market move up and down—more buy-\ners or more sellers; this is the ultimate greed barometer. Since fear is a\nstronger emotion than greed, markets tend to go down faster than they go\nup.\nPrice action in any actively traded market can be broken down into\nthree steps:\n1. Up moves.\n2. Down moves.\n3. Sideways moves.\nThe AB=CD pattern contains all three of these movements in a sim-\nple geometric form. Its trading value comes from its repetitive nature. It\nmeasures buying enthusiasm and selling climaxes.\nUsing an AB=CD sell pattern as an example (refer back to Figure 4.5),\nas the price begins to rise in the AB leg it catches the interest of those want-\ning to be in early. This could be early buying from large money sources\nsuch as mutual funds, pensions, and so on. As the price continues to rise,\nspeculators may take note and climb on board, causing the price to rise\nfurther into the AB leg. Toward the top of the AB leg, individual investors\n(the general public) may start buying, not wanting to miss the move. There\nmay be some news items on the individual stock or market, further draw-\ning attention to the price rise. It is usually the case that this is toward the\nend of the ﬁrst leg. Once the ﬁrst leg is complete, some proﬁt taking oc-\ncurs and the price begins down. Those who bought near the top of this leg\nare now at a loss and some fear begins to set in, which can increase the\nselling.\nAs the price declines toward the Fibonacci retracement levels, those\nwho may have missed the ﬁrst move up begin to step in to buy the dip.\nInstitutional investors may add to their positions, and speculators also may\nstep in to buy a higher low, providing price support. The selling subsides,\nand the price ﬁnds support as more new buyers come into the stock or\nmarket and the price begins to resume its rise (CD leg). At this point some\ninvestors who rode out the loss from buying near the top of the AB leg\nmay sell as the price approaches their breakeven point on the retracements\nback up from the BC leg. Some who missed getting out at a proﬁt near the\ntop of the AB leg now take proﬁts as the price is close to those levels again.\nThe CD leg now begins to repeat the cycle of buyers, and as the price\nrises further those who realized they sold too soon may jump back in. A\nnew surge of buying (or selling) will then push the price through the B\npoint to complete the pattern at D.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 71,
      "text": "The AB=CD Pattern\n51\nTRADING THE AB=CD PATTERN\nThe AB=CD pattern can be found and traded in any time frame. We will\nshow you examples of how we approach trading this pattern, including ex-\namples of both winning and losing trades. Here we show trade chart exam-\nples and trade management that could be applied to each trade; ultimately\nit is up to the individual trader to use a well thought-out and studied trading\nplan. (See Chapter 13, “Building a Trading Plan.”)\nWe use two contracts in the futures or commodities markets trades to\nillustrate examples of scaling out in two parts, and also present an alternate\ntrade management example using one exit. The stock examples use 200\nshares to illustrate scaling out in two parts.\nTrade Setup #1: AB=CD Sell Pattern\nMarket: S&P 500 E-mini\nContracts: 2\nIn the trade shown in Figure 4.13, the S&P E-mini market completes\na picture-perfect AB=CD sell pattern. A limit order would be used on this\nentry at approximately 1286 to go short, just below the completion point at\nD. Once the order is ﬁlled, a stop-loss buy order is placed 5 points above\nthe entry. In this case the stop-loss buy order would be placed at 1291.\nThe ﬁrst exit is at the .618 retracement of the AD swing. We shade\nthe exit order, meaning we place orders just above or below the actual\nexit, just as we do the entry orders, about .50 to 1 point away to try to\nensure a ﬁll. The exit order would be placed at 1279.50, just above the .618\nretracement. Occasionally the market may trade just at but not through the\nprice, and it will be up to the individual trader’s discretion how to handle\nthese situations. We prefer to exit if the price is traded at, even if it means\nslightly less proﬁt. We don’t want a winning trade to turn into a losing trade.\nRisk-Free Trade\nOnce a proﬁt is realized on the ﬁrst part, the stop-loss\norder is then moved to the breakeven point. This accomplishes two very\nimportant things:\n1. Reduces the risk in the trade.\n2. Books a proﬁt.\nAt this point in the trade we have a 6.5-point proﬁt and our stop has\nbeen moved to the breakeven point. Our second proﬁt objective is at the\n.786 retracement level from the A–D swing. We place a limit order to exit\nthe second contract at 1277.25, just above the .786 retracement level. Once\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 72,
      "text": "52\nTRADE WHAT YOU SEE\nFigure 4.13\nThis is a picture-perfect S&P E-mini day trade of the AB=CD sell pat-\ntern. The market turns down almost exactly at the completion of D (15-minute chart).\nthe second proﬁt objective is ﬁlled, we then remove our stop-loss order.\nThe second contract proﬁt nets 8.75 points for a total proﬁt of 15.25 points.\nAlternate Trade Management\nAs mentioned earlier, there are many\nways to manage trades. In this particular example, a trader could choose to\nexit both contracts at the initial .618 proﬁt objective. In this case the trader\nwould have netted +13 points. In terms of 5 points being risked initially for\na total of 10 points of risk, this is perfectly acceptable trade management. If\nthe trade had been stopped out after the ﬁrst proﬁt objective was reached,\nthen the trader would have netted +6.5 points on the trade. We have found\nthat it is best to take proﬁts when available and not worry about what the\nmarket does after you have reached your proﬁt objectives. Always keep in\nmind that you are trading to make proﬁts. In our trading we use both meth-\nods to exit our trades. Which method we use depends on current market\nconditions.\nTrade Setup #2: AB=CD Buy Pattern\nMarket: S&P 500 E-mini\nContracts: 2\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 73,
      "text": "The AB=CD Pattern\n53\nFigure 4.14\nS&P E-mini 15-minute chart showing an AB=CD buy pattern trade\nwhere shading the order just above the actual completion point deﬁnitely helped us\nto get into the trade.\nThe S&P E-mini buy pattern setup shown in Figure 4.14 is a very good\nexample of why we want to shade the orders to try to ensure a ﬁll. This\ntrade has an entry at 1232. Once the order is ﬁlled, an initial 5-point sell\nstop is placed. The ﬁrst objective is easily reached within two time bars.\nOn the chart you can see the long bar up from the entry point; this gives\nan indication that the price will make it to the .618 retracement. Once the\nﬁrst proﬁt objective is reached, the stop is moved to breakeven to protect\nproﬁts and to put us in a risk-free trade. The second proﬁt objective is at\nthe .786 retracement. Once the second proﬁt objective is reached, the stop-\nloss order is canceled and that trade is over. This particular trade would\nhave netted the trader +19 points.\nAlternate Trade Management\nA full exit at the .618 level would have\nbeen a perfectly acceptable way to manage this trade. That would have\ngiven the trader a net proﬁt of 16 points.\nTrade Setup #3: 60-Minute Failed AB=CD\nBuy Pattern\nMarket: Wal-Mart (WMT) Stock\nShares: 200\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 74,
      "text": "54\nTRADE WHAT YOU SEE\nFigure 4.15\nThis AB=CD buy pattern trade (60-minute chart) of Wal-Mart (WMT)\nstock illustrates a very important point: Always use stop-loss orders.\nAn example of a failed AB=CD buy pattern is shown in Figure 4.15. As\nnoted on the chart, there are gaps and a steep CD leg down to the com-\npletion point. Sooner or later traders will ﬁnd themselves in a gap-open\nsituation against their position. Usually the ﬁrst loss is the best loss, and a\ntrader must always use stop-loss orders. This is a lucky exit with the stop\nplacement. Had the position been open with the gap down, then a stop can\nbe placed just below the immediate low of the day to ensure no additional\nloss is incurred and then the trade can be exited on the ﬁrst rally. (Refer to\nFigure 4.15 for stop-loss placement on this trade.) A $2.00 stop-loss would\nhave been used, and the trader would have been stopped out for a loss of\n$400 on 200 shares.\nThe use of stop-loss orders is essential in good trading and money man-\nagement. We never know which trades will win or lose, and controlling the\nrisk allows us to move on to the next trade.\n",
      "candlestick_hits": 5,
      "is_highly_relevant": true
    },
    {
      "page": 75,
      "text": "C H A P T E R 5\nThe Gartley\n“222” Pattern\nT\nhe Gartley “222” pattern is certainly one of the classic retracement\npatterns. It offers the trader early entry with minimum risk into a\npotential longer-term trend reversal. For short-term day traders, the\npattern can be used effectively to buy and sell tests of highs and lows\non an intraday basis. Gartley said to buy or sell the ﬁrst AB=CD pattern\nin a new bear or bull market, and that is what this pattern can achieve\nalong with entries into an already established trend. A major reversal may\nnot always follow with this pattern, but even so the trader can still gain\nproﬁts using good trade management skills (assuming the pattern is not a\nfailure pattern).\nHISTORY OF THE GARTLEY “222” PATTERN\nThe Gartley “222” pattern is named for the page number it is found on\nin H.M. Gartley’s book, Proﬁts in the Stock Market. Since then, multiple\nbooks have been written describing the Gartley “222” pattern and charting\nsoftware that applies it. Ensign Software was the ﬁrst to mathematically\n55\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 77,
      "text": "The Gartley “222” Pattern\n57\nGartley’s Parallel Trend Lines chart (refer back to Figure 4.1). These\ndistinct differences between the simple and complex corrections led to the\nGartley “222” pattern that we know today. This provided a clearer picture\nof what the pattern was all about; realizing the differences of the correc-\ntions led to a breakthrough after many attempts to understand the concept.\nThe next step in the development of this pattern was the addition of\nthe mathematical relationships of sacred geometry (which includes the\nFibonacci summation series). Adding the Fibonacci ratios to this pattern\ngave the pattern recognition swing trader the tools to determine price en-\ntry, exit points, and stop levels for risk control. The ﬁnal step was empir-\nically and statistically testing the validity of these patterns. Gartley had\nemphasized that the pattern was correct approximately 70 percent of the\ntime. Testing weekly, daily, and intraday patterns over the past 40 years\nhas proven that Gartley’s original premise was indeed accurate.\nGARTLEY “222” PATTERN DESCRIPTION\nWhile Gartley described both buy and sell patterns identically, he had dif-\nferent diagrams for each. It was the AB=CD pattern within the Gartley sell\npattern that led to the nickname Gartley “222.” Gartley applied this particu-\nlar pattern to all the market indexes, and he also published it in his weekly\nnewsletter.\nThe difference between Figure 5.1 (Figure 27 in Proﬁts in the Stock\nMarket by H.M. Gartley) and the Gartley “222” pattern that we use today is\nin the combination of two of Gartley’s patterns:\n1. The practical use of trend lines diagram from page 249 of Gartley’s\nbook (Figure 4.1).\n2. Gartley’s retracement pattern coupled with the AB=CD pattern\n(Figure 5.1).\nCombining both of these elements creates a buy pattern and a sell pat-\ntern.\nLarry Pesavento found about 20 years ago that by further adding the ra-\ntios from the Fibonacci summation series, he could develop a solid trading\npattern. Gartley also used ratios of one-third and two-thirds with this pat-\ntern but did not use ratios from the Fibonacci summation series. The main\nFibonacci retracement ratios that we apply to the Gartley pattern include:\n.382 (used with strong trends), .50, .618, and .786. As mentioned in the fol-\nlowing section on pattern structure, the 1.00 can be used for a double top\nor bottom.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 80,
      "text": "60\nTRADE WHAT YOU SEE\nFigure 5.4\nDaily chart of 30-year bonds showing a good example of a downtrend\nand the Gartley sell patterns that formed with the X point being within the trend.\ndetermine where the completion of the XA leg may be. There are certain\ncharacteristics of how this ﬁrst swing embarks that give clues to the length\nand thrust of the XA leg: If there are gaps, wide range bars, and tail closes\nin the direction of the trend, it may be some time before a correction takes\nplace. (Refer back to Figure 4.7.)\nAs this ﬁrst leg accelerates, it will take out old support or resistance\nlevels from past chart data. The only way to visually know that the XA\nleg is complete is by the formation of the second leg, labeled AB. Near the\ncompletion of A, many times a doji bar and/or tweezer bar will form, telling\nus that the momentum may be slowing at this point. A doji bar is a type of\nJapanese candlestick in which the close is at or near the open of the bar;\nit is considered a neutral bar. A tweezer top or bottom is also a Japanese\ncandlestick pattern; it forms when two bars have the same high or low.\n(See Figure 5.5.)\nOnce it has been determined that the XA leg is complete, then the next\nstep is to watch the formation of the AB leg. This leg is the ﬁrst reaction up\nor down from the initial impulse wave from X. The key items to watch in\nthis formation are:\nĹ The Fibonacci retracement ratio to which the market corrects.\nĹ The number of bars that form the leg.\n",
      "candlestick_hits": 6,
      "is_highly_relevant": true
    },
    {
      "page": 81,
      "text": "The Gartley “222” Pattern\n61\nFigure 5.5\nS&P 5-minute chart showing examples of a tweezer top and tweezer\nbottom pattern. The tweezer top pattern and the lower tweezer bottom pattern also\nshow a doji bar or a neutral close marked with an arrow.\nĹ The similarities in slope and thrust. (See Chapter 4, section titled\n“Slope and Time Frames.”)\nFor example, if the AB leg takes a considerable amount of time (more\nthan 8 to 10 bars) to form, then we would assume that the market is heading\nfor a larger correction, potentially to .618, .786, or further.\nAs the price begins to turn down or up from B, it is important to note\nthat the pattern would be invalid if the BC leg exceeded X. (Refer to Figure\n5.3.) It is possible for the completion point of this leg at C to be an exact\ndouble bottom or top of the X point, and that is still a valid pattern. But if\nthe price at C exceeds X, the pattern is then invalid; it would potentially\nbe forming a Butterﬂy Extension pattern. (See Chapter 6 for more on the\nButterﬂy pattern.)\nPSYCHOLOGY OF THE GARTLEY\n“222” PATTERN\nIn Chapter 4 we described the crowd psychology of the AB=CD pattern.\nThe same elements apply to the Gartley “222” pattern. It is formed by fear\n",
      "candlestick_hits": 5,
      "is_highly_relevant": true
    },
    {
      "page": 82,
      "text": "62\nTRADE WHAT YOU SEE\nand greed levels of the market participants. When the Gartley pattern forms\nat a major top, the initial move from the top ﬁnds support at the A point.\n(We use a sell pattern as an example here to describe the crowd psychol-\nogy; refer to Figure 5.4.) Markets rarely go straight up or down without\nany correction. This point in the pattern is formed when enough market\nparticipants view this area as a buying opportunity and the price can rally\nfrom there. This is also true from the C point of the pattern. Since there\nare always buyers and sellers in a market, as the price forms the B and D\npoints, sellers step in, seeing these as areas either to exit the market or to\ninitiate short positions. The D point of the pattern is the moment of truth\nto determine if the buyers or the sellers will be the winners. A price decline\nwill reward the sellers, and price above the X point will deem the pattern a\nfailure.\nIf the pattern is successful, the price can accelerate to the downside\nif it exceeds the A point. At this point many previous support areas are\nbeing broken and all traders or market participants who bought above the\nA point are now at a loss on the positions. It is true to human nature that\na few are quick to get out with minimum losses while many others are\nwaiting for the price to come back up to their entry price—which may or\nmay not occur. As the price continues to decline, more market participants\nwho are experiencing larger losses are forced to liquidate at undesirable\nprice levels. There is usually some type of selling climax that signals the\nbottom, and support is found as new buyers step in.\nTRADING THE GARTLEY “222” PATTERN\nAs mentioned earlier, the Gartley pattern can be found and traded in any\ntime frame. This particular pattern eliminates the need to pick tops and\nbottoms, as it is a retest of the recent high or low. By deﬁnition, it is buying\na higher low or selling a lower high, which is ideal for trading with the\ntrend. The trend is deﬁned by higher highs and higher lows in an uptrend\nand lower highs and lower lows in a downtrend.\nThe following three trade examples using the Gartley “222” pattern\nillustrate entry, exit, and stop placements. Refer to Chapter 13, “Build-\ning a Trading Plan,” to help you develop a personal trading plan for this\npattern.\nWe use two contracts in the futures or commodities trade examples\nand 200 shares of stock to illustrate scaling out in two parts. We also\npresent a couple of examples under the heading “Alternate Trade Man-\nagement” to provide an assortment of options for managing these pattern\nsetups.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 83,
      "text": "The Gartley “222” Pattern\n63\nTrade Setup #1: Gartley “222” Buy Pattern\nMarket: Soybeans\nContracts: 2\nThe entry point in this trade is at the .786 completion at point D. See\nFigure 5.6 for several repetitions of the .786 in this pattern. Notice the sec-\nond AB=CD pattern that forms within the CD leg, marked in parentheses;\nthis gives us an indication of where the pattern may complete.\nA limit order just above the .786 at 586.00 would be used on this trade\nwith an initial stop-loss order of 8 cents or $400 per contract. When trad-\ning the Gartley pattern it is ideal to be able to place a stop just below the\n1.00 (X) level, but this will sometimes be too large for the amount of dol-\nlars risked and a dollar amount will be calculated for the stop-loss order\ninstead. Always look at the amount of risk and where the stop must be\nplaced in any trade. If the trader cannot ﬁnd an acceptable stop level ac-\ncording to the trader’s money management plan, then the trade should be\ndropped and another trade with acceptable risk should be found. We can\nFigure 5.6\nSoybeans daily chart showing a Gartley “222” buy pattern setup that\nhas three repetitions of the .786 ratio. This may give the trader a clue as to the proﬁt\nobjective.\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 84,
      "text": "64\nTRADE WHAT YOU SEE\nalways reenter a trade that is stopped out if the pattern is still intact. These\nare the types of decisions that traders must make continually.\nRisk-Free Trade\nThe ﬁrst exit in this trade at 594.00 will be at a proﬁt\nof 8 cents or $400. The reason for this is if we risked 8 cents and we can\ntake a partial proﬁt at 8 cents, we can then move our stop up to breakeven\nand thereby either reduce the risk in the trade or put ourselves in a risk-free\ntrade.\nThe second exit in this trade is at the .618 at 622.00. This particular\ntrade would have netted +8 cents on the ﬁrst contract and +36 cents on\nthe second contract for a total of +44 cents per contract, which equals\n$2,200.\nAs the price moves in the trader’s favor and in the anticipated direc-\ntion, the trader can trail the stop to lock in proﬁts. There is no exact way\nto do this, and there is no 100 percent method that will work all of the\ntime. If the trader is stopped out on a trailing stop prematurely before the\nprice reaches the ﬁnal proﬁt objective, the trader can reenter the trade on\na retracement type pattern (refer to Chapter 8 for more information on re-\ntracement entries). A trailing stop may be used by implementing a speciﬁc\ndollar amount or a percentage of price, or by using Fibonacci retracement\nlevels. Place the stop above or below key levels or other visual support or\nresistance chart levels.\nIn Figure 5.7 you can see that once the price makes the .382 retrace-\nment from the AD swing of the Gartley buy pattern, a new retracement\nprojection can then be done from the most recent swing low price to the\nhigh or the swing price at the .382 retracement of the AD leg, and a trailing\nstop can be placed below the .786 of that retracement. The assumption is\nthat if the price goes below the .786 on that retracement the pattern may\nbe failing. In this case this would have been the third stop placement for\nthis trade:\n1. Initial stop at 578.00.\n2. Stop moved to breakeven after exit #1.\n3. Trailing stop moved to below the .786 retracement.\nAlternate Trade Management\nIn this example we show you exit-\ning in three parts versus two parts. On longer time frames and with larger\ntargets, using a trading strategy that employs a three-part scaling-out exit\ncan produce more proﬁts. The downside, of course, is that if the trade is\nstopped out at a loss, then additional losses will be incurred. The correct\nmoney management for the trader’s portfolio should always be used and\nnever exceeded to implement this strategy. Another downside to this strat-\negy is that if the third objective is not reached and the price reverses, the\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 85,
      "text": "The Gartley “222” Pattern\n65\nFigure 5.7\nSoybeans daily chart showing an example of using Fibonacci retrace-\nment levels to trail a stop.\ntrader may end up giving back some of the proﬁts if the third contract is\nstopped out below the second proﬁt objective area.\nIn Figure 5.6 we have marked the .786 level as the third and ﬁnal proﬁt\nobjective exit. The trader in this particular trade would most likely have\nbeen able to gain an additional 11 cents per contract or $550.\nTrade Setup #2: Gartley “222” Sell Pattern\nMarket: Google (GOOG) Stock\nShares: 200\nA limit order to sell (refer to Figure 5.8) would be placed just below the\n.786 at $384.25 per share to sell short. Once the order is ﬁlled, immediately\nplace a protective buy stop order above the 1.00 or X level for a risk of\n$5.50 per share at $389.75. The ﬁrst proﬁt objective (exit #1) is equal to the\namount of risk in the trade at $378.75. Once this is ﬁlled, move the stop\ndown to breakeven. Exit #2 is at the .618 at $371.50. We would want to\nshade the exit order to ensure a ﬁll and would place the order at $371.75.\nOnce the second proﬁt objective (exit #2) is reached, the protective buy\nstop order is canceled.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 86,
      "text": "66\nTRADE WHAT YOU SEE\nFigure 5.8\nGoogle (GOOG) 60-minute chart of Gartley “222” sell pattern. The risk\nin this pattern is acceptable to place the stop above the X point; the risk is $5.50 per\nshare, very low risk on a $384 stock.\nBecause of the high price of this stock and larger dollar movement,\nthe trader would certainly want to trail a stop to protect proﬁts after the\nprice moves in the trader’s favor following moving the stop to breakeven.\nIt can be helpful to use a smaller time frame to see the most recent swings\nto trail a stop if using visual chart points or Fibonacci retracement levels\n(see Figure 5.9). In this case, using a 30-minute or 15-minute chart would\nbe sufﬁcient.\nThis trade would have netted +$5.50 per share on the ﬁrst exit and\n+$12.50 per share on the second exit for a total of +$18.00 on the trade.\nAlternate Trade Management\nAn alternate and acceptable way to\nmanage this trade is to take a full exit at the .618 retracement. This would\ngive the trader close to a 3:1 risk/reward trade-off. Why don’t we do that\non each trade? The answer is simple: We have found over time that taking\npartial proﬁts around or close to the amount risked gives us a high win/loss\nratio on trades and quickly reduces the risk in the trade to close to a risk-\nfree trade. Whenever we can put ourselves in the position of a risk-free\ntrade we do so.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 88,
      "text": "68\nTRADE WHAT YOU SEE\nTrade Setup #3: Failed Gartley “222” Pattern\nMarket: S&P 500 E-Mini\nContracts: 2\nIn Figure 5.10, a limit order of 1270.00 to sell short is placed for this\ntrade. A protective buy stop-loss order above the 1.00 (X) point at 1273.50\nis immediately placed upon being ﬁlled. We would have been ﬁlled on this\ntrade before the long bar was complete near the D completion point, which\nis one of the warning signs. This just happens occasionally and is part of\ntrading. The protective buy stop-loss order keeps this loss small and en-\nables us to move on to the next trade.\nAccept the responsibility for the trade regardless of the outcome; this\nis learning to think in probabilities. The Gartley “222” pattern places a pos-\nitive expectation in the trader’s favor. It is the trader’s responsibility to ac-\ncept the risk, use sound money management, and develop good execution\nskills.\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 89,
      "text": "C H A P T E R 6\nThe Butterﬂy\nPattern\nT\nhe Butterﬂy pattern is certainly one of our favorite extension pat-\nterns. This particular setup is one that attempts to trade highs and\nlows at market reversal points. The formations and completions tend\nto occur at major tops and bottoms, and they can also be seen on all time\nframes. It is not uncommon to see more than one Butterﬂy pattern on mul-\ntiple time frames completing at the same price area.\nThe risk/reward proﬁle is very favorable with this pattern. The best\npatterns tend to turn immediately at or near the completion point. It is one\nof the few patterns that can truly ﬁnd tops and bottoms. This pattern is not\n100 percent, though, and stop-loss orders must be used; as you will see in\nthe last trade setup in this chapter, when this one fails it usually fails in a\nbig way.\nHISTORY OF THE BUTTERFLY PATTERN\nIn order to explain the history of the Butterﬂy pattern, we have to intro-\nduce the Australian trader and developer of the Wave Trader Program,\nBryce Gilmore. Bryce has spent a lifetime studying the works of the great\n69\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 90,
      "text": "70\nTRADE WHAT YOU SEE\nmasters—R.N. Elliott, W.D. Gann, and many others. He developed the\nWave Trader Program in 1988; it was the ﬁrst computer program to use\nall the numbers of sacred geometry, including the Fibonacci summation\nseries. This pioneering led to the discovery of the Butterﬂy pattern.\nThe Wave Trader Program calculated each swing and ratio and went\nthrough a sequence of analyzing that labeled the patterns from 1 to 10, 10\nbeing the level at which 10 swings and ratios came together at the same\ntime and price. This was the level when multiple patterns had completed\nwith the ratios from sacred geometry. Bryce included all the numbers from\nsacred geometry so that no stone was left unturned. As with many patterns,\nwhen the Wave 10 level trades failed it was usually an indication that the\nmarket would continue in the direction of the original trend.\nBryce was a perfectionist in everything he attempted. On one occa-\nsion he had done extensive analysis on the Treasury bond market and\nhad concluded that T-bonds would not exceed 101.00. He sold T-bonds at\n101.00 and used a stop-loss order at 101.02, which is exactly $62.50 per con-\ntract. When Larry suggested that the stop might be a bit too close, Bryce\nshouted, “If those bonds trade above 101.02, everything I’ve researched,\nread, and believe in will be a total loss!” He went on to say that if bonds\nwere to trade above 101.03, he would burn all of his books and materi-\nals and return to race-car driving and playing golf in his home country of\nAustralia. The bonds made a swing high at 101.00 that lasted more than\ntwo months.\nThe Butterﬂy pattern came into existence in 1992 on a trading day\nwhen Larry was sitting with Bryce watching a Wave 10 pattern form. It\nappeared in many different colors, and as two colorful right triangles came\ntogether Larry commented that it looked like a butterﬂy. Bryce replied that\nit was as good a name for the pattern as any, and that is how the name was\ncoined for this pattern. (See Figure 6.1.)\nAlmost two decades and thousands of Butterﬂy patterns later, it can be\nsaid that it is one of the most proﬁtable trading patterns with the proper use\nof stop-loss orders. As you go through this chapter and learn this pattern,\npay special attention to risk.\nBUTTERFLY PATTERN DESCRIPTION\nThe Butterﬂy pattern is best described as an extension pattern. It is also a\nfailed Gartley pattern where the D completion point completes above the\nX. Remember that a Gartley pattern is considered a failed pattern if this\noccurs, but with this failure a Butterﬂy pattern may be forming. (Refer to\nFigure 6.2.) The extension of the AD swing and the CD leg can be thought\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 91,
      "text": "The Butterﬂy Pattern\n71\nFigure 6.1\nLine drawings of the Butterﬂy buy and sell patterns showing two con-\nnecting triangles.\nof as a stretched rubber band. It is at these points that the market becomes\noverbought or oversold and a reversal can occur.\nEven if a full reversal does not take place, the trader can still proﬁt on\nthis pattern by exiting on retracements of the CD leg or the AD swing. You\nwill see an example of this in the “Trading the Butterﬂy Pattern” section\nFigure 6.2\nGoogle (GOOG) 60-minute chart showing a failed Gartley “222” pat-\ntern forming a Butterﬂy pattern.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 92,
      "text": "72\nTRADE WHAT YOU SEE\nof this chapter under “Trade Setup #2.” The pattern is formed by two right\ntriangles coming together at one point. It is this formation that gives the\npattern its appearance as a Butterﬂy. The completion points can be calcu-\nlated by using Fibonacci ratios above 1.00, such as 1.272, 1.618, 2.00, and\n2.618. Beyond 2.618 the pattern is considered negated and the trend most\nlikely will continue. In most cases the maximum risk is at the 1.618 level.\nBecause of the chance that any pattern can be a failed pattern and even\nthe Butterﬂy pattern can fail, we will note again here that this particular\npattern when failed can move very quickly against the trader’s position; if\nthe trader does not have the trading skills or discipline to use stops, it is\nbest to not trade this pattern until both of those elements are part of the\ntrader’s tool kit.\nBUTTERFLY PATTERN STRUCTURE\nThe Butterﬂy pattern should be a very symmetrical pattern in its formation\nand structure. As with the Gartley “222” pattern, the Butterﬂy pattern is\nformed with four legs. The difference is that the last leg (the CD leg) of the\nButterﬂy pattern will extend beyond the X point and will move toward the\n1.272 or 1.618 expansion of XA. (See Figure 6.3 for an example.) The BC leg\nwill also be an extension, but the completion point is generally determined\nby the XA swing.\nThe AB leg of the pattern will usually be at the .618 or the .786 retrace-\nment levels. The pattern also is valid if this retracement is at the .382 or\n.50. This retracement of the AB leg can go further than the .786, as is seen\nin Figure 6.3, but the pattern will be negated if it goes beyond X. One clue\nthat a Butterﬂy pattern may be forming is if the ﬁrst retracement, the AB,\ngoes to the .786 retracement level or further.\nIt is important to know what invalidates this pattern; here are ﬁve items\nthat would negate this pattern:\n1. Absence of an AB=CD within the AD swing. This pattern must contain\nan AB=CD.\n2. An extension move beyond the 2.618 of XA. The 1.618 expansion is\ngenerally the maximum risk.\n3. B point above (for a sell pattern) or below the X point (for a buy pat-\ntern).\n4. C above or below the A point.\n5. Failure of D to extend beyond X: D must extend beyond X to be a But-\nterﬂy pattern.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 94,
      "text": "74\nTRADE WHAT YOU SEE\nsections. That information also pertains to the AB=CD within the Butterﬂy\npattern.\nHere are three points that are important characteristics of the Butterﬂy\npattern:\n1. Thrust. How the move from the C point starts is important to watch\nas it will give the trader information on whether the pattern may form\na Butterﬂy pattern rather than a Gartley pattern—that is, long bars or\ngaps through the .618 or .786. Gaps should be watched closely by the\ntrader. They indicate an unknown or a change in sentiment and poten-\ntially signal changing market conditions. The thrust coming out of the\nCD leg strongly suggest that the extension has a higher probability of\nmaking a 1.618 new high versus a 1.272 new high.\n2. Symmetry. Study the symmetry of the AB=CD; note the slope and an-\ngle of the AB leg and then the CD leg. If the CD leg is exhibiting a\nsteeper angle, that may be a clue that the CD leg will extend beyond\nX and form a Butterﬂy pattern. The symmetry or slope of the AB leg\nshould be very close to that of the CD leg in order to keep the ideal\nsymmetry in the pattern. Note also the time bar relationship in these\nlegs; for instance, if the AB leg has taken eight bars to form, then the\nCD leg should also take approximately eight bars to form, thus forming\nan ideal Butterﬂy pattern.\n3. Failure signs. Beware of price beyond the 1.618 expansion of XA.\nGenerally a move beyond the 1.618 will indicate a continuation of the\ntrend. If the technician will keep focused on these characteristics, it\nwill greatly reduce the potential for getting into trouble with the But-\nterﬂy pattern. Butterﬂy trades are not for the faint of heart, as they en-\nter counter to the trend in markets when they appear the most bullish\nand the most bearish.\nPSYCHOLOGY OF THE BUTTERFLY PATTERN\nWe have discussed previously in Chapter 4, “The AB=CD Pattern,” and\nChapter 5, “The Gartley ‘222’ Pattern,” how these patterns are formed by\nbasic fear and greed. When there are more buyers, the price rises; when\nthere are more sellers, the price declines. Since the Butterﬂy pattern is an\nextension pattern, is found for the most part at major tops and bottoms,\nand often signals a major reversal point, then we can apply basic mass\ncrowd psychology and witness it at extremes. When this pattern is a ma-\njor reversal turning point in a market, what you will witness is a market\nturn and masses heading for the door at the same time. It is an extreme in\nmarket emotions of fear and greed.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 95,
      "text": "The Butterﬂy Pattern\n75\nAt the tops, market participants start heading for the door trying to\nsell. There is fear of losing money on wrong or early short positions, fear\nof losing proﬁts, proﬁt taking on longs, or initiating new short positions.\nAt the bottoms, market participants start buying perceived bargain prices;\nothers are still heading for the door selling out losing long positions (this\nhas been called the puke point, the point at which traders or investors can\nnot hang on to a losing position one more cent); still others are taking prof-\nits on short positions. At this point, any new shorts will be forced to cover\nlosses as prices rise against them, adding more momentum. This point is\nan extreme of fear of losing or missing out.\nAt these major turning points, one might notice an unusual amount of\npress coverage on television and in magazines and newspapers, as well as\ntalk at social gatherings and even randomly on the street or in other public\nplaces. All of this coverage or talk will be either very bullish at the top with\nthe Butterﬂy sell pattern or very bearish at the bottom with the Butterﬂy\nbuy pattern. The news at this point will be so overwhelmingly skewed in the\ndirection of the trend that it would be difﬁcult to ﬁnd anyone who would\nadmit to taking the other side of the public viewpoint and opinions. Anyone\nusing long-term moving averages would be nowhere near a decision on\ntaking a countertrend position as the Butterﬂy pattern nears completion.\nTraders should remember that very few traders ever buy the exact high\nor low of a stock or market and that the Butterﬂy pattern turns as the last\nbull buys at the top or the last bear sells at the bottom.\nTRADING THE BUTTERFLY PATTERN\nThe Butterﬂy pattern can provide instant gratiﬁcation when the market\nturns quickly at or near the completion point. However, it can also be one\nof the fastest loss trades, because the trader is attempting to pick a high or\nlow spot in the market, and if it fails and the trend continues, the trade is\nusually stopped out quickly. We have stressed several times the necessity\nof using protective stop-loss orders, and it is especially important with this\npattern; this is not a pattern that traders would ever want to let go against\nthem beyond their trading plan and money management plan.\nWe give three trade examples here and several variations on managing\nthe trades with this pattern.\nTrade Setup #1: Butterﬂy Buy Pattern\nMarket: Pﬁzer (PFE) Stock\nShares: 200\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 96,
      "text": "76\nTRADE WHAT YOU SEE\n(See “Alternate Trade Management” for using a three-part scale-out\nwith the Butterﬂy pattern.)\nThis Butterﬂy buy pattern completes at the 1.272 and has a strong re-\nversal from this point (see Figure 6.4). It is important to note that the gaps\nand wide range bars are to the advantage of the trader going long on the\ncompletion of this Butterﬂy pattern. This should be a signal that higher\nprices are likely to come.\nThe entry point into this trade is at 20.30, with a stop placed below the\nestimated 1.618 range of XA at 19.50. The stop-loss placement would be at\n19.10 for a risk of $1.20 per share or $240 on 200 shares.\nWhen trading any pattern, the risk in the trade must always be accept-\nable. If it is not, the trader must pass on the trade and ﬁnd a setup that\nis acceptable in terms of risk. When trading the Butterﬂy pattern, it is im-\nportant to calculate where the 1.618 level is below the 1.272 and to deter-\nmine whether placing the protective stop-loss order just above or below\nthis level will be an acceptable risk. If it is, then this is the logical place to\nput the stop-loss order. If it is not, then the trader must make a decision to\neither pass on the trade or possibly enter at or near the 1.618 completion if\nthe price gets there.\nFigure 6.4\nPﬁzer (PFE) daily chart showing a Butterﬂy buy pattern completing\nalmost to the penny at the 1.272 retracement level. The gaps and wide range bars\nin this case work to the trader’s advantage and should be a signal that higher prices\nare coming.\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 97,
      "text": "The Butterﬂy Pattern\n77\nAnother alternative is to use a dollar amount or percentage of capital\nfor the stop-loss with the knowledge that there may be another entry point\nat or near that level and to be ready to reenter the trade if stopped out. Still\nanother alternative is to wait for a retracement entry or Gartley pattern to\nenter the trade. Refer to Chapter 8 on retracement entries and Chapter 5\non the Gartley “222” pattern.\nRisk-Free Trade\nThe ﬁrst exit on this trade is at the .618 level of the AD\nswing at 21.70. (See Figure 6.5.) This initial risk in the trade was $1.20 per\nshare, and this exit reduces the risk to just above breakeven. After taking\nthe ﬁrst exit, the stop-loss order is moved up to breakeven. The stop can\nbe trailed using either a dollar amount, percent of proﬁt the trader feels is\nthe maximum amount to give back, or visual chart points such as the most\nrecent lows or gap areas. The method the trader chooses to trail the stop\nshould be known before entering the trade and should be part of the trade\nplan.\nThe second exit in this trade is at the 1.272 extension of the AD swing at\n23.25. Sometimes in trading you get lucky, and in this case the market gaps\nup on the open, exceeding the second target, and would be ﬁlled around\nthe opening price at 25.15. This trade would have netted +$625 with an\nFigure 6.5\nPﬁzer (PFE) daily chart showing Butterﬂy pattern proﬁt target exits\nusing the .618 retracement level and 1.272 extension.\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 98,
      "text": "78\nTRADE WHAT YOU SEE\ninitial risk of $240. Figure 6.5 shows the retracement levels from the AD\nswing and the ﬁrst and second exits.\nAlternate Trade Management\nThe Butterﬂy pattern can be managed\nseveral ways. The trader’s overall market knowledge and experience trad-\ning this pattern will determine what method can be used, or traders can\ndevelop their own trade management style for this or any other pattern.\nWe know that when the Butterﬂy pattern is in full force on a reversal it\ncan be a very powerful move. Because of that, the trader may want to con-\nsider devising a trading plan to use a three-part scale-out rather than two\nwhen trading the Butterﬂy pattern. Figure 6.6 shows a retracement from\nthe most recent swing high on the daily chart. An alternate trade manage-\nment would allow for a ﬁrst exit at an amount equal to the amount risked\non the trade, in this case $1.20. The entry is $20.30 and the ﬁrst exit would\nbe planned at $21.50 with the initial stop-loss order moved to breakeven\nat that exit. The initial stop remains the same; it does not change with a\nthree-part scale-out. Traders do, however, need to determine whether their\nmoney management allows for trading an additional one-third shares. If it\ndoes not, then they could divide the number of shares they would trade\ninto three or could stay with a two-part exit plan.\nFigure 6.6\nPﬁzer (PFE) daily chart showing alternate trade management using a\nthree-part exit rather than two.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 99,
      "text": "The Butterﬂy Pattern\n79\nThe second proﬁt target using the larger retracement could be taken\nat the .382. In this example that would be at approximately $23.65, but re-\nmember that on this trade the market gapped open higher and the trader\nwould have had a gift from the market with a higher ﬁll at $25.25 on the\nsecond exit. Whenever the market offers you a gift—take it!\nThe stop would then be trailed according to the trader’s trading plan,\nand the third and ﬁnal exit would be taken at the .618 retracement of the\nswing. (See Figure 6.6.) You can see from studying the charts of this trade\nthat there are many combinations that can be used. It is best to start with\na simple plan based on your skill level and stick with it. As you gain more\nexperience you can adjust your trade management techniques.\nTrade Setup #2: Butterﬂy Sell Pattern\nMarket: Crude Oil\nContracts: 2\nThis trade offers a lot for learning the Butterﬂy pattern and different\nscenarios that a trader faces daily that require decisions. Take some time\nto study Figure 6.7 and ﬁnd all the characteristics within the chart that are\nnoted here:\nĹ There are two Butterﬂy patterns that formed back to back.\nĹ Butterﬂy pattern #1 retraced to the .382 of AD of the larger pattern and\nthen continued to new highs. Remember that a .382 retracement can\nindicate the trend is still intact.\nĹ There is a gap toward the completion point of Butterﬂy pattern #1.\nĹ The similarities of the AB and the CD leg in Butterﬂy pattern #1 are\nremarkable.\nĹ Butterﬂy pattern #2 was formed with a double bottom at the a and c\npoints.\nĹ There is a Gartley “222” pattern following the completion of Butterﬂy\npattern #2. The Gartley “222” pattern is a retest and retracement entry\ninto a stock or market. Refer back to Chapter 5 on the Gartley “222”\npattern and see Chapter 8 on retracement entries.\nĹ The news at the completion point of both Butterﬂy patterns was ex-\ntremely bullish.\nThe completion point of Butterﬂy pattern #1 was approximately $74.40,\nwith a shaded entry at $74.35; an initial stop-loss order of $1.00 to $1.50\nwould be used in a market such as crude oil, which is $1,000 to $1,500 per\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 100,
      "text": "80\nTRADE WHAT YOU SEE\nFigure 6.7\nStudy this crude oil daily chart of two Butterﬂy sell patterns—there is\na lot to be learned from it. There is a gap toward the completion point at D of the\nﬁrst pattern, and the similarities of the AB and CD leg are remarkable. The second\nButterﬂy pattern completes at the swing high. There is a Gartley “222” sell pattern\nfollowing the last high.\ncontract. One of three likely scenarios could have occurred with this setup.\nThe outcome would have been dependent on the size of the stop-loss order\nused, the decisions the trader would have had to make, and the original\ntrade plan:\n1. The trader, if using a $1.00 stop, would have been stopped out at the\nhigh of the swing at $75.35 for a loss of $1,000.\n2. If a wider stop had been used, $1,500, the trader would have been able\nto exit the ﬁrst portion of the trade at an equal risk to the initial stop-\nloss at $72.85, and would have moved the stop to breakeven and been\nstopped out on the second half of the trade. This would have netted\n+1,500.00 on a Butterﬂy pattern that continued in the direction of the\nuptrend.\n3. Had the trader with a wider stop had the patience to keep the initial\nstop-loss order in place and exited at the .382 retracement, this strategy\nwould have netted approximately $6.00 per contract or $6,000.\nThis trade setup is an excellent example of trade management vari-\nances. The best thing to do is to have a well-written trading plan and then\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 101,
      "text": "The Butterﬂy Pattern\n81\ntrade that plan. There will be times when you have outcomes from each of\nthe three scenarios.\nRegardless of the outcome of the ﬁrst Butterﬂy pattern, a second But-\nterﬂy pattern formed, offering another short entry into this market. (See\nFigure 6.8.) The entry point of Butterﬂy pattern #2 was at $77.50 with an\ninitial stop-loss order placed at $78.50 for an initial risk of $1,000 per con-\ntract.\nThe ﬁrst exit in this setup would be at the .382 retracement of CD;\nremember, this is a double bottom Butterﬂy pattern, so it makes no differ-\nence in this case if the retracement is done from AD or CD, at around 74.50.\nThe market at this point has the earmarks of being at a potential reversal\npoint and therefore has the potential to be a larger win with a relative small\nrisk per contract. The stop-loss order is moved to breakeven upon comple-\ntion of the ﬁrst proﬁt target. The second proﬁt target will be at the .618\nretracement of CD around 72.05. If the trade is being exited in three parts,\nthe trader would then trail the stop for a potential larger proﬁt exit on the\nthird contract.\nThe net on two contracts would be $8.45 or $8,450, with an initial risk\nof $1,000. You can see why it is important for the trader to stay with the\ntrade and trade all the Butterﬂy patterns that form. We have no way of\nknowing which ones will work.\nFigure 6.8\nCrude oil daily chart of Butterﬂy sell pattern #2.\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 102,
      "text": "82\nTRADE WHAT YOU SEE\nTrade Setup #3: Failed Butterﬂy Pattern\nMarket: Euro Futures\nContracts: 2\nThis trade in the euro market was a failed pattern and trade. Look\nclosely at Figure 6.9 and note the AB=CD patterns that formed within the\nAD leg. We have marked in three of them but there are actually four in to-\ntal; the chart would be too difﬁcult to read with the last one marked in. You\ncan see how one pattern ends and another begins.\nThe entry would be 1.2495 with a $500 stop-loss per contract, which is\n$12.50 per tick (pip) and is placed at 1.2545. Placing the stop just beyond\nthe 1.618 would mean far too much risk for this trade. The bar following the\nentry is a wide range bar, and this trade would be stopped out in minutes.\nWhen Butterﬂy patterns fail, they generally do so quickly, because when\nthey fail it indicates the trend is still intact and the momentum is still in\nthat direction. A second loss would have been incurred had another trade\nbeen entered at the 1.618.\nFigure 6.9\nEuro daily chart of failed Butterﬂy sell pattern.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 103,
      "text": "The Butterﬂy Pattern\n83\nThe high of that swing is at approximately 1.3000, which in terms of\nloss would equate to around 5 full points or $6,250 per contract.\nWe have been advocating the use of protective stop-loss orders with all\nof the patterns presented in this book, and especially one as powerful as\nthe Butterﬂy pattern. It is powerful both in potential gains and in potential\nlosses. Learn to protect your working capital so that you can come back\nand trade another day.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 108,
      "text": "88\nTRADE WHAT YOU SEE\nThe retracements at points A and C, which form the AB=CD, should\nbe a Fibonacci retracement, ideally at the .618 or the .786. If a retracement\nat the .382 is formed, it is again a sign of a strong trend. These drives should\nappear symmetrical to the eye and jump out. If the trader has to force the\npattern, it is probably not a Three Drives pattern.\nThere should also be time symmetry from point A to drive 2 and from\npoint C to drive 3, in that it should take each of these legs approximately\nthe same number of time bars to form.\nFive items to watch for that would invalidate this pattern are:\n1. Drive 1 above or below drive 2 (above in a sell pattern or below in a\nbuy pattern).\n2. Drive 2 above or below drive 3 (above in a sell pattern or below in a\nbuy pattern).\n3. C below A (for a sell pattern) or above A (for a buy pattern). B should\nnot be above D (for a sell pattern) or below D (for a buy pattern).\n4. Extensions that extend past the 1.618 as the Three Drives pattern is\nforming will usually result in a failed pattern.\n5. Large price gaps that appear as this pattern is forming in the direction\nof the established trend, especially toward the completion of drive 3,\nare a sign that the pattern is not valid and the trader should wait for\nfurther conﬁrmation of a top or bottom or the formation of another\npattern.\nIMPORTANT CHARACTERISTICS OF THE\nTHREE DRIVES PATTERN\nThe Three Drives pattern is similar to the Butterﬂy pattern in that it is very\nsymmetrical. There are three areas of symmetry to study and learn to iden-\ntify and trade this pattern successfully.\n1. Price symmetry. Symmetry of price should be equal in the formation\nof the legs from A to drive 2 and from C to drive 3.\n2. Time symmetry. The Three Drives pattern will have near-perfect sym-\nmetry where the upswings or downswings consist of close to the same\nnumber of time bars. If the time bars are not exactly the same, they\nshould be close to a Fibonacci ratio that can be calculated by dividing\nthe number of time bars in each leg—for example, ﬁve time bars in the\nAB and eight time bars in the CD (5 ÷ 8 = .625).\n3. Visual symmetry. The pattern should be aesthetically pleasing to the\neye. Three Drives patterns that are asymmetrical or that are forced\nshould be viewed with suspicion. By force, we are referring to the\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 110,
      "text": "90\nTRADE WHAT YOU SEE\nattention to the chart in trade setup #3 and notice how a failed pattern that\nis not labeled is much more difﬁcult to spot on a chart.\nSetup #1: Three Drives Buy Pattern\nMarket: QQQQ Daily\nShares: 200\nThe completion point on the Three Drives buy pattern shown in\nFigure 7.3 is at the 1.618 level. This was determined by the previous 1.618\nfrom drive 1 to drive 2, which is repeated from drive 2 to drive 3. Although\nthe time bars are not the same number, they are close to a Fibonacci ratio\nwith 6 bars in the ﬁrst leg down of the pattern and 10 bars down in the\nsecond leg (6 ÷ 10 = .60).\nThe risk in this trade is very small because of the completion point at\nthe 1.618. The entry is at 62.25, and a stop can be placed at $2.00 per share\nat 60.25, just below the recent low.\nRisk-Free Trade\nThe ﬁrst proﬁt target is equal to the risk at 64.25, and\nthe stop can be moved up to just below the most recent swing low at 60.40.\nFigure 7.3\nNASDAQ-100 (QQQQ) daily chart of trade setup #1 is an example of\na Three Drives buy pattern being a correction in a downtrend rather than a reversal\npattern.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 111,
      "text": "The Three Drives Pattern\n91\nThe assumption is that with the stop just below the most recent low, the\nmarket would be telling us that this pattern is a failed pattern at that point.\nThe stop would be trailed on this trade. The trader must keep in mind\nthat this is a daily chart and allow for the market to move up and down,\ngiving it enough room and not trailing the stop too closely. In this case\nthe market does reach the second price objective at the .618. This particu-\nlar Three Drives pattern turns out to be only a correction, and the market\nturns down from the .618 and makes new lows. Although this trade is a cor-\nrection in a downtrend and not a reversal, it achieves a very good proﬁt. It\nwould have netted +$14.75 with very low risk.\nTrade Setup #2: Three Drives Sell Pattern\nMarket: S&P E-mini Daily\nContracts: 3\nIn this trade example we use a three-part exit that we have used in\nprevious trades. It is always up to the trader according to his trade plan\nand money management plan how many shares or contracts are traded in\nany given trade. The nature of this particular setup would be conducive to\na three-part exit for a couple of reasons:\n1. When the extension patterns are reversal patterns, larger gains can be\ncaptured by using extension exits. (See Figure 7.4.)\n2. There are multiple patterns forming: two Butterﬂy sell patterns, mul-\ntiple AB=CD patterns, and a Three Drives pattern. The trader never\nknows if there will be a market reversal, but with so many patterns\nand ratios coming into one completion area it may well be worth the\nrisk for a three-part exit. Refer to Figure 7.5 to see the multiple patterns\nthat form in this chart.\nThe entry on this sell pattern is at the 1.272 retracement level. Figure\n7.4 shows both drives 2 and 3 completing at the 1.272. You can see the\nnatural trend line the market forms with these ratios. Notice also in Figure\n7.4 where the .618 retracement level is as the pattern is forming. This will\nbe an important level for the market to break, as it also forms a trend line,\nand this will signal the trader to try to capture larger gains.\nThe entry is at 1330.50 with a 5-point stop at 1335.50. Placing the stop\nabove the 1.618 in this trade involves too much risk. If the trade is stopped\nout, then the trader can look for another entry at or around the 1.618 level.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 112,
      "text": "92\nTRADE WHAT YOU SEE\nFigure 7.4\nS&P E-mini daily chart. The Three Drives sell pattern turns out to be a\nmarket reversal, and by using a three-part exit strategy the trader is able to capture\nlarger gains. The break of the .618 trend line is a signal to the trader to determine a\nthird proﬁt objective at the 1.272 extension.\nRisk-Free Trade\nThe ﬁrst proﬁt objective is at 1325.50, which would\nbe equal to the initial risk of 5 points in the trade. (See Figure 7.4.) This\ntrade is on a daily chart, and the ﬁrst proﬁt objective is reached three days\nafter entry. A day trader would exit each day and ﬁnd a new entry until\nthe market either reached the ﬁrst proﬁt objective or continued higher,\nexceeding the stop area.\nThe initial stop-loss at 1335.50 is moved to one tick above the swing\nhigh at 1331.50 once the ﬁrst exit is reached. The second proﬁt objective is\nat the .618 retracement at 1302.25. Once this objective is reached the stop\ncan be trailed to protect proﬁts. Figure 7.4 shows a long, wide range bar at\nthe second proﬁt objective. The trader at this point wants to monitor the\nmarket for further downside and to determine the best level for the third\nexit.\nThe trend line at the .618 retracements that formed the pattern, once\nbroken, gives the trader a proﬁt objective at the 1.272 extension from the\npoint marked X to the top of drive 3. This proﬁt objective is around 1248.25,\nand the trader should shade the exit to ensure a ﬁll.\nThis trade on the daily chart would have netted +114.75 points. It cer-\ntainly is a rare home run trade, and the trader would need to have the\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 113,
      "text": "The Three Drives Pattern\n93\nFigure 7.5\nMultiple patterns are forming and completing around the top in this\nS&P E-mini daily chart. There are two Butterﬂy patterns, multiple AB=CD patterns,\nand a Three Drives sell pattern.\npatience to let large proﬁts accumulate and reach the price targets and\nbe willing to hold the position overnight, as this particular trade took 13\ntrading days to reach the third proﬁt objective and exit.\nWe will revisit this particular pattern again in Chapter 8 on retracement\npatterns.\nTrade Setup #3: Three Drives Failed Sell Pattern\nMarket: Gold Futures\nContracts: 2\nThis trade setup (shown in Figure 7.6) is stopped out for a $5.00 loss\nper contract for a total loss of $1,000. Failed patterns are always more difﬁ-\ncult to see, even in hindsight, when you are studying patterns, because they\nare obscured somewhat by the price movement.\nFigure 7.7 shows the same chart with no price pattern drawn in. You\ncan see how difﬁcult it is to ﬁnd the Three Drives pattern in this chart. The\nprice of gold moves up over $125 per ounce after the failed Three Drives\nentry; you must always honor your stop-loss orders.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 114,
      "text": "94\nTRADE WHAT YOU SEE\nFigure 7.6\nGold futures daily chart of Three Drives failed sell pattern. We have\nsaid this before, and it is worth repeating looking at this chart: Always honor your\nstop-loss orders.\nFigure 7.7\nGold futures daily chart without Three Drives failed sell pattern drawn\nin. It is always more diﬃcult to see failed patterns when studying charts.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 115,
      "text": "C H A P T E R 8\nRetracement\nEntries and\nMultiple Time\nFrames\nR\netracement entries serve several purposes. For example, they can\nbe used if the initial entry point was missed, or they can be used for\nreentering a trade in the direction of the trend or for adding onto\na position.\nIn this chapter we cover two types of retracement entry patterns that\nwe use in our pattern recognition study:\n1. Fibonacci Retracement patterns.\n2. Opening Price Retracement patterns.\nWe have already covered the Gartley “222” pattern in Chapter 5; please\nreview that chapter for using the Gartley “222” pattern as a retracement\nentry setup. Trend-type retracement entries will be covered in Chapter 10\non trend identiﬁcation for the S&P 500 market. Retracement patterns are\nnothing new to the present-day technical analyst, and studying them will\nadd another valuable tool to the trader’s market knowledge.\nAt the end of this chapter we cover the use of multiple time frames,\nwhich is a necessary tool for each trader using technical analysis to study\nand learn.\n95\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 116,
      "text": "96\nTRADE WHAT YOU SEE\nFIBONACCI RETRACEMENT ENTRIES\nWe have covered the AB=CD, Gartley “222,” Butterﬂy, and Three Drives\npatterns up to this point; all of them are structured with Fibonacci ratios.\nFibonacci ratios can be applied and used for retracement entries into a\ntrade as well. The most common Fibonacci retracement ratios used for re-\ntracement entries are .382, .50, .618, and .786. These same Fibonacci ratios\ncan also be used for proﬁt objectives and placing stops, as we show in our\ntrade examples in this chapter.\nFibonacci retracement entries differ in one main characteristic from\nthe Gartley pattern in that they do not contain an AB=CD pattern. See Fig-\nure 8.1 for diagrams of .618 retracement buy and sell patterns.\nFIBONACCI RETRACEMENT PATTERN\nSTRUCTURE\nThere are only two legs that form a Fibonacci Retracement pattern, as\nshown in Figure 8.1. The ﬁrst leg is labeled XA, and the second leg is la-\nbeled AB. X is the beginning of the pattern, and B is the completion point.\nThe X generally begins at the high or low of the most recent swing on that\ntime frame, but as with the Gartley pattern a swing in an already estab-\nlished trend may be used. See Figure 8.2 for an example of a long, wide\nrange bar warning sign.\nFigure 8.1\nExamples of Fibonacci Retracement buy and sell patterns. An AB=CD\nis not present in a Fibonacci Retracement pattern.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 117,
      "text": "Retracement Entries and Multiple Time Frames\n97\nFigure 8.2\nS&P E-mini 5-minute chart. In this example, the pattern on the right\nside has a warning sign in the long, wide range bar.\nA retracement-type pattern gives the trader an advantage of not having\nto try to pick a top or a bottom—it is an entry into a trade in the direction\nof the trend.\nAs a rule of thumb for analyzing a Fibonacci retracement pattern that\ndoes not contain an AB=CD, the number of bars in the two legs that form\nthe pattern can be used for analysis. Usually, either the trader will see\nan equal number of bars, such as six bars up, then six bars down (see\nFigure 8.3 for an example), or the pattern may form as a Fibonacci ra-\ntio of the number of bars in the two legs. For example, if the ﬁrst leg of\nthe pattern consists of eight bars, then the trader would want to see the\nsecond leg form with eight bars or form as a Fibonacci ratio of that num-\nber, such as ﬁve bars. This would create the .382, .618, or .786 retracement\nin time.\nWhen these time ratios come together with the price ratios, it is what\nW.D. Gann referred to as the squaring of price and time, which is nothing\nmore than the description of the geometric triangle. Do not get too caught\nup in exact bar counts; there may be a perfectly acceptable pattern that is\nvery close to the description but not exact. (See Figure 8.4.) You want to\nuse bar counts as a guideline, not an absolute. A trader would want to be\naware of and alert to seeing something along the lines of the XA forming\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 118,
      "text": "98\nTRADE WHAT YOU SEE\nFigure 8.3\nThis 5-minute chart of Research in Motion Limited (RIMM) shows a\nretracement pattern that forms with six bars up and then six bars down. The com-\npletion point is at the .618 retracement.\nwith 10 bars and then the AB completing with only 2 or 3 bars. This would\nbe a warning sign that there may a stronger shift in emotion that is causing\nthe pattern to complete rapidly, and the trader would then want to wait for\neither another pattern to form or some type of conﬁrmation before entering\nthat trade.\nThe warning signs are the same as previously described in Chapters 4\nthrough 7. Please review those chapters for warning signs that would either\ninvalidate the pattern or alert the trader to wait for further conﬁrmation.\nSee the “Warning Signs and Conﬁrmation Signs” section of Chapter 11 for\nmore detailed information.\nTRADING THE FIBONACCI RETRACEMENT\nPATTERN\nIn this section we look at three trade examples using a Fibonacci retrace-\nment entry. The ﬁrst trade example is a Fibonacci Retracement sell pattern,\nand the second is a buy pattern. These are followed by a failed buy setup.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 119,
      "text": "Retracement Entries and Multiple Time Frames\n99\nFigure 8.4\nGold futures daily chart showing a Fibonacci Retracement pattern with\na close, but not exact, time count.\nTrade Setup #1: Retracement Sell Pattern\nMarket: INTC\nShares: 200\nIn the trade shown in Figure 8.5, there is a long, wide range bar just\nbefore the .618 entry level. This would alert the trader to wait for the .786\nor a conﬁrmation that momentum has slowed. Using the .786 as an entry\ninto this trade, the trader has an excellent risk/reward setup. With the entry\nat $27.45 and a protective buy stop-loss order placed just above the X point\nat $28.90, the trade has a total risk of $290 using 200 shares.\nRisk-Free Trade\nThe ﬁrst exit is at the amount equal to the stop-loss\norder, which is $1.45 per share. The market reaches the ﬁrst proﬁt objective\nwithin four days. The stop-loss order is then moved down to the breakeven\npoint after exit #1.\nThe market has a large gap-down open through the .618 retracement\nfrom AB and offers the trader an exit at the 1.00 level around $22.55.\nThere is an old saying in the markets: “When the markets offer you a gift—\ntake it.”\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 120,
      "text": "100\nTRADE WHAT YOU SEE\nFigure 8.5\nThis Intel Corporation (INTC) daily chart retracement sell setup is an\nespecially nice trade, with the market helping the trader out with a large gap-down\nopen to the second proﬁt objective.\nAlternate Trade Management\nWe have discussed in previous trade\nexamples alternate trade management suggestions. As an alternative in this\ncase, the trader could at this point, depending on one’s risk proﬁle and mar-\nket experience, choose to trail a stop in an attempt to gain larger proﬁts.\nIf the trader had an order sitting in the market to exit the second part of\nthe trade at the .618 retracement level, he would have been ﬁlled on the\ngapdown open around the opening price that day.\nAnother consideration and possible alternate form of trade manage-\nment with these types of conditions is to move the stop-loss order a small\namount above the high of the day about 20 to 30 minutes after the open\nfollowing a large gap such as this. Using this type of trade management\nwould still allow the trader to exit the second portion of the trade with a\nnice proﬁt if the stock moved up and rallied following the gap-down open,\nbut if the stock then declined further following the gap-down open it would\noffer the trader an opportunity for larger gains.\nTrade Setup #2: Retracement Buy Pattern\nMarket: QQQQ\nShares: 200\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 121,
      "text": "Retracement Entries and Multiple Time Frames\n101\nThis is an almost picture-perfect setup and trade; if only they could\nall be just like this! The risk in this trade is very low, placing the stop just\nbelow the X point. The entry is at the .618 retracement level at $38.55 with\nthe stop-loss order placed at $37.90 for a total risk of 65 cents a share or\n$130 for the 200 shares in the trade.\nIf you study Figure 8.6, you will notice the long bars when the mar-\nket turns up. This will help us determine a second proﬁt objective. This\nis also an alert to the trader that the market may make new highs from\nthis retracement pattern in the direction of the trend, which you can see\nis up.\nRisk-Free Trade\nExit #1 is at $39.45 (the order would be shaded down\njust a few cents from point A). The stop-loss order can then be moved up\nto breakeven. The market easily breaks to new highs after the ﬁrst proﬁt\nobjective is met. We now have a risk-free trade and can let the market move\nup to the second proﬁt objective. In this case, because of the early signs of\nupward momentum that we saw in the long bars, we will use the D point\nof the AB=CD pattern that can be seen forming in Figure 8.6. Exit #2 at\nthis point is at $40.30. This is certainly a proﬁtable trade on a pattern that\noffered a good entry with low risk.\nFigure 8.6\nNASDAQ-100 (QQQQ) daily chart retracement buy setup—a picture-\nperfect retracement trade.\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 122,
      "text": "102\nTRADE WHAT YOU SEE\nAlternate Trade Management\nTraders’ knowledge and market skill\nat reading market momentum will have an effect on how they manage\ntrades. In the case of this trade, a skilled and experienced trader may well\nread the signs of market momentum to the upside and trail a stop up on a\nportion of the trade to try to capture larger gains if offered. As traders gain\nmore experience, their trading skills and ability will improve with time and\nthey will recognize particular instances in the market when it may be pru-\ndent to hold for larger gains.\nTrade Setup #3: Retracement Buy Failed Pattern\nMarket: S&P E-mini\nContracts: 2\nThe entry in this retracement pattern (see Figure 8.7) is at the .618 level\nat the price of 1355.50, with the stop-loss order placed just above the X at\n1358.25 for a total risk of 2.75 points per contract or $137.50. After the ini-\ntial entry, the market starts to turn down toward the ﬁrst price objective\nbut only reaches 1354.50 before turning up and stopping the trade out at a\nFigure 8.7\nS&P E-mini 5-minute chart showing failed retracement buy pattern\nsetup.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 123,
      "text": "Retracement Entries and Multiple Time Frames\n103\nloss. After the trade is stopped out, the market then turns down and comes\nback close to the initial entry point. There is no way for the trader to an-\nticipate this, and the best way to manage trades for loss control is always\nthrough the use of stop-loss orders. These types of occurrences are a part\nof trading.\nOPENING PRICE RETRACEMENT SETUPS\nThe Opening Price Retracement patterns can be used either for day trading\nstocks or for originating or adding onto positions using a longer time frame.\nWe use the opening price setups for stocks only and do not use them in\nother markets. The concept is simple; the opening price will be near the\nhigh or low of the day more than 60 percent of the time—that is, within\nthe upper or lower 20 percent range of that day, according to The Opening\nPrice Principle by Larry Pesavento and Peggy MacKay.\nThe best way to appreciate this setup is to study charts and to note the\nopening price and where the closing price is in relation to it in a given time\nframe. The opening price seems to act like a magnet; why this occurs is\nnot fully known. One theory is that traders and investors have had 16 to 18\nhours since the previous close to contemplate the next day’s orders, and\nthose orders are placed near the open of the next day.\nWhen using the Opening Price Retracement setup, it is important to\nuse only the current day’s opening price and to not use the previous day’s\nopening or closing prices; they are irrelevant. This method is a simple con-\ncept for day traders, and the risk is easily quantiﬁed, as we have seen in\nour previous retracement trade setups. Simply stated, if the price is above\nthe opening price, the probability of a winning long trade is above 60 per-\ncent; conversely, if the price is below the opening price, the probability of\na winning short trade is above 60 percent.\nMARKET SETUP FOR THE OPENING PRICE\nRETRACEMENT TRADE\nTo use the Opening Price Retracement setup, the trader wants to look for\nspeciﬁc criteria before initiating a trade. These criteria include:\nĹ A price above or below the opening price of a speciﬁc stock 30 to 60\nminutes after the open.\nĹ A retracement of .618 or .786 above or below the opening price.\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 124,
      "text": "104\nTRADE WHAT YOU SEE\nĹ A setup absent of warning signs. (See Chapter 11.)\nĹ An acceptable stop placement and risk level.\nAs an example of a long trade using the Opening Price Retracement, a\ntrader would look for a stock that is trading above its opening price 30 to\n60 minutes after the open that day and would then look for a .618 or .786\nretracement level from the low price off the open to the current high of\nthe day for an entry point. The trader must be able to place an acceptable\nstop-loss in order to accept the trade. (Refer to Figure 8.8.) The entry at\nthe .618 or .786 retracement level positions the trader in the direction of\nthe opening price with the trade, and the odds for a successful trade are in\nthe trader’s favor. The opposite would be true for a short trade; the trader\nwould initiate the trade by selling a .618 or .786 retracement from the high\nof the day off the open and the current low and would then be positioned\nin the market in the direction of the opening price.\nA 5-, 15-, 30-, or even 60-minute time frame could be used—whatever\nthe trader is comfortable with. We will use a 5-minute chart for our trade\nexamples with this setup.\nFigure 8.8\nCentex Corporation (CTX) 5-minute chart showing long Opening Price\nRetracement trade setup. Note the long, wide range bar oﬀthe open. This makes an\nideal setup.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 125,
      "text": "Retracement Entries and Multiple Time Frames\n105\nTRADING THE OPENING PRICE\nRETRACEMENT SETUP\nTrade Setup #1: Opening Price Retracement\nBuy Setup\nStock: CTX\nShares: 200\nThe long entry on this opening price setup is at the .618 retracement\nlevel at $48.25. The stop-loss order is placed just below the low of the day\nat $47.70 for a total risk of 55 cents per share or $110. In Figure 8.8 illustrat-\ning this trade, you can see a long, wide range bar off the open. This is an\nespecially ideal setup; the long, wide range bar is suggesting momentum to\nthe upside, and the retracement entry should offer support at the .618 with\nvery low risk in the trade.\nRisk-Free Trade\nThe ﬁrst proﬁt objective is the ﬁrst .618 retracement\nfrom the high of the ﬁrst swing to the low of the ﬁrst retracement. In this\nexample, exit #1 is at $48.65 and the stop-loss order is then moved up to the\nbreakeven point. The trader can, if he chooses, move the stop to just below\nthe ﬁrst swing low of the entry retracement. It should be noted that this\ntrade is a day trade method, and the trader does not want to be in a position\nto give back proﬁts if at all possible. Moving the stop to breakeven will put\nthe trader in a risk-free position with the potential to gain further proﬁts.\nYou will have to study Figure 8.8 and observe how the trade is managed.\nWhen day trading, it is important to obtain a risk-free trade as soon as the\nmarket offers it and take proﬁts when available. The best way to do this\nis by outlining a detailed trading plan and getting into the habit of pulling\nyour stop-loss down as soon as the ﬁrst proﬁt objective is reached.\nSee Figure 8.9 for the formation of a Butterﬂy sell pattern that would\nhelp the trader determine the second proﬁt objective. It is also an option, if\nallowed in the trader’s risk management and money management plan, to\nexit in three stages if one feels that is the best way to manage the trade.\nExit #2 is at the 1.27 extension and completion area of the Butterﬂy sell\npattern at $49.20.\nTrade Setup #2: Opening Price Retracement\nSell Setup\nStock: GS\nShares: 200\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 126,
      "text": "106\nTRADE WHAT YOU SEE\nFigure 8.9\nCentex Corporation (CTX) 5-minute chart showing Butterﬂy sell pat-\ntern that can help the trader determine the second exit.\nThis trade example was chosen to illustrate the importance of trade\nmanagement and to show that not every Opening Price Retracement trade\nwill be a large winner. This example will also serve as our alternate trade\nmanagement example.\nAs in our ﬁrst opening price example, there are long, wide range bars\noff the open. The market continues down and then comes back and makes\na .618 retracement, offering an entry short into the trade. The entry into\nthis trade is at the .618 retracement at $148.90. The initial stop-loss order is\nplaced just above the high of the day at $149.75 for a total risk on the trade\nof 85 cents per share or $170.\nIn Figure 8.10, the price retraces after the entry down to the .382 and\n.50 retracement levels. It is quite feasible for a day trader to take partial ex-\nits at either of these levels and then move the stop-loss order to breakeven.\nIn this particular example a small proﬁt would have been obtained before\nbeing stopped out on the balance. There is no way to determine in advance\nwhich of the retracement levels the market may turn from, and it is up to\nthe trader to determine the risk in the trade and the proﬁt objectives. It is\nalways good to keep in mind that the day trader is trading for short-term\nproﬁts and to take those when they are available.\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 127,
      "text": "Retracement Entries and Multiple Time Frames\n107\nFigure 8.10\nGoldman Sachs Group (GS) 5-minute chart showing an Opening\nPrice Retracement sell setup that oﬀers a small proﬁt before the trade is stopped\nout.\nA partial exit at the .382 retracement in this example would have netted\na 45-cent proﬁt on a trade that otherwise would have been stopped out for\na loss.\nTrade Setup #3: Failed Opening Price\nRetracement Sell Setup\nStock: AA\nShares: 200\nThis setup has a gap-down open and long, wide range bar, suggesting\nfurther downside to come. But as stocks and markets often do, they have a\ndifferent idea. The entry is at the .618 at $27.35 with the stop-loss at $27.60\nfor a total risk of 25 cents per share or $50 on 200 shares.\nThe trade is stopped out at a loss. Notice on the chart in Figure 8.11\nhow the market after the entry into the trade consolidates sideways rather\nthan moving toward a retracement level; the trader can move the stop\ncloser if he determines that the market is not doing what it is supposed\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 128,
      "text": "108\nTRADE WHAT YOU SEE\nFigure 8.11\nAlcoa (AA) 5-minute chart example of a failed Opening Price Retrace-\nment sell setup.\nto do within a reasonable amount of time. There is no way for the trader\nto anticipate this, so it is best to always manage trades for loss control\nthrough the use of stop-loss orders. These types of occurrences are a part\nof trading.\nMULTIPLE TIME FRAMES\nIn this section we discuss using multiple time frames and present several\nchart examples to illustrate how they can be used. The information that a\ntrader can gather by using multiple time frames is invaluable and can be\nused to initiate entries into trades, stay on the sidelines when appropriate,\nand even help in placing stop-loss orders.\nOther advantages of using multiple time frames that we cover include:\nĹ Allowing the trader to get a micro view of larger time frames, which\ncan in turn conﬁrm the trader’s original analysis of a trade. It is like\nusing a backup pattern and ﬁne-tuning an entry. An example would be\nhaving a pattern on a 60-minute chart and using a 5-minute chart to\nconﬁrm the entry. (See Figures 8.12 through 8.14 an examples.)\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 131,
      "text": "Retracement Entries and Multiple Time Frames\n111\nto turn the trade into a position trade. Position trades should be entered\nfrom a position trading plan, and day trades should be entered from a day\ntrading plan.\nManaging Risk Using Multiple Time Frame\nExamples and Fibonacci Retracement Setups\nUsing Fibonacci Retracement setups with multiple time frames is a natu-\nral combination. Many times a trader will come across a pattern that has\nalready completed on a larger time frame and observe that the trade has\nalready moved in the anticipated direction; the trader now needs to ﬁnd an\nentry into the trade. Using a Fibonacci retracement level and then scaling\ndown to a smaller time frame is an excellent method for entering a trade\nin that manner. See Figure 8.12 for a 60-minute Butterﬂy pattern that forms\nand is completed on Google stock.\nLooking at Figure 8.12, the 1.272 extension of the Butterﬂy does not\nhold, and the pattern is completed at the 1.618. Let’s take a look now at a\n5-minute chart showing the 1.272 price level around $427.50 per share. If\nthe trader had entered there using a lower time frame, he would have been\nable to manage the risk in the trade with the use of a stop-loss order and\nthen reenter the trade at the 1.618 again using a 5-minute chart. Refer to\nFigure 8.13 to study the 1.272 price level.\nThe ﬁrst thing to notice on this micro view of the 60-minute pattern\nis that there is a gap-up open and a long, wide range bar. These are both\nwarning signs to alert the trader to either pass on the trade or wait for an-\nother acceptable entry. The market during the day on the 5-minute chart\npresents an opportunity for entry by forming a 5-minute Gartley sell pat-\ntern. This offers a very low-risk entry into a very high-priced stock. The\nrisk in this trade using this small 5-minute pattern and placing the stop just\nabove the high of the day is around $2.00 per share.\nA partial proﬁt could be taken on the retracement of the 5-minute Gart-\nley pattern and the stop kept at the initial location if the trade is being held\novernight. This trade would have been stopped out if held until the next\nmorning and would have been a breakeven or very small loss trade.\nIf the trader then wants to initiate another entry at the 1.618 com-\npletion level of the 60-minute Butterﬂy pattern, the 5-minute chart can be\nused to aid the trader. See Figure 8.14 for a micro view of the entry using\nthe 1.618.\nMany times in trading you have to initiate multiple attempts into a trade\nin order to achieve a larger gain. It is very important to learn techniques\nto manage the risk when reentering trades in this manner. In Figure 8.14,\nGOOG gaps up on the open and has a long, wide range bar. This time the\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 132,
      "text": "112\nTRADE WHAT YOU SEE\nprice reverses and trades below the opening price. Once the price forms the\n5-minute Gartley sell pattern and Opening Price Retracement sell pattern,\nit offers an excellent entry into the trade with very little risk. The risk in\nthis trade with the stop-loss placed just above the high of the day is just\naround $3.00 per share.\nThe trader can then reduce the risk in the trade and/or put oneself into\na risk-free trade by taking partial proﬁts at the .618 retracement level equal\nto or close to the amount of risk in the trade. If day trading, then the trader\nwould close the trade at the end of the day. If the trader is position trading\nbased on the longer-term 60-minute chart, a stop-loss order would be kept\nworking and the trader would then use larger proﬁt targets based on the\n60-minute chart retracements and trail a stop to protect proﬁts.\nMultiple Pattern Completions in Multiple\nTime Frames\nNow let’s look at an example of multiple patterns in multiple time frames\ncompleting around the same price area. Refer to Figure 8.15 and the Gartley\n“222” sell pattern on the daily time frame. We’ll look at Figure 8.16 next for\na closer view and another sell pattern that forms and is completed on a\n15-minute chart in the same price area.\nFigure 8.15\nDaily chart of the euro shows a Gartley “222” sell pattern.\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 133,
      "text": "Retracement Entries and Multiple Time Frames\n113\nFigure 8.16\nThis chart of the euro shows a 15-minute Gartley “222” sell pattern\nthat completes within a couple of ticks (pips) of the daily Gartley “222” sell pattern\nin Figure 8.15.\nThe high of point D on the daily Gartley “222” sell pattern is at 1.2891\nand the 15-minute D completion point is at 1.2888—within a few ticks\n(pips) of the larger time frame. When there is a congestion area of support\nor resistance price levels that are formed by multiple patterns, the trader\ncan use that information for entering trades, placing stop-loss orders and\nproﬁt-taking objectives.\nOpposing Patterns on Multiple Time Frames\nOur last example in this chapter shows you an example of a daily chart of\ncorn (Figure 8.17) and a 30-minute chart of corn (Figure 8.18) that can be\nused to alert the trader to opposing price patterns.\nThe corn daily chart (Figure 8.17) shows a larger Butterﬂy pattern and\nAB=CD pattern with a completion point at D. Notice the circled area on\nthis chart. If you look closely, you will see that after the completion of the\nbuy pattern a sell Gartley “222” pattern forms and shortly after that pattern\nanother Gartley “222” buy pattern. Figure 8.18 shows a detail of these two\npatterns that are clearly visible on the 30-minute chart.\nThe information offered by these two conﬂicting patterns can be used\nin several ways:\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 135,
      "text": "Retracement Entries and Multiple Time Frames\n115\nĹ Assuming the trader, after entering the large Butterﬂy/AB=CD buy pat-\ntern, has already taken partial proﬁts and is anticipating a larger move\nbased on the larger time frame pattern, the trader could manage the\nrisk in the trade by observing whether the AB=CD sell pattern makes\nnew lows; if it does, the Butterﬂy buy pattern would be considered a\nfailed pattern. A stop-loss order at the low of the completion of the\ndaily Butterﬂy pattern could be maintained at that level, and the trader\nwould be stopped out with a small proﬁt on the trade. Once the trader\nsees that the Gartley “222” sell pattern failed by making highs above the\nX point of that pattern, the trader can then move the stop-loss order up\nto protect proﬁts. Since the trader is working with a larger time frame\nsuch as the daily chart in this example, it is important to not move a\nstop-loss order too close and to give the market enough room to move\naround, as well as to use the chart points that would suggest a failure\nof the pattern.\nĹ Another important point for a trader who chooses to trade the Gartley\n“222” sell pattern in Figure 8.18 to be aware of is that the risk in the\ntrade can be closely managed based on an awareness of a larger time\nframe pattern that has completed and is thus far proﬁtable. A trader in\nthis situation would want to be cognizant of stop-loss protection and\ndiligent in taking proﬁt objectives.\nĹ The Gartley “222” buy pattern that also formed in the 30-minute time\nframe gives a trader who missed the original entry point an excellent\nentry into the trade with a quantiﬁable risk and stop-loss level using\npoint X of the daily Butterﬂy/AB=CD pattern.\nĹ A trader could also use the Gartley “222” buy entry to add onto an ex-\nisting position in the market being traded. Adding onto a position must\nalways be within the trader’s trade plan and money management and\nrisk parameters. This type of trading must also be within the trader’s\nskill and market knowledge level.\nNotice also in Figure 8.18 the gap up areas on the right side of the chart.\nThese are certainly showing a shift of sentiment in this market, and that\ninformation can be used to the advantage of the trader who is long—that\nhigher prices may be ahead and it would be a good idea to hold the position.\nConversely, it would give a trader who was short that market an alert to\ntighten stops or exit the trade.\nWe have covered several areas using and interpreting information\nbased on multiple time frames. The trader should always be aware of the\nlarger time frames and the overall market conditions of any market or stock\none is trading and learn to combine time frames to improve one’s trading\nskills.\n",
      "candlestick_hits": 5,
      "is_highly_relevant": true
    },
    {
      "page": 137,
      "text": "C H A P T E R 9\nClassical\nTechnical\nAnalysis\nPatterns\nS\nince the beginnings of technical analysis, classical technical patterns\nhave been repeating over and over in all time frames and in all mar-\nkets. It’s interesting that these patterns have not changed in cen-\nturies. They are truly a reﬂection of crowd psychology. We present three\nof these classical technical analysis patterns in this chapter and show you\nhow Fibonacci ratios can be applied. Many times you will see the structures\nof the patterns form with exact Fibonacci ratios. Adding the Fibonacci ra-\ntios to these patterns will give the trader an additional tool for timing en-\ntries and controlling risk.\nWe present the Double Top and Double Bottom pattern, the Head and\nShoulders pattern, and the Broadening Top and Broadening Bottom pat-\ntern. These three patterns were ﬁrst publicized in R.W. Schabacker’s book,\nStock Market Theory and Practice (B.C. Forbes, 1930). We will take a look\nat these patterns both from a structural sense of how they are formed and\nfrom a trading perspective with ideas for entering the trades, placing stops,\nand taking advantage of areas to reverse a position. Some of the best trad-\ning opportunities can come from failed patterns, and it certainly is true\nwith these patterns when they fail.\n117\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 138,
      "text": "118\nTRADE WHAT YOU SEE\nA BRIEF HISTORY OF TECHNICAL ANALYSIS\nThe history of technical analysis using charts to monitor price dates back\nat least 1,000 years and was ﬁrst documented by the Japanese. They used\nrice as a gauge to determine supply and demand. In the late 1800s into the\nearly 1900s an evolutionary process occurred and launched a technical rev-\nolution of sorts by great technical analysts such as Jesse Livermore, H.M.\nGartley, W.D. Gann, Richard Wyckoff, Richard Schabacker, Ralph Elliott,\nCharles Dow, George Cole, and a host of others too numerous to mention\nwho devoted their time and lives to the art, science, and skill of technical\nanalysis. An extraordinary note is that much of their work was done by\nhand. Computers were not available to compute moving averages and in-\nstantly call up charts of various time frames with multitudes of indicators\nand ﬁlters applied. These pioneers hand drew their charts meticulously,\ncarefully noting market observations that were then tested and applied as\ntheories and trading strategies. These technicians were great market ob-\nservers, and today many of the great traders still do some chart work by\nhand on a daily basis as part of a daily ritual. There were services avail-\nable that furnished daily or weekly charts of around 50 select individual\nstocks for a fee, but it certainly was a long way from the real-time data we\nenjoy today.\nThrough the Depression years and even World War II, there was very\nlittle printed material available regarding technical analysis. The ﬁrst ﬁnan-\ncial news printed in newspapers, long before the Wall Street Journal, had\nbegun about 10 years after the Civil War. As communications advanced and\nimproved, so did the ease of gaining ﬁnancial information through ticker\ntape, teletype, and telephone. Some of us can remember using the ticker\ntapes through the Chicago Board of Trade and the Chicago Mercantile Ex-\nchange during the late 1960s and early 1970s.\nAs the Internet and home computers became accessible, the communi-\ncations industry as related to ﬁnancial information and technical analysis\nprograms exploded. Real-time data and charting software packages loaded\nwith every indicator and testing capability imaginable are now available to\nboth the novice technician and the professional alike.\nFor many years technical analysis was looked at by the ﬁnancial com-\nmunity as a form of voodoo and not worthy of consideration for seriously\nmaking money. Books such as Jack Schwager’s Market Wizards have dis-\npelled these myths with interviews from some of the greatest traders of\nour time, like Marty Schwartz, who embrace technical analysis as the core\nof their trading strategies. In his interview with Schwartz, Schwager asks\nabout his transition from a fundamental to a technical analyst. Schwartz’s\nreply clearly indicates that it was not until he went to technical analysis\nafter using fundamentals for nine years that he became rich.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 139,
      "text": "Classical Technical Analysis Patterns\n119\nAs we mentioned at the beginning of this chapter, only recently has\nthe academic world given its blessing (through its research) to the validity\nof technical analysis and the repetition of particular patterns that make it\npossible for traders to proﬁt.\nBASICS OF TECHNICAL ANALYSIS\nEverything in technical analysis starts with a single bar chart. This bar\nchart is plotted on an x-axis and y-axis showing time and price. The price\nbar represents the total sum of all buyers and sellers for that bar in that\ntime frame. The individual price bars give a great deal of information:\nĹ The high price of the bar.\nĹ The low price of the bar.\nĹ The opening price of the bar.\nĹ The closing price of the bar.\nĹ The time frame of the bar.\nVolume is also involved in the formation of the bar. The reason a bar\nforms is irrelevant; what is important is how multiple bars form in rela-\ntion to one another over a period of time to create particular patterns\nthat repeat. It is important that the technical analyst learn to read these\nbars as patterns and act appropriately when a pattern forms that offers a\ntrading opportunity.\nDOUBLE BOTTOM AND TOP PATTERNS\nR.W. Schabacker stated that the Double Bottom pattern was an important\nchart formation. This pattern can be found at major bear market bottoms\nand is a reversal pattern and an accumulation phase. The Double Top pat-\ntern is just the opposite; it is a reversal pattern and a distribution phase and\ncan be found at major tops. The pattern may also form as an intermediate\npattern in a longer trend that is established.\nDouble Top and Bottom patterns are seen with a fair amount of\nregularity on price charts in all time frames. They are sometimes referred\nto as W bottoms because of the apparent shape forming the letter W. It is\nprobably one of the most common patterns that novice technical analysts\nbecome aware of. As a reversal pattern it can be very powerful. If the\npattern is seen on an index chart, then it is probable that the same pattern\nwill be forming on many stocks that are in that index.\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 141,
      "text": "Classical Technical Analysis Patterns\n121\nAlso notice in Figure 9.1 the number of bars that formed after the ﬁrst\nbottom formed. The retracement up was approximately three bars up, and\nthen the second leg of the double bottom was approximately three bars\ndown. When the time ratios are equal in length, as in this example, the\npattern is generally more signiﬁcant. This concept was ﬁrst described by\nW.D. Gann in the 1920s, and he referred to it as the equal time phenomenon.\nThis is another way of describing symmetry.\nLooking for Trend Clues\nFigure 9.2 offers a closer look at what is happening with the Dow index\nprice than is clearly visible on the weekly chart in Figure 9.1. We will exam-\nine some clues in Figure 9.2 that the astute trader could use to determine\na potential early trend reversal. We can see that the second low just barely\nticked through the ﬁrst low of the Double Bottom pattern before reversing.\nAfter the second low is made, long, wide range bars start to form to the\nupside. These are marked with arrows in Figure 9.2. The ﬁrst retracement\npattern that forms is able to retrace only to the .382 level. This, along with\nthe wide range bars up, is an indication of a trend. We will cover ways to\nidentify trends in Chapter 10 on trend identiﬁcation of the S&P 500 market.\nFigure 9.2\nDaily view of the Double Bottom pattern on the Dow index. On this\nchart you can see that the price on the second bottom just barely ticks through the\nlows below reversing.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 142,
      "text": "122\nTRADE WHAT YOU SEE\nFigure 9.3\nDow index daily chart example of a countertrend trade and managing\nrisk and locking in a proﬁt in a Double Bottom pattern.\nManaging Countertrend Trades in a Trend Environment\nAt times traders will ﬁnd themselves in a trade that is counter to the trend.\nIt is imperative that upon realizing this or suspecting that a trend is devel-\noping against them, traders use trade management to control the risk in\nthe trade and protect any proﬁts. In Figure 9.3 we can see that the price\ndoes indeed turn down from the .618 level and has a move large enough\nto offer the trader proﬁts. The price reaches the .382 retracement, and\nproﬁts should be taken and the stop-loss order moved to breakeven. This\naccomplishes two very important tenets in trading:\n1. Locking in a proﬁt—always remember you are trading to make\nmoney, and not to prove that you are right.\n2. Moving the stop down to breakeven after taking a partial proﬁt re-\nduces the risk in the trade and protects proﬁts and capital.\nThis trade management can be applied to any of the patterns that are\nreversal patterns and the trader is in a countertrend trade.\nFigure 9.4 shows an example of using a Fibonacci ratio to move a\nstop-loss order. The assumption is if the price exceeds the .786 it will\nmove beyond that level to the 1.00 or to an extension ratio such as the\n1.272 or 1.618.\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 143,
      "text": "Classical Technical Analysis Patterns\n123\nFigure 9.4\nDow index daily chart of Double Bottom pattern: managing coun-\ntertrend trade using Fibonacci ratios to move stops and protect proﬁts. The stop-loss\norder can be moved to just above the .786. The assumption is if the price exceeds\nthe .786 level, it will move higher.\nDouble Top Pattern Example\nFigure 9.5 shows an example of a Double Top pattern in the crude oil mar-\nket that leads to a large decline. The second top does not exactly match the\nﬁrst top in price, but there is only a few cents’ difference. Once the market\nturns down from the second top, it accelerates to the downside, as is visi-\nble with the gaps down and the long, wide range bars. A trader recognizing\nthese warning signs would want to look for areas to trade with that trend\nand momentum. A smaller time frame could be used for entries.\nPattern Recognition\nThe Double Top and Bottom patterns should be easy to see and aestheti-\ncally pleasing to the eye. The key to these patterns is the formation of the\nsecond leg of the top or bottom. It is not unusual for the second low on a\nDouble Bottom pattern to be exceeded by a small amount or the second\nhigh on a Double Top pattern to be exceeded by a small amount. The rea-\nson for this is that stops are placed just at or slightly beyond these levels\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 144,
      "text": "124\nTRADE WHAT YOU SEE\nFigure 9.5\nCrude oil daily chart example of a Double Top pattern. The two highs\nare within 20 cents.\nand are taken out just as the market reverses. Refer back to Figure 9.2 for\nan example of the price exceeding the second low. The same principles for\ncontrolling risk and managing trades apply to both the Double Top pattern\nand the Double Bottom pattern.\nFailure Point\nThe technician should always be aware of where the failure points are on\nany technical pattern. This knowledge will help the trader to control risk\nand manage the trade by placing stops at the appropriate price levels. The\nfailure point of the Double Top pattern would be at the high of the pattern.\n(Refer back to Figure 9.5.) If the price reversed back up to those highs, the\ntrader would want to cover any short positions and look for a place to go\nlong. The trader could use a buy-stop order just above the highs to let the\nmarket pull them into the trade. A stop-loss order could be placed based\non a visible chart point or dollar amount.\nThe failure point on the Double Bottom pattern would be if price re-\nversed back down through the lows. The trader could use a buy-stop or-\nder to let the market pull them into the trade and then place a stop-loss\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 145,
      "text": "Classical Technical Analysis Patterns\n125\norder based on a visual chart point or dollar amount. (Refer back to Fig-\nure 9.1.)\nHEAD AND SHOULDERS PATTERN\nThe Head and Shoulders pattern is more complex in its structure than the\nDouble Top and Bottom patterns. There are more swings involved with this\npattern, and it is sometimes not identiﬁed until close to completion.\nA combination of many of the patterns we have already covered in\nprevious chapters of this book—AB=CD, Gartley, Butterﬂy, Three Drives,\nand other extension patterns—may be present in the formation of the\nHead and Shoulders pattern. Schabacker indicated this pattern was one of\nthe seven cardinal patterns, which referred to common chart formations\nthat had forecasting value that were accumulation or distribution reversal\npatterns.\nThe pattern is called Head and Shoulders because when viewing the\npattern on a price chart the structure appears to form two shoulders and a\nhead. See Figure 9.6 for an illustration of the Head and Shoulders pattern.\nFigure 9.6\nHead and Shoulders pattern—basic formation.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 146,
      "text": "126\nTRADE WHAT YOU SEE\nFigure 9.7\nDaily chart of IBM with a Head and Shoulders Top pattern with Fi-\nbonacci ratios applied.\nApplying Fibonacci Ratios to the Head and\nShoulders Top Pattern\nLet’s take a look at a Head and Shoulders Top pattern that has Fibonacci\nratios applied and has several other patterns as part of the structure. Fig-\nure 9.7 is a daily chart of IBM with a completed Head and Shoulders Top\npattern. In this example you can see that the left shoulder also contains a\nButterﬂy pattern and an AB=CD pattern. In the circled area you can see a\nDouble Top pattern. In this case we have several patterns coming into the\nsame price area as a potential top and reversal area.\nThe retracement in the left shoulder from point X to A to B came\nto above the .786 level. This is important to note, because how the right\nshoulder forms in relation to this will give information as to the validity of\nthis pattern and its potential strength or weakness, since the right shoul-\nder is the reaction pattern coming after the high or head has been made.\nThis countertrend rally will usually stop at the .618 or .786 level. When the\nright shoulder has a lower ratio than the left shoulder, it usually signiﬁes\na much more bearish pattern. Time symmetry is also important and places\nan added signiﬁcance on the pattern if it is present.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 147,
      "text": "Classical Technical Analysis Patterns\n127\nTrading the Head and Shoulders Top Pattern\nThere several ways to approach trading this pattern, the ﬁrst being that the\ntrader is already short the market based on an extension pattern, such as\nthe Butterﬂy and AB=CD pattern that can be seen in Figure 9.7, or possi-\nbly from the Double Top pattern that formed. This pattern is very easy to\nsee after the full formation, but, as we indicated earlier, it is a little more\ndifﬁcult to spot sooner, before at least the top or head is complete and the\nﬁrst reaction down from there has taken place.\nWe will assume that if the trader is already positioned short in the mar-\nket based on other patterns near the highs and has taken partial proﬁts,\nthe trader can then begin to look for signs of a right shoulder forming by a\nreaction rally back up, as outlined earlier. A stop-loss order could be kept\nat breakeven or just at the previous highs of the head, because the pattern\nwould be void if the price then exceeded this level. As mentioned previ-\nously, the majority of traders watch for a break of the neckline to enter the\ntrade. Because of this, the trader positioned in this trade earlier would want\nto monitor the price for a break of the neckline for potential further gains.\nThere is always the possibility of any pattern failing, so the trader could\nalso take a second proﬁt as the neckline is being tested or broken and move\nthe stop to just above the last high. Figure 9.8 shows an example of placing\nthe stops and where the break of the neckline is. From that point, if prices\ncontinue further, the trader can then use either a 1.272 extension from the\nAD of the AB=CD pattern for further proﬁts and trail a stop or a Fibonacci\nretracement from a larger swing.\nAnother traditional way to measure a proﬁt objective with this pattern\nis to take the height of the pattern and project it down from the price level\nof the broken neckline. Figure 9.9 shows this example.\nThis pattern can also be entered using the break of the neckline by\nusing a sell-stop order and letting the market pull you into the trade. A\nstop-loss order can be placed using a visual chart point or dollar amount.\nFailure Point\nThe failure point in this pattern is just above the forma-\ntion of the head. Refer back to Figure 9.6. At this point the trader would\nlook to go long by using a buy-stop order. The stop-loss order can be placed\nusing a visual chart point or dollar amount. Failure points and failed pat-\nterns will usually have a strong move in the opposite direction of the origi-\nnal pattern.\nHead and Shoulders Bottom Pattern\nSince we mentioned earlier that these patterns have been present in mar-\nkets for centuries and have not changed, we will take this opportunity to\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 150,
      "text": "130\nTRADE WHAT YOU SEE\nFigure 9.10\nHead and Shoulders Bottom pattern from Stock Market Theory and\nPractice.\nSource: R.W. Schabacker, Stock Market Theory and Practice (B.C. Forbes, 1930).\nBROADENING TOP AND BOTTOM PATTERNS\nSchabacker credits A.W. Wetzel with ﬁrst publicly identifying the Broaden-\ning Top and Bottom patterns. In his book Stock Market Theory and Prac-\ntice, Schabacker refers to this pattern as one of the seven formations that\nindicate preparation for a major movement. This pattern was seen in many\nstocks in the third quarter of 1929 preceding the crash of October and the\nbear market that followed.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 151,
      "text": "Classical Technical Analysis Patterns\n131\nThis pattern is rare, and Schabacker stated that because of this it was\nless important as an indicator than the more common reversal patterns.\nThis does not in any way mean that it is not a powerful pattern when it\ndoes form.\nThis pattern was marketed by J. Welles Wilder 50 or so years later as\nthe Reverse Point Wave system. It was sold at the time for about $2,500 to\nalmost 1,000 traders. It is also covered in H.M. Gartley’s 1935 book, Proﬁts\nin the Stock Market, where it is referred to as the T-6 Broadening Top.\nPattern Structure\nThe structure of this pattern consists of ﬁve reversal points. Each low is\nsuccessively lower and each high successively higher. Figure 9.11 shows a\nBroadening Top formation in the Dow Jones Industrial Average preceding\nthe price highs of 2000 and the bear market that ensued.\nThe Broadening Top and Bottom patterns are really nothing more than\ntriangle and coil patterns, which are classic technical analysis patterns in\nwhich the market comes to a point of indecision before breaking out to\neither the upside or downside. They can also be continuation type patterns\nfound in trends. Refer to Chapter 10, “Learning to Recognize Trend Days.”\nThe apex of the pattern is reversed from a traditional and more commonly\nfound triangle pattern. The apex is on the left side of the pattern rather\nFigure 9.11\nDow Jones Industrial Average weekly chart of a Broadening Top pat-\ntern shows ﬁve reversal points and the apex on the left side. Many stocks in the third\nquarter of 1929 formed this pattern preceding the October crash.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 152,
      "text": "132\nTRADE WHAT YOU SEE\nthan on the right side and expands from there. The pattern is sometimes\nreferred to as an Expanding Triangle pattern.\nYou can see in Figure 9.11 that following the decline after point 5 there\nis a rally that would be considered a sixth reversal point, but the rally does\nnot exceed point 5. The establishment of this lower high indicates the prob-\nability of a reversal.\nAdding Fibonacci Ratios\nWe can deﬁne the waves in most Broadening Top and Bottom patterns by\nthe use of Fibonacci numbers. Each wave in the pattern is interrelated by\nthese numbers. The most common Fibonacci numbers that will be seen\nand used in this pattern are .618, .786, 1.00, 1.272, and 1.618.\nFigure 9.12 shows a portion of the Dow index chart used in Figure 9.11\nwith the addition of Fibonacci ratios to deﬁne the geometric structure.\nThe left side of the pattern from points 1 through 3 forms a 1.272 ex-\ntension pattern. You can also see the formation of a Three Drives pattern,\nwhich completes at point 3 of the Broadening Top pattern. There is also\na small AB=CD that completes at the top of the pattern. Point 3 is higher\nthan point 1.\nPoints 2 through 4 form another 1.272 extension pattern. This pattern\nextends just a bit beyond the 1.272. Point 4 is lower than point 2. One last\nFigure 9.12\nDow index weekly chart of Broadening Top pattern with Fibonacci\nratios added to deﬁne the geometric structure.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 154,
      "text": "134\nTRADE WHAT YOU SEE\nwhen found on the longer-term time frames they can signal a major re-\nversal. This is evident in the example of the Broadening Top pattern of the\nDow index (refer back to Figure 9.12).\nWhen these patterns fail, they can lead to explosive moves in the oppo-\nsite direction (i.e., continuing in the direction of the original trend). When\npoint 5, which should be the completion point of the pattern, explodes with\na wide range bar (usually two to three times the length of an average daily\nbar) or a price gap occurs, a continuation move of major proportions is\nmost likely under way. As always, the trader must quantify the risk and use\nstop-loss protection when trading this pattern.\nTrading the Broadening Top and\nBottom Patterns\nAs is noted and depicted in the example charts of this pattern, it is not un-\nusual to see other patterns form as a Broadening Top or Bottom pattern is\nforming. In Figure 9.12 we can see an AB=CD pattern, a 1.272 extension\npattern, and a Three Drives pattern. When entering a trade into a Broaden-\ning Top or Bottom pattern, the trader can use any of these other patterns\nas entries and any of the stop-loss and proﬁt objective techniques we have\nalready discussed.\nUsing the example in Figure 9.12 of the Broadening Top pattern, a re-\ntracement entry could be used after the initial reaction down and a stop-\nloss order placed above either the .786 or the 1.00 if the risk is acceptable.\nA trailing stop can be used for managing exits on the trade.\nIn the case of the Broadening Bottom in Figure 9.13, the example\nshows there is not much of a retracement; the trader who is waiting for\na 1.272 to enter would miss the initial entry. The trader would probably\nwant to scale down to a smaller time frame for a pattern to enter on and\nplace a stop-loss order. If the pattern is being traded from a longer-term\ntime frame such as a daily or weekly chart, keep in mind that it could be a\nlonger-term reversal signal and you may want to plan exits accordingly.\nIf either pattern has a failure and turns up or down through the failure\npoints, the trader would want to then look for an entry in the direction of\nthat failure.\nAlthough a Broadening Top or Bottom pattern is rarer than others pre-\nsented in this book, it can be one of the most reliable and proﬁtable pat-\nterns and is certainly worth the trader’s time to study.\n",
      "candlestick_hits": 4,
      "is_highly_relevant": true
    },
    {
      "page": 155,
      "text": "C H A P T E R 1 0\nLearning to\nRecognize\nTrend Days\nA\ntrend day can easily become a countertrend trader’s largest loss day\nas a result of repeatedly trying to trade against the trend. A trend day\ncan be deﬁned as a market where price opens on or near its highs\nor lows and then closes at the opposite end of the range. These traders\nmay feel they are doing the right thing by taking the countertrend signals\nor patterns but repeatedly get stopped out. A day like that can erase weeks\nor even months of proﬁts. Not only can it damage the trader ﬁnancially, but\nit can also damage the trader’s mind-set. Conversely, if a trader learns to\nidentify trend days and trade in the direction of the trend, the trader can\nturn that around and trend days can be their best trading days.\nIn this chapter we want to present examples of trend days that occur in\nthe S&P 500 E-mini market. We chose this market for a couple of reasons;\nﬁrst, it is a widely traded market by day traders, and second, the character-\nistics illustrated in this market can also be used with individual stocks or\nother markets. Since the S&P 500 index has a total of 500 stocks, it would\nstand to reason that if the index is trending, a large majority of the stocks in\nthat index will also be trending. The main purpose of including this chapter\nis to help countertrend traders become aware of when a trend is present\nso that they can make well-informed trading decisions that will help them\nto protect capital and learn to trade in the direction of the short-term trend\nin this market.\nThe areas we cover are:\nĹ Identifying a trend day.\nĹ Patterns found on trend days.\nĹ Combining time frames and using Fibonacci ratios on trend days.\n135\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 158,
      "text": "138\nTRADE WHAT YOU SEE\nFigure 10.3\nExample of a short-term 5-minute chart uptrend in the S&P 500 E-\nmini market. The price holds the gap-up open and makes no attempt to ﬁll the gap.\nA long, wide range bar makes highs on the day, a sign of strength and an indication\nthat an uptrend may be in progress.\nexpanding, which gives us trends. There are three market tendencies that\ncan alert the trader to the possibility of a trend day developing.\n1. A narrowing of range, referred to as an NR7, which is deﬁned as the\nnarrowest range in the past seven trading days. This was ﬁrst published\nby Toby Crabel in Day Trading with Short Term Price Patterns and\nOpening Range Breakout (Traders Press, 1990). Linda Raschke also\nhas done extensive research using narrow range trading days as a char-\nacteristic that can precede a trend day.\n2. Gap opening followed by long, wide range bars in the ﬁrst 15 to 30\nminutes of trading.\n3. Neutral market closes, where the market closes in the same area that\nit opened.\nBoth Toby Crabel and Linda Raschke have done excellent statistical\nresearch on these market tendencies that precede trends.\nWhen a trend day does develop, it will be most valid when all indexes—\nS&P 500, Dow Jones Industrial Average, NASDAQ, and Russell—are trend-\ning in the same direction. In an uptrend they would each be making new\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 159,
      "text": "Learning to Recognize Trend Days\n139\nhighs; they would make new lows in a downtrend. As mentioned earlier,\nthe majority of stocks that make up these indexes will be trending in the\nsame direction. If traders see individual stocks that are not participating\nin the trend, they should make a note of those and watch for patterns to\ndevelop to trade those stocks. And if they see stocks that are leading the\ntrend, they can also make a note of those stocks to watch for setups in the\ndirection of the trend.\nPATTERNS FOUND ON TREND DAYS\nOnce traders have identiﬁed that a trend is under way, they will do best\ntrading in the direction of the trend. There are speciﬁc patterns that tend\nto form during these trends. As we have mentioned previously, any retrace-\nments that are pullbacks in a trend will most likely reach only the .382 for\nthe strongest trends, and the .50 for other trends. There may or may not\nbe an AB=CD pattern with these retracements, and the trader may want to\nwatch for consolidation-type patterns to form and use repetitive correction\nsizes to time entries into trades. Most of the corrections or pullbacks that\noccur during a trend day will be shallow. The strongest trends will tend\nto correct between 1.25 and 3.5 points. Generally, any corrections or pull-\nbacks in a trend will not exceed 5.5 points. This helps the trader to place\nstops when trading a trend day.\nWe will focus on these two trend day patterns:\n1. AB=CD correction\n2. Consolidation pattern\nAB=CD Pattern on a Trend Day\nMost intraday trends will see at least one small AB=CD pattern form that\nwill give the trader a low-risk entry into the trend. As mentioned earlier, the\ncorrections tend to be shallow, and many times the small AB=CD patterns\nthat form will retrace to the .382 or to the .50. On a true trend day they will\nusually not retrace to the .618 or the .786 once the trend is under way. In\nFigure 10.4, two AB=CD patterns form during the trading day on a 5-minute\nchart. The ﬁrst AB=CD pattern forms early in the day and before the trend\nis in full progress. This ﬁrst pattern does retrace to the .618. Notice the\nsize of the correction: 4.5 points. The corrections tend to be very similar\nin size on a trend day. On very strong trend days and if the trend accel-\nerates, the corrections will become shallower. Trends are one of the few\ntimes we use the .382 or .50 retracement as an entry into a trade.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 162,
      "text": "142\nTRADE WHAT YOU SEE\nthe second correction of 2.75 points is just shy of the .382 using the\nopen price.\nNotice the third correction up of only 2.0 points; this correction is very\nshallow as price consolidates and is considered a sideways correction.\nOnce again the market is showing us there is strength behind this move\nup and the trend is likely to continue into the close. If you look closely at\nthe fourth correction on the chart, you can see a small AB=CD correction\nthat is only 2.5 points, another very shallow correction in a strong trend up.\nOnce traders see a repetition of corrections in the same range, they can\nuse that to time an entry into a consolidation pattern. These tendencies are\nthe same for trend days down.\nFIBONACCI RATIOS ON TREND DAYS\nGenerally, when a trend on a short time frame such as a 5-minute chart is\nprogressing throughout the trading day, the trader wants to be aware of\nthe higher time frame cycles. The markets are usually traveling to a higher\nor lower level based on a larger time frame. Look at Figure 10.7 and notice\nhow this 60-minute chart with seven bars enclosed within the dotted rect-\nangle shows us a view of the price from the trend day shown in Figure 10.6.\nWe can clearly see how strong the momentum is looking at this 60-minute\nchart. We can see the gap-up open, and we can also see how the price re-\nacted at the Fibonacci retracement levels.\nAt the ﬁrst .382 retracement in Figure 10.7, there is a long, wide range\nbar that easily slices through this level with no resistance. Refer now to\nFigure 10.8, which shows an interesting close-up view of price action us-\ning the retracement from the 60-minute time frame applied to the 5-minute\nchart. We can see that when the price reaches the .382 shortly after the\ngap-up open, it slices right through the .382 price level with no resistance.\nThis move is the ﬁrst long bar seen on the 60-minute chart in Figure 10.7,\nand in Figure 10.8 we are looking at the same long bar broken down into a\n5-minute time frame. The price then goes up to the .50 level and ﬁnds very\nlittle resistance there as well.\nThis information is very valuable because it tells us that the price is in\na trend and is likely to get to at least the larger .618 or the .786 and possibly\nhigher using the 60-minute time frame. It is also important because it tells\nthe countertrend trader to avoid countertrend trades and to trade with the\ntrend. We can also see in Figure 10.8 how, once the price is around the\nFibonacci retracement levels from the 60-minute time frame and applied\nto the 5-minute time frame, the consolidations are a test and retest of the\nlevels once they are broken.\nThe next thing we want to look at is where the consolidation patterns\nthat are outlined in Figure 10.6 are consolidating. Figure 10.9 shows us\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 164,
      "text": "144\nTRADE WHAT YOU SEE\nthese same consolidation patterns but puts them into perspective with the\n60-minute Fibonacci retracement levels. We can see that the price reacts\nin a trendlike manner at the Fibonacci resistance levels. At each level the\nprice forms a consolidation pattern before moving higher.\nIf we look at the .50, .618, and .786 levels, we can see that the price\nconsolidated above each of these levels; this is usually an indication that\nthe price is in a trend and is going to move higher. The .50 level shows the\nsideways consolidation pointed out earlier in Figure 10.6 and how bullish\nthe price is with only a 2.0-point pullback above the resistance area. This\nis why it is so important for the trader to learn to identify a trend and to\ntake appropriate trading actions. It would have been a disastrous day for a\ncountertrend trader to have attempted selling into this strength.\nCONTROLLING RISK ON A TREND DAY\nIf countertrend traders inadvertently ﬁnd themselves in a trend day, they\ncan make a graceful exit by using the consolidation patterns as an exit.\nReferring back to Figure 10.9 as an example, let’s assume a trader sells\nthe market at the .618 retracement level and initiates a 3-point stop, only\nrealizing that a trend day is in progress once in the trade. At this point, to\ncontrol the risk and protect capital, the trader wants to utilize one or more\nof these trade management techniques:\nĹ Ensure a stop-loss order is in place to prevent a small loss from turning\ninto a large loss.\nĹ Use the small pullbacks to exit if possible.\nĹ Put the stop-loss order just above or below the last small swing high or\nlow.\nAgain, refer to Figure 10.9 and the .618 level, and let’s assume the trader\nis short from the 1383.75 level with a three-point stop and the initial objec-\ntive was another .618 retracement down. The trader would have an oppor-\ntunity to exit at least part of position as the small AB=CD pattern forms\nand to pull the stop down to breakeven. This would allow a small proﬁt\neven in a countertrend trade. If the trader either does not exit or enters the\ntrade at the second test up of the .618 and then realizes he is caught in a\ntrend, he can either:\nĹ Exit the trade immediately and reverse.\nĹ Use the next small pullback to exit, realizing it may be very shallow.\nĹ Pull the stop down to the last small high.\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 165,
      "text": "Learning to Recognize Trend Days\n145\nFigure 10.9\n5-minute chart with 60-minute Fibonacci retracement levels applied,\nshowing consolidation patterns that formed at Fibonacci levels during the trend day.\nAgain, in either case a stop-loss order must be in the market to control\nlosses. When traders see prices consolidating on top of Fibonacci levels in\nan uptrend or below in a downtrend, they must realize that the probability\nis in favor of the price continuing in the direction of the trend.\nTRADING A TREND DAY\nWe now look at a few examples of entering trades from our chart examples,\nplacing stop-loss orders and proﬁt objectives. We use the same trend day\ncharts we have been viewing for our ﬁrst trade example. We also look at a\nfailed trend day trade example, because, as we have mentioned, nothing in\ntrading is ever 100 percent.\nTrade Setup: Trend Day Up\nMarket: S&P E-mini\nContracts: 2\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 166,
      "text": "146\nTRADE WHAT YOU SEE\nIdeally, on a trend day the trader would want to hold a core position\nthat is initiated early in the day and try to hold the position into the close.\nThe assumption is that a true trend day will open on or near its lows and\nclose on or near its lows. The trader can then take off contracts and add\nthem back on as the trend day patterns form. This will lock in proﬁts and\nreduce risk in the event that the trend ends prematurely before the close\nof the market, and it will keep the trader in the market for the bulk of the\ntrend.\nIn Figure 10.10 there are ﬁve trend day patterns marked in the chart,\nand we will review those:\n1. Consolidation pattern shortly after gap-up open of 1.75 points.\n2. Consolidation pattern at the .50 resistance area of 2.75 points.\n3. Sideways consolidation pattern above the .50 retracement level. The\ncorrection is 2.0 points.\n4. Small AB=CD pattern with a 2.5-point correction.\n5. Small consolidation pattern of 1.75 points at the .618 level.\nUsing pattern #1, if the trader has enough market knowledge and skill\nto identify an early trend condition off the open, he would have a very early\nFigure 10.10\nFive trend day patterns marked on a 5-minute chart of a trend day\nup. Note the size of the corrections; the market will tend to repeat the correction\nsize.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 167,
      "text": "Learning to Recognize Trend Days\n147\nstart into this trend day. Instead, we assume that the trend is identiﬁed only\nafter pattern #1 because of the conditions mentioned earlier:\nĹ Gap-up open not ﬁlled by price.\nĹ Long, wide range bars.\nĹ Shallow ﬁrst correction.\nThe trader waits for the ﬁrst trend entry pattern to form, which is at\npattern #2. We know the ﬁrst pullback is only 1.75 points, and we want to\nuse an entry between this and a 3-point pullback to enter. If we use a 2- to\n3-point correction and a 3-point initial stop, that will give the market room\nto wiggle around a little and allow the trader to place the stop-loss order\njust around the 5.5-point trend pullback level that we do not want to see\nthe market violate in order for the trend to be valid. There are always going\nto be exceptions to every rule, but we have found this to be a good general\nrule for trend days.\nIf we use 2 points from the high of pattern #2, this gives us an entry\nof 1378.75. Using an initial stop-loss order of 3 points, that will place the\nstop at 1375.75, which is just below the low of the long, wide range bar that\nshould act as support, as seen in Figure 10.11. This gives us an acceptable\nstop-loss placement.\nFigure 10.11\n5-minute chart of trend day up, showing entry into a consolidation\npattern using a 3-point stop-loss placed just below the long, wide range bar, which\nshould act as support.\n",
      "candlestick_hits": 4,
      "is_highly_relevant": true
    },
    {
      "page": 168,
      "text": "148\nTRADE WHAT YOU SEE\nThe ﬁrst proﬁt objective is going to be a test of the last highs at 1378.50.\nOnce this is ﬁlled, the trader wants to move the stop-loss order up to\nbreakeven to lock in a proﬁt and reduce risk in the trade. Remember that\nthe trader wants to try to hold a partial position into the close on a trend\nday, so the next step is to wait for the next pattern and then add on one\nmore contract. The number of contracts is totally dependent on the money\nmanagement plan of the trader. We are using an example of two contracts\nto illustrate how the trade can be managed on a trend day. In this example\nthe trader has a 2-point proﬁt with the stop at breakeven.\nThe next entry forms at pattern #3 with the sideways consolidation\nabove the .50. When the trader sees price consolidating above a Fibonacci\nresistance level (or below on a trend day down), this is a sign of strength,\nand the trader may use that as a low-risk entry. The premise is simple:\nWhat was once resistance is now support. The opposite would be true in a\ndowntrend: What was once support is now resistance.\nWe can use that information to our advantage and enter the second\ntrade in the trend day. We can place an order to go long just above the\n.50 at 1380.50 and place a stop one tick below the last consolidation level\nat 1377.75 for a 2.75 stop. The stop on the ﬁrst position can be main-\ntained at 1378.75. The proﬁt target again is at a retest of the last high at\n1382.25. This would gain 1.75 points, and the stop on the ﬁrst position\ncan be moved to 1380.00, just below the last low. This leaves one open\nposition that the trader is trying to press for further gains on the trend\nday.\nThe third entry comes at the completion of the small AB=CD of pat-\ntern #4. Again, be aware of the pullback sizes that have already occurred.\nWe can determine that the pattern completes around 1381.75, which is a 2-\npoint pullback from the last high. We can place the stop-loss order just be-\nlow the last low, along with the other stop-loss order on the core at 1380.00.\nThe exit is at the retest of the last high at 1383.75 for a gain of 2 points on\nthat contract.\nPattern #5 is the last consolidation pattern shown on this chart, and the\npullback is only 2 points. This most likely would be a tough entry because\nof the shallow pullback, and in real-life trading sometimes you just miss it.\nThe trader, however, would still have the initial core trade on from 1378.75\nand the stop-loss order on that position at 1380.00. Once pattern #5 makes\nnew highs, the stop-loss order on the 1378.75 position can be moved up\nto one tick below the low of that pattern at 1382.50. The trader would then\nwant to look for a spot to exit at or near the close. The closing price is 1384,\nand that would yield 5.25 points on the initial core position. If the trader\nhad been able to enter earlier off the open, the gains would, of course, be\nlarger. Take some time to study Figure 10.11 and the trades presented with\nthat chart.\n",
      "candlestick_hits": 5,
      "is_highly_relevant": true
    },
    {
      "page": 169,
      "text": "Learning to Recognize Trend Days\n149\nTrade Setup: Failed Trend Day Up\nMarket: S&P E-mini\nContracts: 2\nIn the next chart example, Figure 10.12, we look at the importance\nof maintaining the stop-loss levels as the trade progresses and of always\nremembering that any type of pattern can fail. It will serve the trader in\nthe long run to focus on preserving capital by keeping losses small and\nprotecting proﬁts.\nWe have already covered that any correction beyond a 5.5-point cor-\nrection is likely to signal a trend change on the 5-minute chart. We can see\nin Figure 10.12 that the day starts out in a trend day fashion; there are long\nbars and shallow corrections. The important items to note in this chart are:\nĹ After the high and the second 3.25-point correction are made, the mar-\nket then fails to make a new high.\nĹ Remember that on a strong trend day the market will continue to make\nhigher highs and higher lows on an uptrend day and lower highs and\nlower lows on a downtrend day.\nFigure 10.12\n5-minute chart of failed trend day up. Once the market fails to\nmake new highs and turns lower, the trend is over.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 170,
      "text": "150\nTRADE WHAT YOU SEE\nĹ Once the market turns down and makes a new low that is marked\nbreak of support on the chart, that trend is most likely over.\nA trader using good trade management techniques would give back\nvery little proﬁt. The market also gaps down lower on the next open. It is\nwise to listen to what the market is telling us.\nIf you are not familiar with trend days, take some time to observe and\nlearn the characteristics and to become adept at trading them. We suggest\nkeeping a ﬁle of charts of trends and making observational notes of the\nrepetitive characteristics. Once you are comfortable with trend days, you\ncan formulate a trading plan for them that utilizes proper money manage-\nment, entry strategies, and stop-loss placement and proﬁt objectives.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 173,
      "text": "C H A P T E R 1 1\nTrade\nManagement\nL\nearning to manage trades as efﬁciently as possible will have a large\nimpact on the trader’s bottom line over time. This skill usually re-\nquires much practice, time, and patience on the trader’s part. It also\nrequires traders to take an objective look at their trading, trade by trade, to\nrecognize the areas that are going well and the areas that need work.\nThe ﬁrst step in reﬁning trading as a skill is to learn a method of trading\nthat suits the trader’s personality. Understanding trading from a perspec-\ntive of probabilities, meaning that any good method of trading will have\nperiods of proﬁt and periods of loss, will point the trader in the right direc-\ntion for developing and adhering to money management rules.\nIt is impossible to predict in what order wins and losses will occur.\nWhen a period of loss does happen, the trader must continue studying the\nmethod to learn how to trade through those periods. Unfortunately, it is at\nthis point that the vast majority of traders learning the method will abandon\nit and search for a method that does not incur the inevitable drawdown. It\nis learning to manage the risk and losses during periods of drawdown that\nwill eventually make a profound positive impact on the bottom line.\nMoney management combined with developing excellent trade man-\nagement skills will eventually be the heart and soul of each successful\ntrader. We have covered many trade management options as we presented\neach pattern. Take time to study and review these; we encourage you to\nadapt the trade management to your own trading style, time frame, and\nmarket that is suited to your personality.\nIn this chapter we present a straightforward approach to allocating\ncapital to each trade, including ﬁguring the position size for each trade.\n153\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 174,
      "text": "154\nTRADE WHAT YOU SEE\nThere are many good books on money management as it applies to trading,\nand again we encourage you to study this topic in depth so that you have a\nthorough understanding of its importance to your success in trading. One\nbook in particular that stands out as a recommendation for traders of all\nlevels is Trading Risk: Enhanced Proﬁtability through Risk Control by\nKenneth L. Grant.\nWe also cover the warning signs and conﬁrmation signs that have been\ndiscussed in previous chapters. Learning these as an important part of the\noverall trading skills will help the trader manage trades properly by either\nstaying on the sidelines when market conditions warrant, waiting for fur-\nther conﬁrmation to enter a trade, or pressing for additional proﬁts.\nLearning to think in probabilities—understanding that there is a ran-\ndom outcome to each individual trade and that over a period of time the\ntrading method has a positive expectation—is a learning process in itself.\nWe address that ﬁrst so that the reader can begin to think about and under-\nstand this important concept.\nTHINKING IN PROBABILITIES\nMoney management is primarily a function of risk control. It is not possible\nto predict within a series of trades which ones will be winners and which\nones will be losers. Another factor that cannot be predicted with 100 per-\ncent accuracy is the amount of proﬁt that a trade will produce. That leaves\none element of the trading equation that can be controlled—the risk fac-\ntor. It is a natural thinking process of most traders to focus on how much\nmoney can be made on a trade. Unfortunately, one important aspect is of-\nten overlooked: how much can be lost. The trader must learn to focus on\ncontrolling the risk of loss in each trade. This can be accomplished by ap-\nplying sound money management techniques, which include:\nĹ Allocating small percentages of total trading capital to each trade.\nĹ Using stop-loss protection.\nĹ Taking proﬁts when available.\nIt is important to understand that the trader must keep trading—\ncontinue pulling the handle, so to speak, as in playing a casino slot ma-\nchine. We are not suggesting that any trader overtrade; rather, we are sug-\ngesting that when their edge is present they trade it each and every time.\nWe mention casino slot machines here because there is an important\ncorrelation, and that is in the edge. Casinos have an edge, and successful\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 175,
      "text": "Trade Management\n155\ntraders have an edge. Casinos know the percentage edge they maintain\nover the players and play each hand. If you have ever watched a black-\njack dealer at a casino, you probably have never seen (and will never see)\nany dealer pass on a hand or deviate from the house rules. However, on\nthe other side of the table you can observe blackjack players doing the op-\nposite most of the time. Decisions are made based on emotions, and the\nhigher the stakes, the higher the emotions. Usually when players base de-\ncisions on emotions they destroy any edge they may have had. The casino\nhas a positive expectancy of winning over time, and the random gambler a\nnegative expectation of winning over time.\nHow do traders learn to think in probabilities? It’s a process that gain-\ning market experience and skill will teach. Thinking in probabilities is ﬁrst\nintellectualized by the trader. It is then brought into the trading process by\nthe trader correctly executing a series of trades that begin to incorporate\nthe concept into the experience of trading. It then becomes something the\ntrader does without thinking; it becomes an inherent and essential part of\nthe trading process and the trader.\nIn his book Trading in the Zone, Mark Douglas eloquently and thor-\noughly outlines and describes this process and gives excellent exercises to\nlearn to think in probabilities. We have included this classic book in the\nrecommended reading section in the back of this book.\nTraders must set up their trading so that they are trading a plan in a\nrepetitious manner so as to determine if there is an edge present. The plan\nmust be traded over a large sample of trades to be able to analyze this.\nOnce traders can tell statistically that there is an edge present, they can\nthen begin to see that there are winning streaks and losing streaks present.\nThey can then understand how valuable a well-thought-out trading plan\nwith sound money management principles is.\nOne thing that is certain is that if the trader alters the edge of the trad-\ning method by taking random trades that are not part of the trading method,\nor late entries, early exits, and the like, it will be difﬁcult to ever learn\ntrading as being probabilistic. Take the approach to learn the good exe-\ncution skills and trade management skills necessary to let the edge play\nout.\nWARNING SIGNS AND CONFIRMATION SIGNS\nAs mentioned previously, the trader must learn to recognize varying mar-\nket conditions that will either increase or decrease the probability of a\nsuccessful trade. We do this by using speciﬁc warning signs and conﬁr-\nmation signs.\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 177,
      "text": "Trade Management\n157\nConﬁrmation Signs\nNow we look at the daily INTC chart in Figure 11.2 and see how we could\nuse conﬁrmation techniques to enter the trade at a low-risk point. The pri-\nmary conﬁrmation signs we use are:\nĹ Tweezer bottom or top.\nĹ Gap in the direction of the trade.\nĹ Tail closes or long, wide range bars in the direction of the trade.\nĹ Conﬁrmation bar—waiting one time bar before entering the trade.\nLooking at Figure 11.2, on the left side of the chart we can see the\noriginal pattern completion point of D as was outlined in Figure 11.1. The\npattern completion at point D is two full points above where the stock\nactually turned up. Had traders been patient and waited for a slowing of\nmomentum using one of the aforementioned conﬁrmation techniques, they\nwould have been able to locate a low-risk entry point.\nThe tweezer bottoms and the gap-up open are certainly signs of slow-\ning momentum to the downside and potential for the price to turn up. The\nrisk in the trade could be easily quantiﬁed by placing a stop below the\ntweezer bottoms.\nFigure 11.2\nIntel (INTC) daily chart showing conﬁrmation signs for trade entry.\nConﬁrmation techniques allow a low-risk entry point into this trade.\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 178,
      "text": "158\nTRADE WHAT YOU SEE\nThe technique of waiting one time bar on the time frame the trader\nis trading (i.e., daily time frame waits one daily bar, 5-minute time frame\nwaits one 5-minute bar, etc.) can be implemented once the trader has seen\ntweezer bottoms, a gap in the direction of the trade, or long range bars in\nthe direction of the trade. In the example shown in Figure 11.2, the daily\nbar on the day of the gap-up open would have been the entry bar for the\ntrader following the tweezer bottom. This would have allowed the trader\nto place the stop-loss order just below the tweezer bottom and would have\nprovided a low-risk entry point.\nWaiting one time bar can be used when the trader has reason to be-\nlieve, based on price behavior, that price may exceed the completion point\nof a pattern. This is never a guarantee of a proﬁtable trade, but it does give\nthe trader a tool to use in varying market conditions.\nLet’s take a look at an example of a chart that is showing deﬁnite warn-\ning signs up to the completion point. Figure 11.3 shows an AB=CD sell\npattern. There are three gaps up on three consecutive openings to the com-\npletion point at D. This is the market’s way of showing us that there is\nstrength to the upside and that the bulls are in control. The bars increase\nin size with the closing prices at the upper ends of the ranges. This would\ncertainly be a consideration for any trader trying to sell this market short.\nFigure 11.3\nNASDAQ-100 (QQQQ) daily chart of AB=CD sell pattern with warning\nsigns. Three gap-up openings and wide range bars are deﬁnite warning signs for this\nAB=CD pattern.\n",
      "candlestick_hits": 4,
      "is_highly_relevant": true
    },
    {
      "page": 179,
      "text": "Trade Management\n159\nThere is nothing wrong with passing on a setup such as this. A market can\nalways be entered on a retracement pattern or Gartley pattern if necessary.\nAs we can further see in Figure 11.3, the market trends up from this point.\nThere are shallow pullbacks and an acceleration of price to the upside. Had\na trader entered on the AB=CD pattern before realizing the warning signs,\nthe trade could be managed as a countertrend trade in trend conditions as\noutlined in Chapter 10. We do not see tail closes in the CD leg, but the gap-\nup openings and the wide range bars are sufﬁcient to warrant the trader’s\nattention. All warning signs do not have to be present for the trader to make\na trading decision to stand aside or wait for further conﬁrmation.\nMONEY MANAGEMENT\nMoney management is the most important element of a trading plan. It is\na function of risk control and, if utilized properly, will allow traders to\ntrade through periods of drawdowns and losing streaks without blowing\nout their accounts. In order to trade professionally and successfully, you\nmust learn to follow your trading plan, which includes a plan for money\nmanagement. Money management begins with an attitude: Again, traders\nmust learn to think in terms of probabilities and not certainties. This is par-\nticularly true with regard to the patterns we have shown throughout this\nbook, because they have a positive expectation if traded consistently with\nsound trading principles, including money management.\nOne important side note on poor money management: Added to the\nobvious loss of ﬁnancial resources is the emotional stress that is placed\non the trader. This stress can be manifested in the form of depression or\naddictive behaviors such as alcoholism or drug abuse. To prevent these\nvery destructive behaviors from occurring due to lack of proper money\nmanagement, traders can set up a structure in their trading to start with\ngood habits such as always using stop-loss orders.\nIf a real broker is used, an order structure can be implemented so that\neach time a trade is placed a stop-loss order must also be placed or the\nbroker does not place the order. Electronic trading does not allow for this\ntype of structure, so before beginning trading live with real capital it would\nbe best for traders to commit fully to themselves that they will always use\nstop-loss orders and never violate a money management rule.\nUsing a Percentage of Total Trading\nCapital as Risk\nUsing a small percentage of total trading capital on any one trade is an\nexcellent way of preventing blowing out an account. We can use an exam-\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 180,
      "text": "160\nTRADE WHAT YOU SEE\nple of a $100,000 trading account to illustrate this point. If the trader were\nto risk 100 percent of the $100,000 on any one trading idea and lose, he\nwould have brought the account balance to zero in one swift drawdown.\nIf the trader were to risk 50 percent of the account on each of two trades\nand lose both times, he would have brought the account balance to zero in\ntwo trades.\nSince trading is a game of probabilities, we know that there will be win-\nning streaks and losing streaks. We do not, however, know in what order\nthey will play out; then it is only logical to structure the money manage-\nment to allow us to stay in the game long enough to not be blown out of\nthe game by drawdowns that will occur. This is why it is going to be im-\nportant to always commit only a small percentage of capital to any one\ntrading idea.\nWe suggest using a risk in the range of 1 percent to 3 percent of total\ntrading capital on any one trade. This will prevent any catastrophic losses\non any particular trade. In the example of the $100,000 trading account,\nusing a 1 percent risk or $1,000, the trader has to be wrong 100 times in\na row to bring the account balance to zero. Using 3 percent or $3,000, the\ntrader would have to be wrong approximately 33 times in a row to bring\nthe account balance to zero.\nNovice traders should certainly use the 1 percent level, and as they gain\nmore experience they could consider using the 3 percent level. We do not\nbelieve going above the 3 percent risk of your trading capital on any one\ntrade should ever be implemented. The trade setup may look absolutely\nfoolproof and the trader may believe that it cannot fail; but it is only one\ntrade in many and never worth the risk. There is an old saying in trading:\nNever go for broke—you just might get it.\nOne of the great beneﬁts of the patterns presented in this book is they\ncan all be traded with the amount of capital at risk, the stop-loss orders,\nand the proﬁt objectives ﬁgured before the pattern completes. Figure 11.4\nshows a trade example using 3 percent of the total trading capital at risk\nand how to determine the number of shares appropriate for the trade. We\nuse a hypothetical $100,000 trading account. Here are the steps to follow\nto calculate the number of shares for this trade:\n1. 100,000 × 3% = $3,000. This is the total amount of risk for this trade.\n2. The entry point is at $37.50 and the stop-loss will be set at $2.00 per\nshare and placed at $35.50.\n3. We then take the amount of the stop-loss order, $2.00 in this case, and\ndivide it into the total amount of risk, $3,000 in this trade.\n4. $3,000 ÷ $2.00 = 1,500. This gives us the number of shares to trade;\n1,500 shares can be traded in this setup using a 3 percent risk\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 181,
      "text": "Trade Management\n161\nFigure 11.4\nCalculating the correct number of shares for an AB=CD buy pattern\ntrade setup on a Sandisk Corporation (SNDK) daily chart.\nparameter with a $2.00 per share stop-loss order (1,500 shares stopped\nout at $2.00 per share equal $3,000).\nIn this example, the maximum amount the trader can lose is $3,000 or 3\npercent of the trading capital. We never want to risk more than 10 percent\nof a stock’s price using a stop-loss order. As an example, if the stock is\na $50 stock, we would never risk more than $5.00 as a stop-loss order.\nAround 5 percent is usually quite reasonable. We have said this several\ntimes throughout the book and we will repeat it again here: If the risk is too\ngreat in the trade, then pass and ﬁnd another trade setup with suitable risk.\nAs discussed and shown in the previous chapters, the exits can be de-\ntermined using several methods. If we were to use an equal amount of risk\n($2.00 in this example), take the ﬁrst exit at $39.50 per share, and move\nthe stop-loss order to breakeven, this would allow us to take a proﬁt that\nis equal to the original risk in the trade, and moving the stop-loss order to\nbreakeven puts us in a risk-free trade.\nĹ Using 2 percent risk in this trade example, the total amount of capital\nat risk would be $2,000 and the correct number of shares would be\n1,000.\n",
      "candlestick_hits": 5,
      "is_highly_relevant": true
    },
    {
      "page": 182,
      "text": "162\nTRADE WHAT YOU SEE\nĹ Using 1 percent risk in this trade example, the total amount of capital\nat risk would be $1,000 and the correct number of shares would be 500.\nEach trader will have a different tolerance level for risk. It is very im-\nportant to determine ahead of time what your risk tolerance level is.\nThe trader can calculate for each trade how many shares can be traded.\nIf the account balance is down due to losses, the trader must recalculate\ndownward the percentage of risk being used. If the account balance has\nincreased, the trader can recalculate upward the percentage of risk being\nused. This ensures that when there is a losing streak the trader is trad-\ning fewer shares, and when there is a winning streak the trader can trade\nmore shares. Most important, it prevents traders from devastating their ac-\ncounts.\nHere is a recap of what steps the trader can calculate ahead of time:\nĹ Total amount of risk based on a predetermined percentage of the total\namount of trading capital available.\nĹ The use of a stop-loss order; how and where it will be placed.\nĹ The proﬁt targets.\nĹ How the stop-loss order will be moved or trailed.\nNow let’s look at an example of a trader who wants to trade the S&P\nE-mini contract and is starting with an account size of $20,000. (We want\nto make an important point here before looking at this example. Many bro-\nkerages advertise low margins for day trading the S&P E-minis, perhaps\nsomething along the lines of being able to day trade the S&P E-minis at\n$1,000 per contract. Based on this, a trader with a $10,000 account might\nthink he could trade 10 contracts. Most likely that trader, unless very ex-\nperienced, will not survive using that as a money management system. It is\ninconsequential and has nothing to do with calculating and applying sound\nmoney management techniques.)\nWe can use the same approach we used before to calculate the number\nof contracts traded using the Gartley sell pattern in Figure 11.5 as an exam-\nple. The entry into this trade would be at 1405.50 and the stop-loss order\nwould be placed above the X point of the pattern at 1407.75. This is a stop-\nloss of 2.25 points or $112.50 per contract. Using a hypothetical $20,000\naccount, let’s calculate the number of contracts using 1 percent risk and\nassume this is a novice trader:\n1. $20,000 × 1% = $200. This is the total amount of risk in the trade.\n2. $200 ÷ $112.50 = 1.7. The correct amount of contracts based on this\nrisk proﬁle is 1. You want to round down any uneven numbers.\n",
      "candlestick_hits": 4,
      "is_highly_relevant": true
    },
    {
      "page": 183,
      "text": "Trade Management\n163\nFigure 11.5\nExample of S&P E-mini 5-minute chart of Gartley sell pattern—\ncalculating the correct number of contracts.\n3. The entry point is 1405.50, and the stop-loss order is placed at 1407.75,\nwhich is 2.25 points or $112.50 per contract.\n4. We take the amount of risk, $200 in this example, and divide by where\nthe stop-loss order is placed; in this example the correct placement is\njust above the D point at 1407.75 or 2.25 points.\nThe maximum amount the trader can lose on this trade is $112.50. Until\nthe account balance is increased to a level that can add on a contract, the\ntrader must plan trades with one exit. There is an advantage to this, and\nthat is the trader will be learning excellent execution skills at this point\nin his trading. Novice traders are most likely at this point in their trading\ncareers to lose on more trades because they are still gaining market ex-\nperience. This is the time to keep risk very small and build trading skills.\nIn this particular example, the trader could use an exit strategy of tak-\ning a proﬁt equal to the amount of risk in the trade. In this case that would\nbe at 1403.25, which would provide a $112.50 or 2.25-point proﬁt.\nĹ Using 2 percent risk in this trade example, the total amount of risk\nwould be $400 or three contracts.\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 184,
      "text": "164\nTRADE WHAT YOU SEE\nĹ Using 3 percent risk in this trade example, the total amount of risk\nwould be $600 or ﬁve contracts.\nIf the stop-loss order were 5 points or $250, the trader would have to\npass on that type of setup and wait for a setup that had an appropriate\nstop-loss placement based on the percent of risk being used. The risk using\na 5-point stop would exceed the $200 maximum allowable loss per trade. It\nis a mistake to use stops that are too close; this will result in unnecessary\nlosses and frustration on the trader’s part. It is an art and a skill learning to\nplace stops correctly.\nEach trader needs to decide based on one’s risk tolerance proﬁle and\ntrading experience what percentage of capital to risk. An important con-\nsideration in this decision is the number of trades the trader has open at\none time. The less experienced the trader, the fewer open trades the trader\nshould have. A very hard lesson to learn is watching several open (over-\ntrading) positions turn into losses at the same time.\nTraders should take into account a worst-case scenario if trading more\nthan one open position. They should know how much of a drawdown the\naccount would sustain if the worst-case scenario occurred. Our suggestion\nwould be to concentrate on learning one or two patterns in one or two\nmarkets and become proﬁcient with them. There will be time to add in\nmore patterns and markets if the trader so chooses.\nHere are several trading mistakes that can devastate a trader’s account.\nThey are all violations of sound money management practices:\nĹ Not placing stop-loss orders. This allows a small loss to turn into a\nlarge loss and is a cardinal sin in trading.\nĹ Overtrading. Here traders are either trading outside of their trading\nplans, taking random trades, or having too many open positions at one\ntime.\nĹ Moving stop-loss orders to avoid a loss. Never increase a predeter-\nmined stop-loss amount.\nĹ Exceeding the amount of capital risked on one trade or multiple open\ntrades.\nĹ Not taking proﬁts when available. This is letting a winning trade turn\ninto a losing trade and should absolutely be avoided.\nWe leave you with the most important rules at the end of this chapter:\n1. Rule #1: Always use stop-loss orders.\n2. Rule #2: Never violate Rule #1.\n",
      "candlestick_hits": 6,
      "is_highly_relevant": true
    },
    {
      "page": 185,
      "text": "C H A P T E R 1 2\nUsing Options\nwith the\nFibonacci Ratios\nand Patterns\nT\nhis chapter covers how to use options with extension patterns, such\nas the Butterﬂy pattern or the 1.272 and 1.618 extensions. We assume\nyou have some knowledge of options and how they work. If not, we\nrecommend checking out the Chicago Board Options Exchange web site\n(www.cboe.com). The site is an excellent source of educational material\nfor all levels of options traders, including tutorials that can be downloaded\nfree of charge.\nCALL AND PUT OPTIONS DEFINED\nThe call option gives the buyer, or owner, the right—but not the\nobligation—to purchase the underlying instrument at a speciﬁed price,\nknown as the strike price, for a speciﬁed time period (i.e., until the ex-\npiration date). The writer of the call option, the one who sells the option,\nis obligated to sell the underlying instrument at the speciﬁed (strike) price\nif that option is assigned.\nThe put option gives the owner the right to sell the underlying instru-\nment at a speciﬁed price, known as the strike price, within a ﬁxed period\nof time (i.e., until the expiration date). The writer of the put option, the one\n165\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 187,
      "text": "Using Options with the Fibonacci Ratios and Patterns\n167\nFigure 12.2\nMicrosoft (MSFT) daily chart showing a put option example of\nat-the-money, in-the-money, and out-of-the-money strike prices.\nĹ The amount of time to the expiration date—time premium is priced\ninto an option, and as the expiration date draws closer the time pre-\nmium will decay.\nĹ Volatility of the underlying instrument—as a rule of thumb, the higher\nthe volatility, the higher the price of the option.\nĹ Dividend payout of an underlying stock during the lifetime of the\noption.\nĹ Interest rates, both long-term and short-term, will have an effect on the\noption’s pricing.\nĹ Open interest, or how much interest there is in any particular option at\na particular strike price and expiration date. If there is more open inter-\nest, then there is likely to be a larger premium priced into the option.\nThe option buyer wants to purchase options that have a fair amount of\nopen interest.\nCONTROLLING RISK WITH OPTIONS\nThere are many ways to use options, but here we will focus on just one\nsimple strategy for each type of option:\nĹ Buy call options when there may be a signiﬁcant move to the upside\nbased on a longer-term pattern.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 188,
      "text": "168\nTRADE WHAT YOU SEE\nFigure 12.3\nBuy call options when expecting a large rise in prices, and buy put\noptions when expecting a large decline in prices.\nĹ Buy put options when there may be a signiﬁcant move to the downside\nbased on a longer-term pattern.\nFigure 12.3 illustrates when we utilize call options and put options.\nThe main reason to use options at what may be major or signiﬁ-\ncant market turning points is the leverage they offer. Options can be pur-\nchased for a set dollar amount that can be a small portion of trading\ncapital. When a particular market or underlying instrument has a large\nmove in the anticipated direction, option prices can increase dramatically,\ngiving the option investor a potential large return on a relatively small\ninvestment.\nIt is important to understand that about 85 percent or all options expire\nworthless. Therefore, the trader must risk only a small portion of total trad-\ning capital on any one option strategy. When using this option strategy, the\ntrader’s risk is limited to the cost of the option. If the trade does not work\nand the option expires worthless, then the total dollar amount expended\nfor the option purchase is the total loss in the trade. This gives the trader\nlimited risk and a large proﬁt potential. This must be viewed and utilized\nas part of the trader’s overall money management plan.\nEXAMPLES OF USING OPTIONS WITH\nEXTENSION PATTERNS\nOne of the reasons we like to use options with extension patterns, such as\nthe Butterﬂy pattern or a 1.272 or 1.618 extension, is that the options gen-\nerally are marked down in price at that point. In longer time frames, such\nas daily or weekly charts, patterns generally will have an excessive amount\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 189,
      "text": "Using Options with the Fibonacci Ratios and Patterns\n169\nof bullishness or bearishness close to the completion points—bullishness\nin the case of sell patterns and bearishness in the case of buy patterns.\nThis in itself will generally cause the out-of-the-money options to collapse\nin premium.\nOur strategy is to buy out-of-the-money calls or puts on or near the\ncompletion of the pattern. This gives the trade and pattern some time to\ncomplete, and we do not have to time an exact entry point in sometimes\nvolatile market conditions. This can be an advantage at times over trading\nthe outright futures or stocks.\nWe will look at two examples, one a purchase of call options that was a\nsuccessful trade and one a purchase of put options that expired worthless.\nSoybeans Call Option Purchase\nCall options are purchased around the completion of the 1.272 extension\n(shown in Figure 12.4). Soybeans are trading in the 5.50 per bushel area\nat the end of August, and December out-of-the-money call options at a 600\nstrike price are purchased for around $2.00 per option or $200 per contract\n(100 calls). The expiration in December would give the market time to\nmove up.\nFigure 12.4\nSoybeans daily chart of out-of-the-money call options purchased\nnear a 1.272 extension pattern completion.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 190,
      "text": "170\nTRADE WHAT YOU SEE\nAfter being held for over two months with little price action, once the\nmarket starts to move up in a trendlike fashion the options increase in\nvalue. The same trade management techniques we have covered in earlier\nchapters can be used with options. The .618 level offers a good ﬁrst prof-\nitable exit point, as the options have gone from out-of-the-money to at-the-\nmoney around the 600 strike price. A good trade management technique\nwith options is to sell half of the option contracts once they reach close to\ndouble in price. For example, this option contract was purchased at $200;\nhalf the options could be sold once the value of the option contract reaches\napproximately $400 in value. This reduces the risk in the trade, and even if\nthe other half then expires worthless the trade has become risk-free.\nOnce the price of soybeans reaches the 1.272 extension on the upside,\nthe options then trade in-the-money; with little time left, the value of the\noptions becomes almost all intrinsic and is close to triple the price paid.\nThe second half of the call options could be sold around the 1.272 extension\nat a good proﬁt.\nS&P 500 Put Option Purchase\nThis put option trade does not work out as well as the soybeans call option\ntrade. The same basic strategy is used—buy out-of-the-money put options\nFigure 12.5\nS&P 500 weekly chart example of put option purchase where options\nexpired worthless.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 191,
      "text": "Using Options with the Fibonacci Ratios and Patterns\n171\nbased on longer-term extension patterns. The put options are purchased\nfor around $850 per option contract. The futures index options such as\nthese are generally more expensive than other options, and we try to pur-\nchase them below a $1,000 risk level per option contract.\nAs you can see in Figure 12.5, the extension pattern is the Butterﬂy\npattern, but the options in this trade are purchased near the completion\nof the ﬁrst Gartley sell pattern. The assumption is that the Gartley pattern\nis a retest of the Butterﬂy pattern highs and the market will then have a\nlarger correction down. However, the market continues to trend up and\nthese options expire worthless.\nAlways use strict money management when trading options, and risk\nonly a small portion of total trading capital on one option trade. Trading\noptions can be a proﬁtable strategy when used correctly. You can reduce\nmarket exposure by not trading the stock, commodity, or future outright\nthrough volatile periods. Trading options requires due diligence on the\ntrader’s part and an understanding of the nature and pricing of options.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 194,
      "text": "174\nTRADE WHAT YOU SEE\nThe trading plan is something that can be changed and be modiﬁed\nover time. Successful trading requires ﬁne-tuning your execution skills as\nwell as your money management. Taking steps early in the process to es-\ntablish a trading plan will help put the trader on a path of treating trading\nas a business.\nDAILY TRADING PLAN\nThe depth and extent of a trading plan will depend largely on your current\ntrading skill level. The more in depth your experience and skill level, the\nmore in depth you can develop a trading plan.\nFor a novice trader, starting with just a few basics would be appropri-\nate. As skill and experience are acquired, the trader can add onto the initial\ntrade plan. This section explains the basics to help you get started.\nBasics of a Trading Plan\nThe most obvious place to start is with what you are trading. Here are\nseveral ideas to include as a start:\nĹ Deﬁne the markets you will trade.\nĹ Deﬁne speciﬁc setups you will trade.\nĹ Deﬁne entry point triggers into a trade.\nĹ Deﬁne market conditions that would void the trade.\nĹ Deﬁne the number of shares or contracts to be traded.\nĹ Deﬁne how much risk is in the trade by using money management\nrules.\nĹ Deﬁne stop-loss placement.\nĹ Deﬁne proﬁt objective targets and how and when a stop-loss order is\nmoved.\nUse this list as a checklist until these questions become second nature.\nOne excellent habit to develop is to write the information on a chart of\nthe market that you will be trading. Refer to Figure 13.1 for an example of\nusing a price chart as a checklist for the basic trading plan.\nLet’s assume that a trader will be trading the S&P E-mini market from\na 5-minute time frame and is going to trade all Gartley patterns that form,\nand the trader has done due diligence in planning how the trades are en-\ntered and what conditions prevent the trader from entering a trade. As the\npattern is forming and before it reaches the completion point, the trader\ncan write out all information pertaining to the basic trading plan for that\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 196,
      "text": "176\nTRADE WHAT YOU SEE\nIt is easy to look at a static chart in hindsight and see what should\nhave been done. Part of building trading skills is to do this in real time in\nadvance of any trade setups forming, and then have the ability to follow the\nplan time and time again.\nAs markets move in real time, price movement can cause all types of\nmental interference with a trade setup. The more planning and preparation\nthe trader can do before the actual trade, the stronger trading skills he will\nbuild. This will also help the trader to learn to think in probabilities.\nAs you can see, all of the items in the checklist have been addressed\nin advance of the trade. Taking time to do this will build skills in planning\ntrades, executing trades, and managing trades.\nMark Douglas, author of Trading in the Zone, has an excellent exer-\ncise to help in developing trading skills and seeing an edge play out with\nhis 20 sample trades exercise.\nThis exercise has the trader try to execute 20 trades of the same setup\nwithout error. In the exercise the trader commits to making a series of 20\ntrades of the same setup and executes the trades as ﬂawlessly as possible.\nThis helps traders identify ﬂaws in the method or in their execution skills.\nIf they make an error during the 20 trades exercise, they simply refocus\non their goal and continue. Refer to Figure 13.2 for a worksheet of the 20\nsample trades exercise that can be used for this purpose.\nTraders can track the exact performance of the speciﬁc patterns they\nhave chosen to trade and are using for each 20 sample trades exercise. This\nenables them to gauge and measure in objective terms how closely they\nare following the actual performance of that setup compared to their own\nperformance. If there is a large difference between how the setup performs\nand the actual outcome of their performance, then they can begin to take\nsteps to stay on par with the setup according to their trading plan.\nThis will allow traders to look inside their trading and determine im-\nportant information such as exiting early, entering late, moving stops in-\ncorrectly, and other common trading errors that interfere with developing\nﬁnely tuned trading skills. It is an excellent way to pinpoint problem areas\nso that corrective measures can be taken to improve performance.\nAn example would be if 20 trades were completed and the actual\nperformance of the setup yielded +50 S&P E-mini points, but the trader\nyielded only +15 S&P E-mini points because of trading errors; that gives\nthe trader important information to work with. The trader can now take\nsteps to work on whichever areas need improvement to close that gap.\nTake note of the quote that is at the top of the worksheet: “All traders\ngive themselves exactly what they feel they deserve. Trading is an exer-\ncise in accumulating money. Once we have learned how to trade (perceive\nopportunity and execute our trades), who else or what else could be re-\nsponsible for how much we end up with in our equity account?”—Mark\nDouglas.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 203,
      "text": "Building a Trading Plan\n183\ninternal data they collected throughout the year in their trading statistics.\nAn evaluation of the speciﬁc trade management of speciﬁc patterns may\nreveal approaches that can be adjusted.\nIt is a time to take stock and prepare for the next year’s trading. The\ntrader can evaluate any changes to the basic approach and speciﬁc trade\nmanagement issues. Here are some things to evaluate and plan for on an\nannual basis:\nĹ Which markets will be traded in the coming year.\nĹ A trading plan for each market.\nĹ Time frames traded.\nĹ A plan for incrementally adding on shares or contracts.\nĹ Speciﬁc trading issues to study and improve or focus on (e.g., learn-\ning a new strategy, improving money management, trader psychology,\netc.).\nĹ An outline of how the trader will stay on track and focused throughout\nthe year. This could encompass lifestyle changes or scheduled reviews\nof the trading plan to evaluate whether the trader is staying on track.\nĹ A mission statement for the coming year.\nĹ A review of trading expenses for the past year and a forecast for the\ncoming year.\nĹ Creation of goals and a plan on how to achieve those goals.\nThis process of trading does not have to be complicated or overwhelm-\ning and should be suited to the trader’s experience level. Involving yourself\nin this area of trading will sharpen the focus and create a well-thought-out\nroad map of where and how to reach your goals as a trader.\nTraders are continually in a state of uncertainty when involved in and\ntrading real-time markets. Even on occasions when the trader is very off\nthe track and not trading according to plan, the trading plan is a tool to get\nback to developing good trading habits. Having a well-deﬁned plan is a way\nfor traders to have some grounding and, in a sense, some security, in that\nthey can always refocus on the basics and move on from there.\nDISASTER PLANS\nThe Chicago Mercantile Exchange has a slogan: “Where there is no such\nthing as no such thing.” This sums up why you need to create some sort of\ndisaster plan. This part of the trading plan will entail thinking out as many\nwhat-if scenarios as possible. If you encounter an extreme event that you\nhad not considered, then do the best you can based on the scenarios you\nhave thought of.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 204,
      "text": "184\nTRADE WHAT YOU SEE\nIf you trade long enough, it is not a matter of if some type of disaster\nwill occur, but a matter of when some type of disaster will occur. These\ntimes can either beneﬁt the trader to an extreme or devastate the trader\nto an extreme. With any luck, it may be a neutral outcome. Many of the\nunexpected occurrences can be dealt with if the trader has thought ahead\nand planned for these types of incidents.\nMany types of professions train intensively for unexpected and rare\noccurrences. Almost anyone in medical ﬁelds such as doctors, nurses, and\nEMT personnel train for emergencies. Airline pilots and crews are man-\ndated by the federal government to have speciﬁc annual hours of recur-\nrent training to handle every imaginable type of unexpected event. Fire-\nﬁghters, police and specialized units of the police forces, as well as mil-\nitary personnel and all of those specialized forces train hour upon hour\nto handle stressful on-the-job situations. The approach and reasoning are\nreally quite simple: If an individual has had the beneﬁt of training, prac-\nticing and rehearsing through drills, then in a situation that is sudden\nand likely to cause high stress, fear, or anxiety that individual will be\nprepared to act. That is very important; trained individuals keep their\nwits about them, do not panic, and are able to act under unexpected,\nextreme stress.\nIt will be a great advantage to any trader to take some time to plan for\nwhat-if situations. Unprepared traders have been known to have a “deer in\nthe headlights” response and literally freeze up both physically and men-\ntally at the precise time they need to take action.\nThere is a syndrome that people can succumb to under extreme duress\nknown as “negative panic.” The person goes into a type of shock and is\nnot able to comprehend what is happening, does not realize there is an\nemergency, and can even feel a sense of euphoria that nothing is wrong. It\nis our brains’ way of protecting us at times when our systems go through\nsudden and severe shocks.\nTraining yourself to think and act under excessive pressure is part of\ntrading. Traders take on uncertainty each day they trade and become ac-\ncustomed to normal trading days and routines. It will be the skilled and\nprepared trader who will be able to take action during rarer incidents of\nextreme uncertainty.\nSome types of unexpected events that have occurred in the past in-\nclude the Federal Reserve raising or lowering interest rates without notice\nduring market hours. This can cause markets to move extremely fast and\ncan catch almost all market participants off guard. The bond and currency\nmarkets can spike more than two full points in a matter of seconds in this\ntype of environment. A trader who is on the wrong side of that move and\ndid not use stop-loss protection will surely suffer serious losses as well as\npsychological damage.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 205,
      "text": "Building a Trading Plan\n185\nThe attack on the World Trade Center in New York City on September\n11, 2001, is an example of an extreme outlier event that closed the markets\nfor several days. When the markets reopened on September 17, 2001, there\nwas a panicked sell-off for ﬁve days followed by a rally that lasted for sev-\neral months. On reopening, the market gapped down almost 60 points in\nthe S&P 500 contract. It is easy to see that anyone who had been long on\nthe closing was met with large losses on the reopen. (See Figure 13.3.)\nUnexpected news announcements, political events worldwide, terror-\nist actions, and technical meltdowns can all cause the most extreme sud-\nden moves in the markets. Markets do not like uncertainty and will react\nviolently at times with extreme cases of uncertainty.\nOne very important trading rule to follow that will help to minimize\ndamage done by events that are beyond your control is: Never violate\nmoney management rules in position sizing or use of stop-loss orders. In\nrare market moves caused by unexpected events, it is quite probable that\nyour stop-loss order will be ﬁlled at a worse price. This is something that is\nunavoidable and can and will happen. The best thing to do is to be thankful\nyou indeed had a stop-loss order, brush yourself off, and keep going.\nOn the other side of the coin, if you happen to ﬁnd yourself on the\nright side of one of these sudden moves, consider it a gift and take it. These\nFigure 13.3\nS&P 500 daily chart. The markets closed on September 11, 2001,\nand reopened on September 17 with a gap-down open of 60 points in the S&P 500.\n",
      "candlestick_hits": 3,
      "is_highly_relevant": true
    },
    {
      "page": 206,
      "text": "186\nTRADE WHAT YOU SEE\nmoves can reverse as quickly as they originated, and if you ﬁnd you have a\nwindfall proﬁt the best thing to do is to take it quickly.\nAlong with these types of rare occurrences, the trader can plan for\nother types of potential disasters. These items involve some thought and\nplanning ahead of time, but if and when they occur it will be well worth the\nadditional time spent. We list some of the more common types of things\nthat can play havoc with a trading day:\nĹ Power outages. It is good to make sure your cell phone is charged at\nall times in case you need to call in orders during a power outage. Tele-\nphones and Internet services can frequently go out with electrical out-\nages. It is a good policy if day trading to close out any open positions if\nthey cannot be properly managed. Some traders have wireless connec-\ntions on laptop computers and can utilize those during a power outage.\nĹ Computer crashes. Know in advance what your plan is if you cannot\nmanage open positions and do not have access to data in the event of\nyour computer crashing. Technology is not perfect, and it will fail at\nthe most inopportune time.\nĹ Order entry errors. Occasionally traders will incorrectly enter the\nwrong number of shares of contracts for an order. It is not wise if the\norder is beyond your money management plan to try to gain a proﬁt.\nRemember, you can gain a larger loss just as easily. Close out the ex-\ncess number of shares or contracts immediately, and go on with the\ntrade as planned.\nĹ Entering incorrect buy or sell orders. Another form of an order entry\nerror is when a trader enters a buy order instead of a sell order. It is\na very good habit to get into to check what any open position is upon\nany order being ﬁlled. There are many stories of traders who at the end\nof the day thought they had a proﬁt from their trades only to ﬁnd out it\nwas a loss because the orders were entered incorrectly and no check\nof positions was done.\nĹ Incorrect information on a statement. Keep good trading records. Oc-\ncasionally it will happen that something shows up in your account that\nyou neither bought nor sold. Usually a call to the broker will resolve\nthis. It is imperative that traders keep good daily records, including\norder numbers for each ﬁll. It does not take much time to jot down an\norder number, and it is usually the ﬁrst thing a trading desk will ask for.\nBefore closing the trading platform each day, the trader should metic-\nulously check to make sure any open orders are correct and that the\nproﬁt/loss for the day matches the trader’s records. This in itself will\neliminate many difﬁculties in resolving errors.\nĹ Unexpected news announcements/exchange closures. An exchange\nclosing suddenly happens occasionally and can be due to technical\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 207,
      "text": "Building a Trading Plan\n187\nproblems at the exchange or to world events as we saw on September\n11, 2001. Occasionally, unexpected news announcements will severely\nmove a market. It has happened in the past that any orders in a market\nat a particular exchange have been canceled. It is possible to hedge\nthe position by using another instrument at another exchange. As an\nexample, traders who are open a short position in the S&P E-mini mar-\nket could go long the Dow futures. At times like these the phone lines\nat brokers and trading desks will be very hectic, and it may be difﬁcult\nto get through. If it is not possible to hedge the position and the market\nreopens at a disadvantage, get out as gracefully as you can and move\non. Remember, these are rare occurrences that you have no control\nover, and you do the best you can.\nĹ Large gap openings. If you hold positions overnight, sooner or later\nyou will have a market open beyond your stop-loss on a gap opening.\nGap openings happen when there is an imbalance of buyers and sellers\nand can occur when some type of news item comes out overnight that\nimpacts that market or stock. If this happens, it can be handled by\nwaiting about 20 minutes after the open of that market. If the price\nthen moves in your favor, place a stop-loss order at the high or low. If\nthe price continues to move in your favor, you can either trail the stop\nor exit around your original stop-loss order if the price reaches it. If the\ngap was in your favor, it is wise to take at least part of the windfall and\nadjust the stop. Many times news announcements that move a market\nsuddenly will reverse, and you do not want to be in a position to give\nback proﬁts. If the price then continues at a loss, you will be stopped\nout at the high or low at which you placed the stop-loss order.\nĹ High levels of stress or distractions. Each trader has a different toler-\nance for stress and distractions. There will be times in each person’s\nlife that an unusual amount of stress or outside distractions will make\nit difﬁcult to trade efﬁciently. Some types of stresses that ﬁt into this\nare divorce or relationship problems, death of a loved one, and illness.\nOnce again, take some time to plan ahead with regard to what actions\nare best to take, such as stopping or limiting trading until some bal-\nance is restored. It is very easy to lose money trading during times of\nexcessive stress, and most often taking a break is the best solution.\nSUMMARY\nTrading is a process of constant reﬁnements and adjustments. Taking time\nto outline each part of an overall trading plan will allow traders to make\nadjustments as they move forward in their trading.\n",
      "candlestick_hits": 4,
      "is_highly_relevant": true
    },
    {
      "page": 211,
      "text": "Daily Routines\n191\nhavoc on a trader’s mental well-being and can be the cause of impul-\nsive trades. Set audio alerts when possible.\n▶Note any observations on prices or patterns that you want to review\nlater.\n▶Take frequent breaks during market hours.\n▶Online chat rooms can be excellent learning tools, but beware of en-\ntering trades that are not part of your trading plan or trading setups\nthat you have not studied for yourself.\n▶Close out any day trades before the close. Do not turn a losing day\ntrade into a position trade by holding it overnight.\nIf you trade on a short-term time frame such as a 5-minute chart, then\nit could be part of your trading plan to watch for speciﬁc patterns to form\nthroughout the day on that time frame. In that case, the trader would need\nto monitor the prices in that market throughout the day. However, if the\ntrader is making trades from a longer-term time frame such as a 60-minute\nor daily chart, then it would not make sense for the trader to watch the\nprices intently throughout the day.\nMany markets now trade almost 24 hours a day, and traders should\nfocus on the markets they want to trade that ﬁt into their daily regimen.\nTraders who trade on a part-time basis should also choose markets and\ntime frames that do not greatly interfere with their main profession.\nAfter Market Hours\nAfter Market Hours Checklist\n▶Always check accounts before closing trading platforms to ensure\nany open positions are correct and that closed positions are closed.\n▶Check the proﬁt/loss in the account against your intraday trading\nrecords.\n▶Check to ensure the number of contracts or shares traded is correct.\n▶Record all order numbers and trade transactions. See Figure 14.1 for\nan order sheet example.\n▶Update spreadsheets for keeping trading data.\n▶Update any hand charts or other data.\n▶Note any trading opportunities for the next day; this is the time to do\ngeneral homework to prepare for the next day’s trading. This would\ninclude scanning markets and individual stocks for patterns.\n▶Evaluate any open positions to determine stop-loss orders, proﬁt tar-\ngets, and so on.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 214,
      "text": "194\nTRADE WHAT YOU SEE\nserious damage can be done to our psyches and our accounts. It is im-\nportant for each trader to learn where this mental balance is and respect\nit. A novice trader may ﬁnd the boundary narrower than that of a trader\nwith more market experience. A more experienced trader is better able to\nbounce back from losses. Understand that this, too, is a process of expand-\ning your mental capacity to handle all types of trading situations. As you\ngain experience, the capacity to handle more will increase.\nThere are actions a trader can take to create a positive mental attitude\nprior to trading and to focus on thinking in probabilities. Reading a few\npages of a motivational book or article can be extremely helpful. One of\nour favorites is Mark Douglas’s Trading in the Zone. Douglas speaks to\nthe trader from the heart, and with each sentence the trader feels as though\nDouglas is speaking directly to him.\nWriting a few short phrases or quotes the trader can read and reread\nthroughout the day can help keep the trader focused and in the correct\nframe of mind. Having trading partners or friends to share trading ideas\nand stories with can be very helpful. Sometimes just getting it off your chest\nafter a bad day is all that is needed to get back on track and see things with\nclarity again.\nA series of losses can begin to chip away at a trader’s mental attitude.\nRemember that losses will always be a part of trading. A series of losses\nis most commonly followed by a series of wins. A good way to maintain a\npositive mental attitude is to understand this and move on to the next trade.\nLosses tell you that the position is wrong and the stop-loss order prevents\na reasonable loss from turning into a devastating loss. There is no reason\nto take losses personally; if you ﬁnd you are taking losses personally, then\nrefocus on thinking in probabilities.\nA positive mental attitude is as important to traders, if not more so,\nthan any tested method, software program, or indicator they will ever use.\nThere are many motivational books that can be included in the trader’s\nlibrary that encourage a positive mental attitude. A few that we like are:\nThink and Grow Rich, by Napoleon Hill.\nAs a Man Thinketh, by James Allen.\nLight from Many Lamps, by Lillian Watson.\nEssentials of Trading: It’s Not WHAT You Think, It’s HOW You Think,\nby Larry Pesavento and Leslie Jouﬂas.\nWe have listed other books in the recommended reading section in the\nback of the book, and we encourage all readers to investigate many of these\nﬁne books.\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 216,
      "text": "196\nTRADE WHAT YOU SEE\nĹ Time away from trading. Routinely planning some time away from\ntrading is crucial. Trading can place many demands on us and can be\nall-consuming. Schedule short breaks and long breaks from trading.\nMost traders ﬁnd that once they have established a solid routine for\nthemselves they may feel off balance, even a bit out of control, if for one\nreason or another they are not able to follow the routine. This could be\nsomething like getting home late before a trading day and not having ade-\nquate time to review and accomplish all items on the list for the next day’s\ntrading. Once back in the routine, the trader usually feels a sense of famil-\niarity and is back in control. Routines center us amidst an environment of\nuncertainty.\nSometimes being away from trading for a few days or weeks can give\ntraders a sense of disorientation, of not having their ﬁnger on the pulse of\nthe market. Returning after a longer period away from trading and resum-\ning an established routine will usually put them right back where they had\nleft off. Take time to establish a well-thought-out routine that beneﬁts your\ntrading, mental attitude, and physical health.\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 217,
      "text": "A P P E N D I X\nUseful Resources\nT\nhere are many great books available for traders—too many to list\nhere. These are some that we feel are most worth taking the time\nto read. We also include trading magazine sources as well as web site\ninformation.\nTECHNICAL BOOKS\nBulkowski, Thomas N., Encyclopedia of Chart Patterns (New York: John\nWiley & Sons, 2000).\nGarrett, William, Investing for Proﬁt with Torque Analysis of Stock Mar-\nket Cycles (Englewood Cliffs, NJ: Prentice-Hall, 1973).\nGartley, H.M., Proﬁts in the Stock Market (Pomeroy, WA: Lambert-Gann\nPublishing, 1935).\nGilmore, Bryce, Geometry of Markets (Self-published, 1989).\nGrant, Kenneth L., Trading Risk: Enhanced Proﬁtability through Risk\nControl (Hoboken, NJ: John Wiley & Sons, 2004).\nHill, John, George Pruitt, and Lundy Hill, The Ultimate Trading Guide\n(New York: John Wiley & Sons, 2000).\nNison, Steve, Beyond Candlesticks (New York: John Wiley & Sons,\n1994).\nNison, Steve, Japanese Candlestick Charting Techniques (New York: New\nYork Institute of Finance, 1991).\n197\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 218,
      "text": "198\nAPPENDIX\nPesavento, Larry, Fibonacci Ratios with Pattern Recognition (Greenville,\nSC: Traders Press, 1997).\nPesavento, Larry, and Peggy MacKay, The Opening Price Principle\n(Greenville, SC: Traders Press, 2000).\nSchabacker, R.W., Stock Market Theory and Practice (n.p.: B.C. Forbes\nPublishing Company, 1930).\nMOTIVATIONAL BOOKS\nAllen, James, As a Man Thinketh (Mount Vernon, NY: Peter Pauper Press,\n1960).\nBristol, Claude M., The Magic of Believing (New York: Pocket Books/\nSimon & Schuster, 1969).\nHill, Napoleon, Think and Grow Rich (New York: Tarcher Publishing,\n2005).\nLeF`evre, Edwin, Reminiscences of a Stock Operator (New York: John\nWiley & Sons, 1993).\nLongstreet, Roy, Viewpoints of a Commodity Trader (Greenville, SC:\nTraders Press, 1967).\nMack, Gary, with David Casstevens, Mind Gym (New York: Contemporary\nBooks/McGraw-Hill, 2001).\nPesavento, Larry, and Leslie Jouﬂas, Essentials of Trading; It’s Not WHAT\nYou Think, It’s HOW You Think (Greenville, SC: Traders Press, 2004).\nSchwartz, Marty, Pit Bull (New York: HarperBusiness, 1998).\nSmitten, Richard, The Amazing Life of Jesse Livermore (Greenville, SC:\nTraders Press, 1999).\nWatson, Lillian, Light from Many Lamps (New York: Simon & Schuster,\n1951).\nINTERVIEWS WITH TRADERS\nCollins, Art, When Supertraders Meet Kryptonite (Greenville, SC: Traders\nPress, 2002).\nSchwager, Jack, Market Wizards (New York: New York Institute of Fi-\nnance, 1989).\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 219,
      "text": "Appendix\n199\nSchwager, Jack, The New Market Wizards (New York: HarperBusiness,\n1992).\nSchwager, Jack, Stock Market Wizards (New York: HarperBusiness,\n2001).\nTRADING PSYCHOLOGY BOOKS\nDouglas, Mark, The Disciplined Trader (New York: New York Institute of\nFinance, 1990).\nDouglas, Mark, Trading in the Zone (New York: New York Institute of\nFinance/Prentice Hall, 2000).\nKiev, Ari, Hedge Fund Masters (Hoboken, NJ: John Wiley & Sons,\n2005).\nMaltz, Maxwell, M.D., F.I.C.S., Psycho-Cybernetics (Englewood Cliffs, NJ:\nPrentice-Hall, 1960).\nMcCall, Richard D., The Way of the Warrior Trader (New York: McGraw-\nHill, 1997).\nMurphy, Shane, and Doug Hirschhorn, The Trading Athlete (New York:\nJohn Wiley & Sons, 2001).\nPhillips, Larry W., Tao of Poker (Avon, MA: Adams Media Corporation,\n2003).\nSteenbarger, Brett N., Enhancing Trader Performance (Hoboken, NJ:\nJohn Wiley & Sons, 2007).\nSteenbarger, Brett N., The Psychology of Trading (Hoboken, NJ: John\nWiley & Sons, 2003).\nSun Tzu, The Art of War, trans. Thomas Cleary (Boston: Shambhala Publi-\ncations, 1991).\nTRADING MAGAZINES\nActive Trader\nFutures Magazine\nTechnical Analysis of Stocks and & Commodities\nTrader Monthly\nTrader’s Journal\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 220,
      "text": "200\nAPPENDIX\nSOFTWARE SOURCES WITH FIBONACCI\nTOOLS\nEnsign Software—www.ensignsoftware.com\neSignal (also operates QCharts)—www.esignal.com\nTradeStation—www.tradestation.com\nTRADING-RELATED WEB SITES\nwww.brettsteenbarger.com\nwww.cboe.com\nwww.cbot.com\nwww.cme.com\nwww.ensignsoftware.com/help/simbroker.htm—Simulated Trading\nwww.markdouglas.com\nwww.tradingliveonline.com\nwww.tradingtutor.com\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 221,
      "text": "Index\nA\nAB=CD pattern:\nCD leg variations, 45–48\ncharacteristics of, 44–45\ndescription of, 41\nhistory of, 39–40\npsychology of, 50\nslope and time frames of,\n48–49\nstructure of, 41–43\ntrading, 51–54\non trend day, 139–140, 141\nAdams, Evangeline, 12\nAlcoa (AA), 107–108\nAllen, James, 194\nAs a Man Thinketh (Allen), 194\nAsymmetrical geometric pattern,\n9–10\nAt-the-money call option, 166\nB\nBarrick Gold Corporation (ABX),\n87\nBayer, George, 9, 11\nBroadening Top and Bottom patterns:\nadding Fibonacci ratios to, 132–133\nfailure point on, 133–134\nidentiﬁcation of, 130–131\nstructure of, 131–132\ntrading, 134\nBurrell, Lisa, 11\nBusiness plan, annual, 182–183\nButterﬂy pattern:\ncharacteristics of, 73–74\ndescription of, 70–72\nhistory of, 69–70\npsychology of, 74–75\nstructure of, 72–73\ntrading, 75–83\nBuy and sell, 42, 58, 71\nBuy or sell orders, entering incorrect,\n186\nC\nCall options, 165, 166, 169–170\nCasinos, 154–155\nCD leg phenomena variations,\n45–48\nCentex Corporation (CTX), 104, 105,\n106\nClassical technical analysis patterns,\n117\nCole, George, 118\nComputer crashes, 186\nConﬁrmation signs, in trade\nmanagement, 157–159\nConti Commodity Trading, 20\nContracts, calculating number of,\n162–163\nCorn, 114, 133\nCountertrend trades, managing,\n122–123\nCrabel, Toby, 138\nCrawford, Arch, 12\nThe Crawford Perspectives, 12\nCrude oil:\nButterﬂy sell pattern, 79–81\nDouble Top pattern, 123, 124\nfutures of, 21, 22\nharmonic numbers, 35\n201\n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 222,
      "text": "202\nINDEX\nD\nDaily routine of traders. see also\nTraders\nmental preparation, 192–195\nphysical preparation, 195–196\ntrade preparation, 189–192\nDay Trading with Short Term Price\nPatterns and Opening Range\nBreakout (Crabel), 138\nDisaster plans, 183–187\nDistractions, traders and, 187\nDouble Bottom pattern:\ncharacteristics of, 119–120\nexample of, 120–121\nfailure point on, 125\nrecognizing, 123–124\ntrend clues of, 121–123\nDouble Top pattern:\ncharacteristics of, 119–120\nexample of, 123, 124\nfailure point on, 124\nrecognizing, 123–124\nDouglas, Mark, 155, 176, 177, 194\nDow, Charles, 118\nDow futures, 21, 22, 24–26\nDow Index, 120, 121–123, 132\nDow Jones Industrial Average, 35, 120,\n131\nDowntrend, 20, 21\nE\nThe Egg of Columbus (Bayer), 11\nElliott, Ralph, 118\nElliott, W. D., 71\nEOG Resources (EOG), 46\nEqual time phenomenon, 121\nEuro currency, 29–30, 47\nEuro futures, 82–83\nEuro with Gartley “222” sell pattern,\n112–113\nExpanding Triangle pattern, 132\nF\nFailure point:\nBroadening Top and Bottom\npatterns, 133–134\nDouble Bottom pattern, 125\nDouble Top pattern, 124\nHead and Shoulders Bottom pattern,\n129\nHead and Shoulders Top pattern, 127\nFibonacci ratios:\nadding to Broadening Top and\nBottom patterns, 132–133\napplying, 16–18\napplying to Head and Shoulders Top\npattern, 126\ncombining with harmonic numbers\nin S&P 500 E-mini, 32\nfor moving stop-loss order, 123\norigin and principles of, 12–16\npatterns, 9–12\non trend days, 142–144\nFibonacci retracement pattern, 96–103\nFibonacci retracement ratio, 57, 60\nFibonacci retracement setups, 110–112\nFibonacci tools, software with, 200\nThe Frank Tubbs Stock Market Course\n(Tubbs), 40\nG\nGann, W. D., 9, 11, 20, 70, 97, 118, 121\nGarrett, William, 12\nGartley, H. M., 39, 41, 53–55, 118, 131\nGartley “222” pattern:\ncharacteristics of, 59–61\ndescription of, 57–58\nhistory of, 55–57\npsychology of, 61–62\nsell pattern, 162–163\nstructure of, 58–59\ntrading, 62–68\nGeometric patterns, 9–18\nThe Geometry of Markets (Gann,\nBayer, Gilmore), 9\nGilmore, Bryce, 9, 69\nGolden mean ratio, 13–14\nGold futures, 23–24, 93, 94, 99\nGoldman Sachs (GS), 105–107\nGold market, harmonic numbers in, 35\nGoogle (GOOG):\nButterﬂy pattern, 109, 110\nGartley “222” pattern, 65–68, 71\nmicro view of trade entry, 111\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 223,
      "text": "Index\n203\nrepetitive swings formation, 26 , 27\ntime in symmetry of patterns, 47\nGrant, Kenneth L., 154\nH\nHarmonic numbers:\ndeﬁned, 20\nﬁnding, 28–30\norigin of, 19–20\nin other markets, 34–35\nrepetition in price swings, 24–28\nin S&P 500, 30–31, 32\nusing expansions of, 30, 33\nusing 3 percent rule for, 33–34\nvibrations in price swings, 21–24\nHead and Shoulders Bottom pattern,\n127–129, 130\nHead and Shoulders pattern, 125–127\nHead and Shoulders Top pattern, 126,\n127, 129\nHill, Napoleon, 194\nI\nIBM:\nharmonic swings forming AB=CD\npattern, 39\nHead and Shoulder Top pattern, 128,\n129\nHead and Shoulder Top pattern with\nFibonacci ratios application, 126\nusing harmonic numbers for\nstop-loss orders, 33, 34\nIntel (INTC), 48, 99–100, 156, 157\nIn-the-money call option, 166\nL\nLiber abaci (Book of Calculation)\n(Leonardo), 13–14\nLight from Many Lamps (Watson),\n194\n“Lighting bolt” shape, of buy and sell\npatterns, 42\nLindsey, Charles, 40\nM\nMacKay, Peggy, 103\nMarket(s):\nharmonic numbers in, 34–35\nhistory of geometry in, 11–12\npremaket trade preparation, 190\npreparation after market hours,\n191–192\npreparation during market hours,\n190–191\nsetup for opening price Retracement\ntrade, 103–104\nvibrations in, 20, 21–24, 28\nMarket Wizards (Schwager), 118\nMerck, 41, 43\nMicrosoft (MSFT), 166, 167\nMoney management, 153–164\nMorgan, J. Pierpont, 11\nMultiple time frames:\nadvantages of, 108–110\nmanaging risk using, 110–112\nmultiple pattern completion,\n112–115\nopposing patterns on, 113–115\nN\nNarrowing of range (NR7), 138\nNASDAQ-100 (QQQQ), 90–91, 100–102,\n158\nNews announcements/exchange\nclosures, unexpected, 186–187\nO\nOpening Price Principle (Pesavento\nand Mackay), 103\nOpening Price Retracement patterns,\n103–104\nOpening Price Retracement setups,\n103, 105–108\nOpening Price Retracement trade,\nmarket setup for, 103–104\nOptions:\ncontrolling risk with, 167–168\nwith extension patterns, 168–171\nfactors inﬂuencing price of,\n166–167\nutilizing call and put options, 168\nOrder entry errors, 186\nOut-of-the money call /put option, 166,\n169\n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 224,
      "text": "204\nINDEX\nP\nParallel trend lines, 40\nPerformance, tracking, 178\nPesavento, Larry, 57, 103\nPﬁzer Butterﬂy buy pattern, 75–79\nPhysical preparation of traders,\n195–196\nPower outages, 186\nPremarket trade preparation, 190\nPrice swings, 21, 23–24, 24–28\nPrice symmetry, in three drive pattern,\n88\nProﬁts in the Stock Market (Gartley),\n39, 55–57, 131\nPut option, 165–166, 170–171\nR\nRange, 20, 31, 32, 138\nRaschke, Linda, 138\nRepetition, 20, 24–28\nResearch in Motion Limited (RIMM),\n98\nResources for traders, 197–200\nReverse Point Wave system, 131\nRisk, 159–164, 167–168\nS\nSandisk Corporation, 161\nSchabacker, R. W., 117, 118, 119, 128,\n130\nSchwager, Jack, 118\nSchwartz, Marty, 118\nSideways-trading market, 20, 21\nSilver market, harmonic numbers in, 35\nSoybeans:, 35, 63–65, 73, 169–170\nS&P 500. see also S&P 500 E-mini\nharmonic numbers in, 30–31, 32\nput option purchase, 170–171\non September 11, 2001, 185\ntweezer top and bottom pattern, 61\nS&P 500 E-mini\nAB=CD buy and sell patterns, 42\nextension of CD leg, 49\nFibonacci Retracement pattern, 97\n5–minute hand chart, 193\nGartley “222” pattern, 67–68,\n162–163, 174–175\nharmonic swings forming, 26, 27\nprice in trend form, 23\nretracement pattern, 97, 102–103\nthree drives pattern, 91–94\ntrading AB=CD pattern, 51–53\ntrading trend day, 136–138,\n145–148\ntrend day, 149–150\nStock Market Theory and Practice\n(Schabacker), 117, 128, 130\nStop-loss orders, 33\nStrike price, 166–167\nSwings, 20\nSymmetrical geometric pattern, 10,\n13\nSymmetry, in Butterﬂy pattern, 74\nT\nTechnical analysis:\nbasics of, 119\nBroadening Top and Bottom\npatterns, 130–134\ndouble bottom and top patterns,\n119–125\nhead and should pattern, 135–130\nhistory of, 118–119\nThink and Grow Rich (Hill), 194\nThree drives pattern:\ncharacteristics of, 88–89\ndescription of, 86–87\nhistory of, 85–86\npsychology of, 89\nstructure of, 87–88\ntrading, 89–94\n3 percent rule, in harmonic numbers,\n33–34\nThrust, in Butterﬂy pattern, 74\nTime symmetry, 88, 126\nTorque Analysis of Stock Market\nCycles (Garrett), 12\nTotal Trading capital, using percentage\nof, 159–164\nTrade management. see also Trading\nconﬁrmation signs, 157–159\nsteps of, 153–154\nthinking in probabilities, 154–155\nwarning signs, 156\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 225,
      "text": "Index\n205\nTraders. see also Daily routine of\ntraders\nreasons for failure, 6–7\nreasons for success, 5–6\nresources for, 197–200\nthinking in probabilities, 154\nusing performance statistics,\n178–180\nTrades Worksheet, twenty sample, 177\nTrade tracking sheet, 192\nTrading. see also Trade management;\nTrading plan\nAB=CD pattern, 51–54\nBroadening Top and Bottom\npatterns, 134\nButterﬂy pattern, 75–83\nGartley “222” pattern, 62–68\nHead and Shoulders Top pattern,\n127\nmistakes in, 164\nOpening Price Retracement setups,\n105–108\nfrom short time frame, 137\nsuccessful, steps for, 5–6\nthree drives pattern, 89–94\ntrend day, 145–150\nTrading in the Zone (Douglas), 155,\n176, 177, 194\nTrading plan. see also Money\nmanagement\nannual business plan, 182–183\nbeneﬁts of, 173–174\ndaily, 174–180\ndisaster plans, 183–187\nsoftware, computer, and ofﬁce\ncosts, 182\ntracking performance, 178\ntrading as a business, 180–182\nusing trader performance statistics,\n178–180\nTrading Risk: Enhanced Proﬁtability\nthrough Risk Control (Grant), 154\nTrend, 20, 135, 136\nTrend day consolidation pattern,\n140–142\nTrend days\ncontrolling risk on, 144–146\nFibonacci ratios on, 142–144, 145\nidentifying, 136–137\npatterns on, 139–142\ntrading, 145–150\nTrident: A Trading Strategy\n(Lindsay), 40\nTubbs, Frank, 40\nTweezer bottoms, 60, 157–158\nTweezer top, 60\nTwentyman, Jim, 19–20\nU\nUptrend, example of, 20, 22\nW\nWal-Mart (WMT), 53–54\nWarning signs, in trade management,\n156\nWatson, Lillian, 194\nWaver Trader Program, 69, 70\nW bottoms. see Double Bottom\nPattern; Double Top pattern\nWestinghouse Electric, 128\nWetzel, A. W., 130\nWheat, 28, 35\nWilder, J. Welles, 131\nWyckoff, Richard, 118\n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    }
  ]
}