{
  "book_key": "trading_zone",
  "title": "Trading in the Zone - Master the Market with Confidence, Discipline and a Winning Attitude 2000.pdf",
  "tier": "nice_to_have",
  "focus": "trading_psychology",
  "description": "Trading principles, psychology",
  "total_pages": 144,
  "relevant_pages": 82,
  "highly_relevant_pages": 0,
  "extracted_pages": [
    {
      "page": 1,
      "text": "",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 2,
      "text": " \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nTRADING IN THE ZONE \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 3,
      "text": " \n \n \n \n \n \nMASTER THE MARKET WITH \nCONFIDENCE, DISCIPLINE AND \nA WINNING ATTITUDE \n \n \nMARK DOUGLAS \nForeword by Thorn Hartle \n \nNEW YORK INSTITUTE OF FINANCE \nwcw VHDV • Tnnnurn . cvnucv • Tnrvn • cinr.«pnpc \nLibrary of Congress Cataloging-in-Publication Data \nDouglas, Mark (Mark J.) \nTrading in the zone : master the market with confidence, discipline, and a \nwinning attitude / by Mark Douglas, \np. cm. \nISBN 0-7352-0144-7 (cloth) \n1. Stocks. 2. Speculation. I. Title. \nHG6041 .D59 2001 \n332.64—dc21 00 045251 \n© 2000 by Prentice Hall \nAll rights reserved. No part of this book may be reproduced in \nany form or by any means, without permission in writing from \nthe publisher. \nPrinted in the United States of America \n10 9876 5 4321 \nThis publication is designed to provide accurate and authoritative \ninformation in regard to the subject matter covered. It is sold with the understanding \nthat the publisher is not engaged in rendering legal, accounting, or \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 4,
      "text": "other professional service. If legal advice or other expert assistance is required, \nthe services of a competent professional person should be sought. \n. . . From the Declaration of Principles jointly adopted by a \nCommittee of the American Bar Association and a Committee \nof Publishers and Associations. \nISBN D-73SE-DmM-7 \nATTENTION: CORPORATIONS AND SCHOOLS \nPrentice Hall books are available at quantity discounts with bulk purchase for educational, \nbusiness, or sales promotional use. For information, please write to: Prentice Hall, \nSpecial Sales, 240 Frisch Court, Paramus, N] 07652. Please supply: title of book, ISBN, \nquantity, how the book will be used, date needed. \nNEW YORK INSTITUTE OF FINANCE \nAn Imprint of Prentice Hall Press \nParamus, NJ 07652 \nhttp://www.phdirect.com \nNYIF and NEW YORK INSTITUTE OF FINANCE are trademarks of Executive \nTax Reports, Inc. used under license by Prentice Hall Direct, Inc. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 5,
      "text": " \n \n \n \n \n \n \n \n \nDEDICATION \n \nThis book is dedicated to all of the traders I have had the pleasure of working with over the last 18 \nyears as a trading coach. Each of you in your own unique way is a part of the insight and guidance this \nbook will provide to those who choose to trade from a confident, disciplined, and consistent state of \nmind. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 6,
      "text": " \n \n \n \n \n \n \n \n \n \n \n \no \nTABLE OF CONTENTS \n \nFOREWORD . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . xi \nPREFACE . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . xm \nATTITUDE SURVEY . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . xvii \n \n \n_________________CHAPTER 1___________ \nTHE ROAD TO SUCCESS: \nFUNDAMENTAL, TECHNICAL, \nOR MENTAL ANALYSIS? \n \nIN THE BEGINNING: FUNDAMENTAL ANALYSIS . . . . . . . . . . 1 \nTHE SHIFT TO TECHNICAL ANALYSIS . . . . . . . . . . . . . . . . . 3 \nTHE SHIFT TO MENTAL ANALYSIS . . . . . . . . . . . . . . . . . . . 4 \n \n_____________________CHAPTER 2_______________ \nTHE LURE (AND THE DANGERS) \nOF TRADING \n \nTHE ATTRACTION . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 17 \nTHE DANGERS . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 20 \nTHE SAFEGUARDS. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 25 \nProblem: The Unwillingness to Create Rules. . . . . . . 27 \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 7,
      "text": "Problem: Failure to Take Responsibility . . . . . . . . . . 28 \nProblem: Addiction to Random Rewards . . . . . . . . . 30 \nProblem: External versus Internal Control........ 31 \n \n_______________CHAPTER 3______________ \nTAKING RESPONSIBILITY \n \nSHAPING YOUR MENTAL ENVIRONMENT. . . . . . . . . . . . . . . 34 \nREACTING TO LOSS . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 38 \nWINNERS, LOSERS, BOOMERS, AND BUSTERS . . . . . . . . . . 50 \n \n___________CHAPTER 4_______________ \nCONSISTENCY: A STATE OF MIND \n \nTHINKING ABOUT TRADING . . . . . . . . . . . . . . . . . . . . . . . . 58 \nREALLY UNDERSTANDING RISK. . . . . . . . . . . . . . . . . . . . . . 61 \nALIGNING YOUR MENTAL ENVIRONMENT . . . . . . . . . . . . . . 64 \n \n___________CHAPTER 5________________ \nTHE DYNAMICS OF PERCEPTION \n \nDEBUGGING YOUR MENTAL SOFTWARE . . . . . . . . . . . . . . . 70 \nPERCEPTION AND LEARNING . . . . . . . . . . . . . . . . . . . . . . . 74 \nPERCEPTION AND RISK . . . . . . . . . . . . . . . . . . . . . . . . . . . . 79 \nTHE POWER OF ASSOCIATION. . . . . . . . . . . . . . . . . . . . . . . 80 \n \n \n___________CHAPTER 6_____________ \nTHE MARKET'S PERSPECTIVE \n \nTHE \"UNCERTAINTY\" PRINCIPLE . . . . . . . . . . . . . . . . . . . . 88 \nTHE MARKET'S MOST FUNDAMENTAL CHARACTERISTIC. .. 93 \n \n \n \n \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 8,
      "text": "_____________CHAPTER 7__________ \nTHE TRADER'S EDGE: THINKING IN PROBABILITIES \n \nPROBABILITIES PARADOX: RANDOM OUTCOME, CONSISTENT RESULTS. . . . 102 \nTRADING IN THE MOMENT. . . . . . . . . . . . . . . . . . . . . . . . . 106 \nMANAGING EXPECTATIONS . . . . . . . . . . . . . . . . . . . . . . . . . 113 \nELIMINATING THE EMOTIONAL RISK . . . . . . . . . . . . . . . . . 120 \n \n_______ CHAPTER 8__________ \nWORKING WITH YOUR BELIEFS \n \nDEFINING THE PROBLEM . . . . . . . . . . . . . . . . . . . . . . . . . . 125 \nDEFINING THE TERMS . . . . . . . . . . . . . . . . . . . . . . . . . . . . 128 \nHOW THE FUNDAMENTAL TRUTHS RELATE TO THE SKILLS . . . . . . . . . . . . . . . . . . . 130 \nMOVING TOWARD \"THE ZONE\". . . . . . . . . . . . . . . . . . . . . . 135 \n \n___________CHAPTER 9_________________ \nTHE NATURE OF BELIEFS \n \nTHE ORIGINS OF A BELIEF. . . . . . . . . . . . . . . . . . . . . . . . . 139 \nBELIEFS AND THEIR IMPACT ON OUR LIVES . . . . . . . . . . . 142 \nBELIEFS vs. THE TRUTH. . . . . . . . . . . . . . . . . . . . . . . . . . . 147 \n \n________CHAPTER 10__________ \nTHE IMPACT OF BELIEFS ON TRADING \n \nTHE PRIMARY CHARACTERISTICS OF A BELIEF . . . . . . . . . . 153 \nSELF-EVALUATION AND TRADING . . . . . . . . . . . . . . . . . . . . 167 \n \n__________CHAPTER 11___________ \nTHINKING LIKE A TRADER \n \nTHE MECHANICAL STAGE. . . . . . . . . . . . . . . . . . . . . . . . . . 173 \nTHE ROLE OF SELF-DISCIPLINE. . . . . . . . . . . . . . . . . . . . . 179 \nCREATING A BELIEF IN CONSISTENCY . . . . . . . . . . . . . . . . 184 \nEXERCISE: LEARNING TO TRADE AND EDGE LIKE A \nCASINO . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 189 \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 9,
      "text": "A FINAL NOTE . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 201 \nATTITUDE SURVEY . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 203 \nINDEX . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 209 \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 10,
      "text": " \nFOREWORD \n \nThe great bull market in stocks has led to an equally great bull market in the number of books \npublished on the subject of how to make money trading the markets. Many ideas abound, some good, \nsome not, some original, some just a repackaging of earlier works. Occasionally, though, a writer \ncomes forward with something that really sets him or her apart from the pack, something special. One \nsuch writer is Mark Douglas. Mark Douglas, in Trading in the Zone, has written a book that is the \naccumulation of years of thought and research—the work of a lifetime—and for those of us who view \ntrading as a profession, he has produced a gem. \nTrading in the Zone is an in-depth look at the challenges that we face when we take up the challenge of \ntrading. To the novice, the only challenge appears to be to find a way to make money. Once the novice \nlearns that tips, brokers' advice, and other ways to justify buying or selling do not work consistently, he \ndiscovers that he either needs to develop a reliable trading strategy or purchase one. After that, trading \nshould be easy, right? All you have to do is follow the rules, and the money will fall into your lap. \nAt this point, if not before, novices discover that trading can turn into one of the most frustrating \nexperiences they will ever face. \nThis experience leads to the oft-started statistic that 95 percent of futures traders lose all of their money \nwithin the first year of trading. Stock traders generally experience the same results, which is why \npundits always point to the fact that most stock traders fail to outperform a simple buy and hold \ninvestment scenario.  \nSo, why do people, the majority of whom are extremely successful in other occupations, fail so \nmiserably as traders? Are successful traders born and not made? Mark Douglas says no. What's \nnecessary, he says, is that the individual acquire the trader's mindset. It sounds easy, but the fact is, this \nmindset is very foreign when compared with the way our life experiences teach us to think about the \nworld. \nThat 95-percent failure rate makes sense when you consider how most of us experience life, using \nskills learned as we grow. When it comes to trading, however, it turns out that the skills we learn to \nearn high marks in school, advance our careers, and create relationships with other people, the skills we \nare taught that should carry us through life, turn out to be inappropriate for trading. Traders, we find \nout, must learn to think in terms of probabilities and to surrender all of the skills we have acquired to \nachieve in virtually every other aspect of our lives. In Trading in the Zone, Mark Douglas teaches us \nhow. He has put together a very valuable book. His sources are his own personal experiences as a \ntrader, a traders coach in Chicago, author, and lecturer in his field of trading psychology. \nMy recommendation? Enjoy Douglas's Trading in the Zone and, in doing so, develop a trader's \nmindset. \n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 11,
      "text": " \n \n \nPREFACE \n \n \nThe goal of any trader is to turn profits on a regular basis, yet so few people ever really make consistent \nmoney as traders. What accounts for the small percentage of traders who are consistently successful? \nTo me, the determining factor is psychological—the consistent winners think differently from everyone \nelse.I started trading in 1978. At the time, I was managing a commercial casualty insurance agency in \nthe suburbs of Detroit, Michigan. I had a very successful career and thought I could easily transfer that \nsuccess into trading. Unfortunately, I found that was not the case.  \nBy 1981, I was thoroughly disgusted with my inability to trade effectively while holding another job, \nso I moved to Chicago and got a job as a broker with Merrill Lynch at the Chicago Board of Trade. \nHow did I do? Well, within nine months of moving to Chicago, I had lost nearly everything I owned. \nMy losses were the result of both my trading activities and my exorbitant life style, which demanded \nthat I make a lot of money as a trader. From these early experiences as a trader, I learned an enormous \namount about myself, and about the role of psychology in trading. As a result, in 1982, I started \nworking on my first book, The Disciplined Trader: Developing Winning Attitudes.  \nWhen I began this project I had no concept of how difficult it was to write a book or explain something \nthat I understood for myself in a manner and form that would be useful to other people. I thought it was \ngoing to take me between six and nine months to get the job done. It took seven and a half years and \nwas finally published by Prentice Hall in 1990. In 1983, I left Merrill Lynch to start a consulting firm, \nTrading Behavior Dynamics, where I presently develop and conduct seminars on trading psychology \nand act in the capacity of what is commonly referred to as a trading coach. I've done countless \npresentations for trading companies, clearing firms, brokerage houses, banks, and investment \nconferences all over the world.  \nI've worked at a personal level, one on one, with virtually every type of trader in the business, including \nsome of the biggest floor traders, hedgers, option specialists, and CTAs, as well as neophytes As of this \nwriting, I have spent the last seventeen years dissecting the psychological dynamics behind trading so \nthat I could develop effective methods for teaching the proper principles of success. \nWhat I've discovered is that, at the most fundamental level, there is a problem with the way we think. \nThere is something inherent in the way our minds work that doesn't fit very well with the \ncharacteristics shown by the markets. Those traders who have confidence in their own trades, who trust \nthemselves to do what needs to be done without hesitation, are the ones who become successful. They \nno longer fear the erratic behavior of the market. They learn to focus on the information that helps them \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 12,
      "text": "spot opportunities to make a profit, rather than focusing on the information that reinforces their fears. \nWhile this may sound complicated, it all boils down to learning to believe that: (1) you don't need to \nknow what's going to happen next to make money; (2) anything can happen; and (3) every moment is \nunique, meaning every edge and outcome is truly a unique experience. The trade either works or it \ndoesn't. In any case, you wait for the next edge to appear and go through the process again and again. \nWith this approach you will learn in a methodical, non-random fashion what works and what doesn't. \nAnd, just as important, you will build a sense of self-trust so that you won't damage yourself in an \nenvironment that has the unlimited qualities the markets have. \nMost traders don't believe that their trading problems are the result of the way they think about trading \nor, more specifically, how they are thinking while they are trading. In my first book, The Disciplined \nTrader, I identified the problems confronting the trader from a mental perspective and then built a \nphilosophical framework for understanding the nature of these problems and why they exist.  \nI had five major objectives in mind in writing Trading in the Zone: \n \nTo prove to the trader that more or better market analysis is not the solution to his trading difficulties or \nlack of consistent results. \n \nTo convince the trader that it's his attitude and \"state of mind\" that determine his results. \n \nTo provide the trader with the specific beliefs and attitudes that are necessary to build a winner's \nmindset, which means learning how to think in probabilities. \n \nTo address the many conflicts, contradictions, and paradoxes in thinking that cause the typical trader to \nassume that he already does think in probabilities, when he really doesn't. \n \nTo take the trader through a process that integrates this thinking strategy into his mental system at a \nfunctional level. \n \n(Note: Until recently, most traders were men, but I recognize that more and more women are joining \nthe ranks. In an effort to avoid confusion and awkward phrasing, I have consistently used the pronoun \n\"he\" throughout this book in describing traders. This certainly does not reflect any bias on my part.) \n \nTrading in the Zone presents a serious psychological approach to becoming a consistent winner in your \ntrading. I do not offer a trading system; I am more interested in showing you how to think in the way \nnecessary to become a profitable trader. I assume that you already have your own system, your own \nedge. You must learn to trust your edge. The edge means there is a higher probability of one outcome \nthan another. The greater your confidence, the easier it will be to execute your trades. This book is \n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 13,
      "text": "designed to give you the insight and understanding you need about yourself and the nature of trading, \nso that actually doing it becomes as easy, simple, and stressfree as when you're just watching the \nmarket and thinking about doing it. \nIn order to determine how well you \"think like a trader,\" take the following Attitude Survey. There are \nno right or wrong answers.  \nYour answers are an indication of how consistent your current mental framework is with the way you \nneed to think in order to get the most out of your trading. \n \n \nATTITUDE SURVEY \n \n1. To make money as a trader you have to know what the market is going to do next. \nAgree Disagree \n \n2. Sometimes I find myself thinking that there must be a way to trade without having to take a loss. \nAgree Disagree \n \n3. Making money as a trader is primarily a function of analysis. \nAgree Disagree \n \n4. Losses are an unavoidable component of trading. \nAgree Disagree \n \n5. My risk is always defined before I enter a trade. \nAgree Disagree \n \n6. In my mind there is always a cost associated with finding out what the market may do next. \nAgree Disagree \n \n7. I wouldn't even bother putting on the next trade if I wasn't sure that it was going to be a winner. \nAgree Disagree \n \n8. The more a trader learns about the markets and how they behave, the easier it will be for him to \nexecute his trades. \nAgree Disagree \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 14,
      "text": "9. My methodology tells me exactly under what market conditions to either enter or exit a trade. \nAgree Disagree \n \n10. Even when I have a clear signal to reverse my position, I find it extremely difficult to do. \nAgree Disagree \n \n11. I have sustained periods of consistent success usually followed by some fairly drastic draw-downs \nin my equity. \nAgree Disagree \n \n \n \n12. When I first started trading I would describe my trading methodology as haphazard, meaning some \nsuccess in between a lot of pain. \nAgree Disagree \n \n13. I often find myself feeling that the markets are against me personally. \nAgree Disagree \n \n14. As much as I might try to \"let go,\" I find it very difficult to put past emotional wounds behind me. \nAgree Disagree \n \n15. I have a money management philosophy that is founded in the principle of always taking some \nmoney out of the market when the market makes it available. \nAgree Disagree \n \n16. A trader's job is to identify patterns in the markets' behavior that represent an opportunity and then \nto determine the risk of finding out if these patterns will play themselves out as they have in the past. \nAgree Disagree \n \n17. Sometimes I just can't help feeling that I am a victim of the market. \nAgree Disagree \n \n18. When I trade I usually try to stay focused in one time frame. \nAgree Disagree \n \n19. Trading successfully requires a degree of mental flexibility far beyond the scope of most people. \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 15,
      "text": "Agree Disagree \n \n20. There are times when I can definitely feel the flow of the market; however, I often have difficulty \nacting on these feelings. \nAgree Disagree \n \n21. There are many times when I am in a profitable trade and I know the move is basically over, but I \nstill won't take my profits. \nAgree Disagree \n \n22. No matter how much money I make in a trade, I am rarely ever satisfied and feel that I could have \nmade more. \nAgree Disagree \n \n \n23. When I put on a trade, I feel I have a positive attitude. I anticipate all of the money I could make \nfrom the trade in a positive way. \nAgree Disagree \n \n24. The most important component in a trader's ability to accumulate money over time is having a \nbelief in his own consistency. \nAgree Disagree \n \n25. If you were granted a wish to be able to instantaneously acquire one trading skill, what skill would \nyou choose? \n \n26. I often spend sleepless nights worrying about the market. \nAgree Disagree \n \n27. Do you ever feel compelled to make a trade because you are afraid that you might miss out? \nYes No \n \n28. Although it doesn't happen veiy often, I really like my trades to be perfect. When I make a perfect \ncall it feels so good that it makes up for all of the times that I don't. \nAgree Disagree \n \n29. Do you ever find yourself planning trades you never execute, and executing trades you never \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 16,
      "text": "planned? \nYes No \n \n30. In a few sentences explain why most traders either don't make money or aren't able to keep what \nthey make. \n \n \n \n \n \n \n \n \n \n \n \n \n \nSet aside your answers as you read through this book. Afte you've finished the last chapter (\"Thinking \nLike a Trader\"), take the Attitude Survey again—it s reprinted at the back of the book. You may be \nsurprised to see how much your answers differ from the first time. \n \n \nACKNOWLEDGMENTS \n \nI would especially like to thank all of the traders who bought the signed limited edition manuscript of  \nthe first seven chapters of this book. Your feedback gave me the inspiration to add the additional four \nchapters. \nNext, I would like to thank fellow traders Robert St. John, Greg Bieber, Larry Pesavento, and Ted \nHearne for their friendship and the special ways in which each of them contributed to the development \nof this book. \nI would also like to acknowledge my friend, Eileen Bruno, for editing the original manuscript; and, at \nPrentice Hall, Ellen Schneid Coleman, Associate Publisher, for her professionalism and help in \nsmoothing the path to publication, and Barry Richardson, Development Editor, for his help in shaping \nthe introduction. His time and talent are greatly appreciated. \nCHAPTER 1 \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 18,
      "text": "Ultimately, the fundamental analyst could find that a prediction about where prices should be at some \npoint in the future is correct. But in the meantime, price movement could be so volatile that it would be \nvery difficult, if not impossible, to stay in a trade in order to realize the objective. \n \nTHE SHIFT TO TECHNICAL ANALYSIS \n \nTechnical analysis has been around for as long as there have been organized markets in the form of \nexchanges. But the trading community didn't accept technical analysis as a viable tool for making \nmoney until the late 1970s or early 1980s. Here's what the technical analyst knew that it took the \nmainstream market community generations to catch on to. \nA finite number of traders participate in the markets on any given day, week, or month. Many of these \ntraders do the same lands of things over and over in their attempt to make money. In other words, \nindividuals develop behavior patterns, and a group of individuals, interacting with one another on a \nconsistent basis, form collective behavior patterns. These behavior patterns are observable and \nquantifiable, and they repeat themselves with statistical reliability. Technical analysis is a method that \norganizes this collective behavior into identifiable patterns that can give a clear indication of when \nthere is a greater probability of one thing happening over another. In a sense, technical analysis allows \nyou to get into the mind of the market to anticipate what's likely to happen next, based on the kind of \npatterns the market generated at some previous moment.  \nAs a method for projecting future price movement, technical analysis has turned out to be far superior \nto a purely fundamental approach. It keeps the trader focused on what the market is doing now in \nrelation to what it has done in the past, instead of focusing on what the market should be doing based \nsolely on what is logical and reasonable as determined by a mathematical model. On the other hand, \nfundamental analysis creates what I call a \"reality gap\" between \"what should be\" and \"what is.\" The \nreality gap makes it extremely difficult to make anything but very long-term predictions that can be \ndifficult to exploit, even if they are correct. \nIn contrast, technical analysis not only closes this reality gap, but also makes available to the trader a \nvirtually unlimited number of possibilities to take advantage of. The technical approach opens up many \nmore possibilities because it identifies how the same repeatable behavior patterns occur in every time \nframe—moment-tomoment, daily, weekly, yearly, and every time span in between. In other words, \ntechnical analysis turns the market into an endless stream of opportunities to enrich oneself. \n \nTHE SHIFT TO MENTAL ANALYSIS \n \nIf technical analysis works so well, why would more and more of the trading community shift their \nfocus from technical analysis of the market to mental analysis of themselves, meaning their own \nindividual trading psychology? To answer this question, you probably don't have to do anything more \n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 19,
      "text": "than ask yourself why you bought this book. The most likely reason is that you're dissatisfied with the \ndifference between what you perceive as the unlimited potential to make money and what you end up \nwith on the bottom line. That's the problem with technical analysis, if you want to call it a problem. \nOnce you learn to identify patterns and read the market, you find there are limitless opportunities to \nmake money. But, as I'm sure you already know, there can also be a huge gap between what you \nunderstand about the markets, and your ability to transform that knowledge into consistent profits or a \nsteadily rising equity curve. \nThink about the number of times you've looked at a price chart and said to yourself, \"Hmmm, it looks \nlike the market is going up (or down, as the case may be),\" and what you thought was going to happen \nactually happened. But you did nothing except watch the market move while you anguished over all the \nmoney you could have made. \nThere's a big difference between predicting that something will happen in the market (and thinking \nabout all the money you could have made) and the reality of actually getting into and out of trades. I \ncall this difference, and others like it, a \"psychological gap\" that can make trading one of the most \ndifficult endeavors you could choose to undertake and certainly one of the most mysterious to master. \nThe big question is: Can trading be mastered? Is it possible to experience trading with the same ease \nand simplicity implied when you are only watching the market and thinking about success, as opposed \nto actually having to put on and take off trades? Not only is the answer an unequivocal \"yes,\" but that's \nalso exactly what this book is designed to give you—the insight and understanding you need about \nyourself and about the nature of trading. So the result is that actually doing it becomes as easy, simple, \nand stress-free as when you are just watching the market and thinking about doing it. \nThis may seem like a tall order, and to some of you it may even seem impossible. But it's not. There are \npeople who have mastered the art of trading, who have closed the gap between the possibilities \navailable and their bottom-line performance. But as you might expect, these winners are relatively few \nin number compared with the number of traders who experience varying degrees of frustration, all the \nway to extreme exasperation, wondering why they can't create the consistent success they so \ndesperately desire. \nIn fact, the differences between these two groups of traders (the consistent winners and everyone else) \nare analogous to the differences between the Earth and the moon. The Earth and moon are both \ncelestial bodies that exist in the same solar system, so they do have something in common. But they are \nas different in nature and characteristics as night and day. By the same token, anyone who puts on a \ntrade can claim to be a trader, but when you compare the characteristics of the handful of consistent \nwinners with the characteristics of most other traders, you'll find they're also as different as night and \nday. \nIf going to the moon represents consistent success as a trader, we can say that getting to the moon is \npossible. The journey is extremely difficult and only a handful of people have made it. From our \nperspective here on Earth, the moon is usually visible every night and it seems so close that we could \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 21,
      "text": "disagreement with someone about something we both experienced. Other than our physical features, \nthe way we think is what makes us unique, probably even more unique than our physical features do. \nLet's get back to traders. What is different about die way the best traders think as opposed to how those \nwho are still struggling think? While the markets can be described as an arena of endless opportunities, \nthey simultaneously confront the individual with some of the most sustained, adverse psychological \nconditions you can expose yourself to. At some point, everyone who trades learns something about the \nmarkets that will indicate when opportunities exist. But learning how to identify an opportunity to buy \nor sell does not mean that you have learned to think like a trader. \nThe defining characteristic that separates the consistent winners from everyone else is this: The winners \nhave attained a mind-set—aunique set of attitudes—that allows them to remain disciplined, focused, \nand, above all, confident in spite of the adverse conditions. As a result, they are no longer susceptible to \nthe common fears and  trading errors that plague everyone else. Everyone who trades ends up learning \nsomething about the markets; very few people who trade ever learn the attitudes that are absolutely \nessential to becoming a consistent winner. Just as people can learn to perfect the proper technique for \nswinging a golf club or tennis racket, their consistency, or lack of it, will without a doubt come from \ntheir attitude Traders who make it beyond \"the threshold of consistency\" usually experience a great \ndeal of pain (both emotional and financial) before they acquire the land of attitude that allows them to \nfunction effectively in the market environment. The rare exceptions are usually those who were born \ninto successful trading families or who started their trading careers under the guidance of someone who \nunderstood the true nature of trading, and, just as important, knew how to teach it. \nWhy are emotional pain and financial disaster common among traders? The simple answer is that most \nof us weren't fortunate enough to start our trading careers with the proper guidance. \nHowever, the reasons go much deeper than this. I have spent the last seventeen years dissecting the \npsychological dynamics behind trading so that I could develop effective methods for teaching the \nprinciples of success. What I've discovered is that trading is chock full of paradoxes and contradictions \nin thinking that make it extremely difficult to learn how to be successful. In fact, if I had to choose one \nword that encapsulates the nature of trading, it would be \"paradox.\" \n(According to the dictionary, a paradox is something that seems to have contradictory qualities or that \nis contrary to common belief or what generally makes sense to people.) \nFinancial and emotional disaster are common among traders because many of the perspectives, \nattitudes, and principles that would otherwise make perfect sense and work quite well in our daily lives \nhave the opposite effect in the trading environment. They just don't work. Not knowing this, most \ntraders start their careers with a fundamental lack of understanding of what it means to be a trader, the \nskills that are involved, and the depth to which those skills need to be developed. \nHere is a prime example of what I am talking about: Trading is inherently risky. To my knowledge, no \ntrade has a guaranteed outcome; therefore, the possibility of being wrong and losing money is always \npresent. So when you put on a trade, can you consider yourself a risk-taker? Even though this may \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 22,
      "text": "sound like a trick question, it is not. \nThe logical answer to the question is, unequivocally, yes. If I engage in an activity that is inherently \nrisky, then I must be a risktaker. This is a perfectly reasonable assumption for any trader to make. In \nfact, not only do virtually all traders make this assumption, but most traders take pride in thinking of \nthemselves as risk-takers. The problem is that this assumption couldn't be further from the truth. Of \ncourse, any trader is taking a risk when you put on a trade, but that doesn't mean that you are \ncorrespondingly accepting that risk. In other words, all trades are risky because the outcomes are \nprobable—not guaranteed. But do most traders really believe they are taking a risk when they put on a \ntrade? Have they really accepted that the trade has a non-guaranteed, probable outcome? Furthermore, \nhave they fully accepted the possible consequences?  \nThe answer is, unequivocally, no! Most traders have absolutely no concept of what it means to be a \nrisk-taker in the way a successful trader thinks about risk. The best traders not only take the risk, they \nhave also learned to accept and embrace that risk. There is a huge psychological gap between assuming \nyou are a risk-taker because you put on trades and fully accepting the risks inherent in each trade. \nWhen you fully accept the risks, it will have profound implications on your bottom-line performance. \nThe best traders can put on a trade without the slightest bit of hesitation or conflict, and just as freely \nand without hesitation or conflict, admit it isn't working. They can get out of the trade—even with a \nloss—and doing so doesn't resonate the slightest bit of emotional discomfort. In other words, the risks \ninherent in trading do not cause the best traders to lose their discipline, focus, or sense of confidence. \nIf you are unable to trade without the slightest bit of emotional discomfort (specifically, fear), then you \nhave not learned how to accept the risks inherent in trading. This is a big problem, because to whatever \ndegree you haven't accepted the risk, is the same degree to which you will avoid the risk. Trying to \navoid something that is unavoidable will have disastrous effects on your ability to trade successfully. \nLearning to truly accept the risks in any endeavor can be difficult, but it is extremely difficult for \ntraders, especially considering what's at stake. What are we generally most afraid of (besides dying or \npublic speaking)? Certainly, losing money and being wrong both rank close to the top of the list. \nAdmitting we are wrong and losing money to boot can be extremely painful, and certainly something to \navoid. Yet as traders, we are confronted with these two possibilities virtually every moment we are in a \ntrade. Now, you might be saying to yourself, \"Apart from the fact that it hurts so much, it's natural to \nnot want to be wrong and lose something; therefore, it's appropriate for me to do whatever I can to \navoid it.\" I agree with you. But it is also this natural tendency that makes trading (which looks like it \nshould be easy) extremely difficult. \nTrading presents us with a fundamental paradox: How do we remain disciplined, focused, and \nconfident in the face of constant uncertainty? When you have learned how to \"think\" like a trader, that's \nexactly what you'll be able to do. Learning how to redefine your trading activities in a way that allows \nyou to completely accept the risk is the key to thinking like a successful trader. Learning to accept the \nrisk is a trading skill—the most important skill you can learn. Yet it's rare that developing traders focus \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 23,
      "text": "any attention or expend any effort to learn it. \nWhen you learn the trading skill of risk acceptance, the market will not be able to generate information \nthat you define or interpret as painful. If the information the market generates doesn't have the potential \nto cause you emotional pain, there's nothing to avoid. It is just information, telling you what the \npossibilities are. This is called an objective perspective—one that is not skewed or distorted by what \nyou are afraid is going to happen or not happen. \nI'm sure there isn't one trader reading this book who hasn't gotten into trades too soon—before the \nmarket has actually generated a signal, or too late—long after the market has generated a signal. What \ntrader hasn't convinced himself not to take a loss and, as a result, had it turn into a bigger one; or got \nout of winning trades too soon; or found himself in winning trades but didn't take any profits at all, and \nthen let the trades turn into losers; or moved stoplosses closer to his entry point, only to get stopped out \nand have the market go back in his direction? These are but a few of the many errors traders perpetuate \nupon themselves time and time again. These are not market-generated errors. That is, these errors do \nnot come from the market. The market is neutral, in the sense that it moves and generates information \nabout itself. Movement and information provide each of us with the opportunity to do something, but \nthat's all! The markets don't have any power over the unique way in which each of us perceives and \ninterprets this information, or control of the decisions and actions we take as a result. The errors I \nalready mentioned and many more are strictly the result of what I call \"faulty trading attitudes and \nperspectives.\" Faulty attitudes that foster fear instead of trust and confidence. \nI don't think I could put the difference between the consistent winners and everyone else more simply \nthan this: The best traders aren't afraid. They aren't afraid because they have developed attitudes that \ngive them the greatest degree of mental flexibility to flow in and out of trades based on what the market \nis telling them about the possibilities from its perspective. At the same time, the best traders have \ndeveloped attitudes that prevent them from getting reckless. Everyone else is afraid, to some degree or \nanother. When they're not afraid, they have the tendency to become reckless and to create the kind of \nexperience for themselves that will cause them to be afraid from that point on. \nNinety-five percent of the trading errors you are likely to make—causing the money to just evaporate \nbefore your eyes—will stem from your attitudes about being wrong, losing money, missing out, and \nleaving money on the table. What I call the four primary trading fears. \nNow, you may be saying to yourself, \"I don't know about this: I've always thought traders should have \na healthy fear of the markets.\" Again, this is a perfectly logical and reasonable assumption. But when it \ncomes to trading, your fears will act against you in such a way that you will cause the very thing you \nare afraid of to actually happen. If you're afraid of being wrong, your fear will act upon your perception \nof market information in a way that will cause you to do something that ends up making you wrong. \nWhen you are fearful, no other possibilities exist. You can't perceive other possibilities or act on them \nproperly, even if you did manage to perceive them, because fear is immobilizing. Physically, it causes \nus to freeze or run. Mentally, it causes us to narrow our focus of attention to the object of our fear. This \n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 25,
      "text": "hard, cold reality of trading is that every trade has an uncertain outcome. Unless you learn to \ncompletely accept the possibility of an uncertain outcome, you will try either consciously or \nunconsciously to avoid any possibility you define as painful. In the process, you will subject yourself to \nany number of self-generated, costly errors. \nNow, I am not suggesting that we don't need some form of market analysis or methodology to define \nopportunities and allow us to recognize them; we certainly do. However, market analysis is not the path \nto consistent results. It will not solve the trading problems created by lack of confidence, lack of \ndiscipline, or improper focus. When you operate from the assumption that more or better analysis will \ncreate consistency, you will be driven to gather as many market variables as possible into your arsenal \nof trading tools. But what happens then? You are still disappointed and betrayed by the markets, time \nand again, because of something you didn't see or give enough consideration to. It will feel like you \ncan't trust the markets; but the reality is, you can't trust yourself. \nConfidence and fear are contradictory states of mind that both stem from our beliefs and attitudes. To \nbe confident, functioning in an environment where you can easily lose more than you intend to risk, \nrequires absolute trust in yourself. However, you won't be able to achieve that trust until you have \ntrained your mind to override your natural inclination to think in ways that are counterproductive to \nbeing a consistently successful trader. Learning how to analyze the market's behavior is simply not the \nappropriate training. You have two choices: You can try to eliminate risk by learning about as many \nmarket variables as possible. (I call this the black hole nf analv<!i<: bpoanif* it is fhp nafh nf ultimate \nfrustration.) Or you can learn how to redefine your trading activities in such a way that you truly accept \nthe risk, and you're no longer afraid.  \nWhen you've achieved a state of mind where you truly accept the risk, you won't have the potential to \ndefine and interpret market information in painful ways. When you eliminate the potential to define \nmarket information in painful ways, you also eliminate the tendency to rationalize, hesitate, jump the \ngun, hope that the market will give you money, or hope that the market will save you from your \ninability to cut your losses. \nAs long as you are susceptible to the lands of errors that are the result of rationalizing, justifying, \nhesitating, hoping, and jumping the gun, you will not be able to trust yourself. If you can't trust yourself \nto be objective and to always act in your own best interests, achieving consistent results will be next to \nimpossible. Trying to do something that looks so simple may well be the most exasperating thing you \nwill ever attempt to do. The irony is that, when you have the appropriate attitude, when you have \nacquired a \"trader s mind-set\" and can remain confident in the face of constant uncertainty, trading will \nbe as easy and simple as you probably thought it was when you first started out. \nSo, what is the solution? You will need to learn how to adjust your attitudes and beliefs about trading in \nsuch a way that you can trade without the slightest bit of fear, but at the same time keep a framework in \nplace that does not allow you to become reckless. That's exactly what this book is designed to teach \nyou. As you move ahead, I would like you to keep something in mind. \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 29,
      "text": "guidance the force of natural attractions. \nNatural attractions are simply those things about which we feel a natural or passionate interest. Ours is \na big and diverse world, and it offers each of us a great deal to learn about and experience. But that \ndoesn't mean each of us has a natural or passionate interest in learning about or experiencing all there \nis. There's some internal mechanism that makes us \"naturally selective.\" \nIf you think about it, I'm sure you could list many things to do or be that you have absolutely no \ninterest in. I know I could. You could also make another list of the things you are only marginally \ninterested in. Finally, you could list everything you have a passionate interest in. Of course, the lists get \nsmaller as the interest levels rise. Where does passionate interest come from? My personal view is that \nit comes from the deepest level of our being—at the level of our true identity. It comes from the part of \nus that exists beyond the characteristics and personality traits we acquire as a result of our social \nupbringing. \n \nTHE DANGERS \n \nIt is at the deepest level of our being that the potential for conflict exists.The social structure that we're \nborn into may or may not be sensitive to these inner-directed needs and interests. For example, you \nmay have been born into a family of extremely competitive athletes, but feel a passionate interest in \nclassical music or art. You may even have natural athletic ability, but no real interest in participating in \nathletic events. Is there any potential for conflict here? \nIn a typical family, most members would put a great deal of pressure on you to follow in the footsteps \nof your brothers, sisters, or parents. They do everything possible to teach you their ways and how to get \nthe most out of your athletic ability. They discourage you from seriously pursuing any other interests. \nYou go along with what they want, because you don't want to be ostracized, but at the same time, doing \nwhat they want you to do just doesn't feel right, although everything you've learned and been taught \nargues in favor of becoming an athlete. The problem is, it doesn't feel like who you are. \nThe conflicts that result from what we're taught about who we're supposed to be and the feeling that \nresonates at the deepest levels of our being is not at all uncommon. I would say that many, if not most \npeople, grow up in a family and cultural environment that gives little, if any, objective, nonjudgmental \nsupport to the unique ways in which we feel compelled to express ourselves. This lack of support is not \nsimply an absence of encouragement. It can be as deep as the outright denial of some particular way in \nwhich we want to express ourselves. For example, let's look at a common situation: A toddler, who for \nthe first time in his life, notices \"this thing,\" which we call a vase, on the coffee table. He is curious, \nwhich means there's an inner force that's compelling him to experience this object. In a sense, it's as if \nthis force creates a vacuum in his mind that has to be filled with the object of his interest. So, he \nfocuses on the vase, and, with deliberate intent, crawls across the vast expanse of the living room floor \nto the coffee table. When he gets there, he reaches up to the edge of the table to pull himself to his feet. \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 30,
      "text": "With one hand firmly on the table to maintain his balance, his other hand reaches out to touch this thing \nhe has never experienced. Just at that moment, he hears a scream from across the room, \"NO! DON'T \nTOUCH THAT!\" \nStartled, the child falls back on his butt, and begins to cry. Obviously, this is a very common \noccurrence and one that is completely unavoidable. Children have absolutely no concept of how they \ncan injure themselves or how valuable something like a vase can be. In fact, learning what is safe and \nwhat isn't and the value of things are important lessons the child must learn. However, there are some \nextremely important psychological dynamics at work here that have a direct effect on our ability to \ncreate the kind of discipline and focus necessary to trade effectively later in life. \nWhat happens when we're denied the opportunity to express ourselves in the way we want to, or we're \nforced to express ourselves in a way that doesn't correspond with the natural selection process?  \nThe experience creates an upset. Being \"up-set\" implies an imbalance. But what exactly is out of \nbalance? For something to be out of balance, there has to be something that's in balance or in equal \nproportion in the first place. That something is the relative degree of correspondence that exists \nbetween our inner, mental environment and the exterior environment where we experience our lives. In \nother words, our needs and desires are generated in our mental environment, and they are fulfilled in \nthe exterior environment . If these two environments are in correspondence with one another, we're in a \nstate of inner balance and we feel a sense of satisfaction or happiness. If these environments are not in \ncorrespondence, we experience dissatisfaction, anger, and frustration, or what is commonly referred to \nas emotional pain. \nNow, why would not getting what we want or being denied the freedom to express ourselves in some \nparticular way cause us to experience emotional pain? My personal theory is that needs and desires \ncreate mental vacuums. The universe in which we live has a natural tendency to not tolerate a vacuum \nand moves to fill it, whenever one exists. (The philosopher Spinoza observed centuries ago that, \n\"Nature abhors a vacuum.\") \nSuck the air out of a bottle and your tongue and lips will stick to the mouth of the bottle, because you \nhave created an imbalance (a vacuum), which now must be filled. What are the dynamics behind the \nexpression \"Necessity is the mother of all invention\"? The recognition that a need creates a mental \nvacuum that the universe will fill with inspiring thoughts (if your mind is receptive). The thoughts, in \nturn, can inspire movement and expression that result in the fulfillment of that need. \nIn this respect, I think our mental environment works like the universe at large. Once we recognize a \nneed or desire, we move to fill the vacuum with an experience in the exterior environment. If we are \ndenied the opportunity to pursue the object of this need or desire, it literally feels as if we are not \nwhole, or that something is missing, which puts us into a state of imbalance or emotional pain. (Do our \nminds also abhor a vacuum, once one has been created?) Take a toy away from a child who is not \nfinished playing with it (regardless of how good your reasons may be for doing so) and the universal \nresponse will be emotional pain.  \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 32,
      "text": "young or didn't get it when it was important to them. In any case, the deprivation becomes unresolved \nemotional energy that compels them to behave in ways that will satisfy the addiction. What's important \nfor us to understand about these unreconciled, denied impulses (that exist in all of us) is how they \naffect our ability to stay focused and take a disciplined, consistent approach to our trading.  \n \nTHE SAFEGUARDS \n \nTo operate effectively in the trading environment, we need rules and boundaries to guide our behavior. \nIt is a simple fact of trading that the potential exists to do enormous damage to ourselves—damage that \ncan be way out of proportion to what we may think is possible. There are many kinds of trades in \nwhich the risk of loss is unlimited.  \nTo prevent the possibility of exposing ourselves to damage, we need to create an internal structure in \nthe form of specialized mental discipline and a perspective that guides our behavior so that we always \nact in our own best interests. This structure has to exist within each of us, because unlike society, the \nmarket doesn't provide it. The markets provide structure in the form of behavior patterns that indicate \nwhen an opportunity to buy or sell exists. But that's where the structure ends—with a simple indication. \nOtherwise, from each individual's perspective, there are no formalized rules to guide your behavior. \nThere aren't even any beginnings, middles, or endings as there are in virtually every other activity we \nparticipate in. \nThis is an extremely important distinction with profound psychological implications. The market is like \na stream that is in constant motion. It doesn't start, stop, or wait. Even when the markets are closed, \nprices are still in motion. There is no rule that the opening price on any day must be the same as the \nclosing price the day before. Nothing we do in society properly prepares us to function effectively in \nsuch a \"boundary-less\" environment. Even gambling games have built-in structures that make them \nmuch different from trading, and a lot less dangerous. For example, if we decide to play blackjack, the \nfirst thing we have to do is decide how much we are going to wager or risk. This is a choice we are \nforced to make by the rules of the game. If we don't make the choice, we don't get to play. \nIn trading, no one (except yourself) is going to force you to decide in advance what your risk is. In fact, \nwhat we have is a limitless environment, where virtually anything can happen at any moment and only \nthe consistent winners define their risk in advance of putting on a trade. For everyone else, defining the \nrisk in advance would force you to confront the reality that each trade has a probable outcome, meaning \nthat it could be a loser. Consistent losers do almost anything to avoid accepting the reality that, no \nmatter how good a trade looks, it could lose. Without the presence of an external structure forcing the \ntypical trader to think otherwise, he is susceptible to any number of justifications, rationalizations, and \nthe kind of distorted logic that will allow him to get into a trade believing that it can't lose, which \nmakes determining the risk in advance irrelevant. \nAll gambling games have specified beginnings, middles, and endings, based on a sequence of events \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 33,
      "text": "that determine the outcome of the game. Once you decide you are going to participate, you can't change \nyour mind—you're in for the duration. That's not true of trading. In trading, prices are in constant \nmotion, nothing begins until you decide it should, it lasts as long as you want, and it doesn't end until \nyou want it to be over. Regardless of what you may have planned or wanted to do, any number of \npsychological factors can come into play, causing you to become distracted, change your mind, become \nscared or overconfident: in other words, causing you to behave in ways that are erratic and unintended. \nBecause gambling games have a formal ending, they force the participant to be an active loser. If you're \non a losing streak, you can't keep on losing without making a conscious decision to do so. The end of \neach game causes the beginning of a new game, and you have to actively subject more of your assets to \nfurther risk by reaching into your wallet or pushing some chips to the center of the table. \nTrading has no formal ending. The market will not take you out of a trade. Unless you have the  \nappropriate mental structure to end a trade in a manner that is always in your best interest, you can \nbecome a passive loser. This means that, once you're in a losing trade, you don't have to do anything to \nkeep on losing. You don't even have to watch. You can just ignore the situation, and the market will \ntake everything you own—and more. \nOne of the many contradictions of trading is that it offers a gift and a curse at the same time. The gift is \nthat, perhaps for the first time in our lives, we're in complete control of everything we do. The curse is \nthat there are no external rules or boundaries to guide or structure our behavior. The unlimited \ncharacteristics of the trading environment require that we act with some degree of restraint and self-\ncontrol, at least if we want to create some measure of consistent success. The structure we need to \nguide our behavior has to originate in your mind, as a conscious act of free will. This is where the many \nproblems begin. \n \nPROBLEM: The willingness to Create Rules \n \nI have not yet encountered a person interested in trading who didn't resist the notion of creating a set of \nrules. The resistance isn't always overt. Quite the contrary, it's usually very subtle. We agree on the one \nhand that rules make sense, but we really have no intention of doing whatever is being suggested. This \nresistance can be intense, and it has a logical source. \nMost of the structure in our minds was given to us as a result of our social upbringing and based on \nchoices made by other people. In other words, it was instilled in our minds, but did not originate in our \nminds. This is a very important distinction. In the process of instilling structure, many of our natural \nimpulses to move, express, and learn about the nature of our existence through our own direct \nexperience were denied. Many of these denied impulses were never reconciled and still exist inside of \nus as frustration, anger, disappointment, guilt, or even hatred. The accumulation of these negative \nfeelings acts as a force inside our mental environment causing us to resist anything that denies us the \nfreedom to do and be whatever we want, when we want. \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 34,
      "text": "In other words, the very reason we are attracted to trading in the first place—the unlimited freedom of \ncreative expression—is the same reason we feel a natural resistance to creating the kinds of rules and \nboundaries that can appropriately guide our behavior. It's as if we have found a Utopia in which there is \ncomplete freedom, and then someone taps us on the shoulder and says, \"Hey, you have to create rules, \nand not only that, you also have to have the discipline to abide by them.\" \nThe need for rules may make perfect sense, but it can be difficult to generate the motivation to create \nthese rules when we've been trying to break free of them most of our lives. It usually takes a great deal \nof pain and suffering to break down the source of our resistance to establishing and abiding by a trading \nregime that is organized, consistent, and reflects prudent money-management guidelines. Now, I'm not \nimplying that you have to reconcile all of your past frustrations and disappointments to become a \nsuccessful trader, because that's not the case. And you certainly don't have to suffer.  \nI've worked with many traders who have achieved their objectives of consistency and haven't done \nanything to reconcile their backlog of denied impulses. However, I am implying that you can't take for \ngranted how much effort and focus you may have to put into building the kind of mental structure that \ncompensates for the negative effect denied impulses can have on your ability to establish the skills that \nwill assure your success as a trader. \n \nPROBLEM: Failure to Take Responsibility \n \nTrading can be characterized as a pure, unencumbered personal choice with an immediate outcome. \nRemember, nothing happens until we decide to start; it lasts as long as we want; and it doesn't end until \nwe decide to stop. All of these beginnings, middles, and endings are the result of our interpretation of \nthe information available and how we choose to act on our interpretation. Now, we may want the \nfreedom to make choices, but that doesn't mean we are ready and willing to accept the responsibility \nfor the outcomes. Traders who are not ready to accept responsibility for the outcomes of their \ninterpretations and actions will find themselves in a dilemma: How does one participate in an activity \nthat allows complete freedom of choice, and at the same time avoid taking responsibility if the outcome \nof one's choices are unexpected and not to one's liking? \nThe hard reality of trading is that, if you want to create consistency, you have to start from the premise \nthat no matter what the outcome, you are completely responsible. This is a level of responsibility few \npeople have aspired to before they decide to become traders. The way to avoid responsibility is to adopt \na trading style that is, to all intents and purposes, random. I define random trading as poorly-planned \ntrades or trades that are not planned at all. It is an unorganized approach that takes into consideration an \nunlimited set of market variables, which do not allow you to find out what works on a consistent basis \nand what does not. \nRandomness is unstructured freedom without responsibility. \nWhen we trade without well-defined plans and with an unlimited set of variables, it's very easy to take \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 35,
      "text": "credit for the trades that turn out to our liking (because there was \"some\" method present). At the same \ntime, it's veiy easy to avoid taking responsibility for the trades that didn't turn out the way we wanted \n(because there's always some variable we didn't know about and therefore couldn't take into \nconsideration beforehand). If the markets behavior were truly random, then it would be difficult if not \nimpossible to create consistency. If it's impossible to be consistent, then we really don't have to take \nresponsibility. The problem with this logic is that our direct experience of the markets tells us \nsomething different. The same behavior patterns present themselves over and over again. Even though \nthe outcome of each individual pattern is random, the outcome of a series of patterns is consistent \n(statistically reliable). This is a paradox, but one that is easily resolved with a disciplined, organized, \nand consistent approach. \nI've worked with countless traders who would spend hours doing market analysis and planning trades \nfor the next day Then, instead of putting on the trades they planned, they did something else. The trades \nthey did put on were usually ideas from friends or tips from brokers. I probably don't have to tell you \nthat the trades they originally planned, but didn't act on, were usually the big winners of the day.  \nThis is a classic example of how we become susceptible to unstructured, random trading—because we \nwant to avoid responsibility. When we act on our own ideas, we put our creative abilities on the line \nand we get instant feedback on how well our ideas worked. It's very difficult to rationalize away any \nunsatisfactory results. On the other hand, when we enter an unplanned, random trade, it's much easier \nto shift the responsibility by blaming the friend or the broker for their bad ideas. \nThere's something else about the nature of trading that makes it easy to escape the responsibility that \ncomes with creating structure in favor of trading randomly: It is the fact that any trade has the potential \nto be a winner, even a big winner. That big winning trade can come your way whether you are a great \nanalyst or a lousy one; whether you do or don't take responsibility. It takes effort to create the kind of \ndisciplined approach that is necessary to become a consistent winner. But, as you can see, it's very easy \nto avoid this kind of mental work in favor of trading with an undisciplined, random approach. \n \nPROBLEM: Addiction to Random Rewards \n \nSeveral studies have been done on the psychological effects of random rewards on monkeys. For \nexample, if you teach a monkey to do a task and consistently reward it every time the task is done, the \nmonkey quickly learns to associate a specific outcome with the efforts. If you stop rewarding it for \ndoing the task, within a very short period of time the monkey will simply stop doing the task. It won't \nwaste its energy doing something that it has now learned it won't be rewarded for. However, the \nmonkey's response to being cut off from the reward is very different if you start out on a purely random \nschedule, instead of a consistent one. When you stop offering the reward, there's no way the monkey \ncan know that it will never be rewarded again for doing that task. Every time it was rewarded in the \npast, the reward came as a surprise. As a result, from the monkey's perspective, there's no reason to quit \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 38,
      "text": "CHAPTER 3 \n \nTAKING RESPONSIBILITY \n \nAlthough the words \"taking responsibility\" sound simple, the concept is neither easy to grasp nor easy \nto put into practice in your trading. We have all heard the words and been confronted with the need to \ntake responsibility so many times in our lives that it is easy to take for granted that we know exactly \nwhat the phrase means. \nTaking responsibility in your trading and learning the appropriate principles of success are inextricably \nconnected. You have to understand, with every fiber of your being, the ways in which you are and are \nnot responsible for your success as a trader. Only then can you take on the characteristics that will \nallow you to join the select group of traders who are consistently successful in the markets. \nAt the end of Chapter 1, I introduced the idea of stepping into a future projection of yourself. In other \nwords, the consistently successful trader that you want to become doesn't exist yet. You must create a \nnew version of yourself, just as a sculptor creates a likeness of a model. \n \nSHAPING YOUR MENTAL ENVIRONMENT \n \nThe tools you will use to create this new version of yourself are your willingness and desire to learn, \nfueled by your passion to be successful. If the willingness and desire to learn are your primary tools, \nthen what is your medium? An artist creating a sculpture can choose to work in a number of \nmediums—clay, marble, or metal, for example— but if you want to create a new version of your \npersonality that expresses itself as a consistently successful trader, you have only your beliefs and \nattitudes. The medium for your artistic endeavor will be your mental environment, where with your \ndesire to learn, you can restructure and install the beliefs and attitudes that are necessary to achieve \nyour ultimate goal. \nI am assuming your ultimate goal is consistency. If you're like most traders, you don't realize the fullest \npotential of the opportunities available to you. To realize more and more of that potential, to make it \nmore and more of a reality in your life, your primary goal has to be to learn how to think like a \nconsistently successful trader. Remember, the best traders think in a number of unique ways. They have \nacquired a mental structure that allows them to trade without fear and, at the same time, keeps them \nfrom becoming reckless and committing fear-based errors. This mind-set has a number of components, \nbut the bottom line is that successful traders have virtually eliminated the effects of fear and \nrecklessness from their trading.  \nThese two fundamental characteristics allow them to achieve consistent results.  \nWhen you acquire this mind-set, you, too, will be able to trade without fear. You will no longer be \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 39,
      "text": "susceptible to the multitude of fear-based errors that come from rationalizing, subconsciously distorting \ninformation, hesitating, jumping the gun, or hoping. Once the fear is gone, there just won't be a reason \nto make these errors and, as a result, they will virtually disappear from your trading.  \nHowever, eliminating fear is only half the equation. The other half is the need to develop restraint. \nExcellent traders have learned that it is essential to have internal discipline or a mental mechanism to \ncounteract the negative effects of euphoria or the overconfidence that comes from a string of winning \ntrades. For a trader, winning is extremely dangerous if you haven't learned how to monitor and control \nyourself. \nIf we start from the premise that to create consistency traders must focus their efforts on developing a \ntrader's mind-set, then it is easy to see why so many traders don't succeed. Instead of learning to think \nlike traders, they think about how they can make more money by learning about the markets. It's almost \nimpossible not to fall into this trap. There are a number of psychological factors that make it very easy \nto assume that it's what you don't know about the markets that causes your losses and lack of consistent \nresults.  \nHowever, that's just not the case. The consistency you seek is in your mind, not in the markets. It's \nattitudes and beliefs about being wrong, losing money, and the tendency to become reckless, when \nyou're feeling good, that cause most losses—not technique or market knowledge. \nFor example, if you could choose one of the following two traders to manage your money, which one \nwould you pick? The first trader uses a simple, possibly even mediocre trading technique, but possesses \na mind-set that is not susceptible to subconsciously distorting market information, hesitating, \nrationalizing, hoping, or jumping the gun. The second trader is a phenomenal analyst, but is still \noperating out of the typical fears that make him susceptible to all of the psychological maladies that the \nother trader is free of. The right choice should be obvious. The first trader is going to achieve far better \nresults with your money. \nAttitude produces better overall results than analysis or technique. Of course, the ideal situation is to \nhave both, but you really don't need both, because if you have the right attitude—the right mind-set—\nthen everything else about trading will be relatively easy, even simple, and certainly a lot more fun. I \nknow for some of you this may be difficult to believe, or even distressing especially if you've been \nstruggling for years to learn everything you can about the market. \nInterestingly, most traders are closer to the way they need to think when they first begin trading than at \nany other time in their careers. Many people begin trading with a very unrealistic concept of the \ninherent dangers involved. This is particularly true if their first trade is a winner. Then they go into the \nsecond trade with little or no fear. If that trade is a winner, they go into the next trade with even less \nconcern for what would otherwise be the unacceptable possibility of a loss. Each subsequent win \nconvinces them that there is nothing to fear and that trading is the easiest possible way to make money. \nThis lack of fear translates into a carefree state of mind, similar to the state of mind many great athletes \ndescribe as a \"zone.\" If you've ever had the occasion to experience the zone in some sport, then you \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 45,
      "text": "some particular way. In other words, some outside force was acting against the inner force of our \ndesires and expectations. As a result, it feels natural to assign the market the power of an outside force \nthat either gives or takes away. But consider the fact that the market presents its information from a \nneutral perspective. That means the market doesn't know what you want or expect, nor does it care, \nunless, of course, you trade the kind of position that can have a major impact on prices. Otherwise, \neach moment, each bid, and each offer gives you the opportunity to do something. You can put on a \ntrade, take profits, or take off a loser. This is also true for those of you who are floor traders and are \npersonally known to other floor traders, who may also know your position and, to your detriment, \npurposely take advantage of that knowledge. It just means that you have to be faster and more focused, \nor take whatever limitations you have in these areas into consideration and trade accordingly. \nFrom the market's perspective, each moment is neutral; to you, the observer, every moment and price \nchange can have meaning. But where do these meaning exist? The meanings are based on what you've \nlearned, and exist inside your mind, not in the market. The market doesn't attach meanings or interpret \nthe information it generates about itself (although there are always individuals who will offer an \ninterpretation if you're willing to listen). Furthermore, the market doesn't know how you define an \nopportunity or a loss. The market doesn't know whether you perceive it as an endless stream of \nopportunities to enter and exit trades for both profits and losses at each and every moment, or whether \nyou perceive it as a greedy monster ready and willing in any given moment to devour your money. \nIf you perceive the endless stream of opportunities to enter and exit trades without self-criticism and \nregret, then you will be in the best frame of mind to act in your own best interest and learn from your \nexperiences. On the other hand, if what you perceive in market information is painful in some way, \nthen you will naturally try to avoid that pain by either consciously or subconsciously blocking that \ninformation from your awareness. In the process of blocking that information, you'll systematically cut \nyourself off from any number of opportunities to enrich yourself. In other words, you cut yourself off \nfrom the opportunity flow Furthermore, it will feel like the market is against you but only if you expect \nit to do something for you, or if you believe that it owes you something. If someone or something is \nagainst you and causes you pain, how are you likely to respond? You'll feel compelled to fight, but \nwhat exactly are you fighting? The market is certainly not fighting you. Yes, the market wants your \nmoney, but it also provides you with the opportunity to take as much as you can. Although it may feel \nas if you are fighting the market, or it is fighting you, the reality is you are simply fighting the negative \nconsequences of not fully accepting that the market owes you nothing; and that you need to take \nadvantage of the opportunities it presents by yourself, 100 percent and not one degree less. \nThe way to take maximum advantage of a situation where you are being offered unlimited \nopportunities to do something for yourself is to get into the flow. The market does have a flow. It is \noften erratic, especially in the shorter time frames, but it does display symmetrical patterns that repeat \nthemselves over and over again. Obviously, it's a contradiction to flow with something you are against. \nIf you want to start sensing the flow of the market, your mind has to be relatively free of fear, anger, \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 46,
      "text": "regret, betrayal, despair, and disappointment.  \nYou won't have a reason to experience these negative emotions when you assume absolute \nresponsibility. Earlier, I said that when you don't take responsibility, one of the major psychological \nobstacles that can block your success is that you will mislead yourself into believing that your trading \nproblems and lack of consistency can be rectified through market analysis. To illustrate this point, let's \ngo back to our novice trader who started out with a carefree state of mind until he experienced his first \nloss. After winning with such ease and effortlessness, the abrupt shift to emotional pain can be quite \nshocking—not shocking enough, however, to quit trading. Besides, in his mind the situation wasn't his \nfault anyway; the market did it to him. Instead of quitting, the great feeling that he experienced when \nhe was winning will be fresh in his mind, and will inspire him with a sense of determination to continue \ntrading. \nOnly now he's going to be smarter about it. He's going to put some effort into it and learn everything he \ncan about the markets. It's perfectly logical to think that if he can win not knowing anything, he'll be \nable to clean up when he does know something. But there's a big problem here that very few, if any, \ntraders will have any awareness of until long after the damage is done. Learning about the markets is \nfine and doesn't cause a problem in itself. It's the underlying reason for learning about the market that \nwill ultimately prove to be his undoing. \nAs I said a moment ago, the sudden shift from joy to pain usually creates quite a psychological shock. \nVery few people ever learn how to reconcile these kinds of experiences in a healthy way. \nTechniques are available, but they aren't widely known. The typical response in most people, especially \nin the type of person attracted to trading, is revenge. For traders, the only way to extract that revenge is \nto conquer the market, and the only way to conquer the market is through market knowledge, or so they \nthink. In other words, the underlying reason for why the novice trader is learning about the market is to \novercome the market, to prove something to it and himself, and most important, to prevent the market \nfrom hurting him again. He is not learning the market simply as a means to give himself a systematic \nway of winning, but rather as a way to either avoid pain or prove something that has absolutely nothing \nto do with looking at the market from an objective perspective. He doesn't realize it, but as soon as he \nmade the assumption that knowing something about the market can prevent him from experiencing \npain or can help satisfy his desire for revenge or to prove something, he sealed his fate to become a \nloser. \nIn effect what he has done is set up an irreconcilable dilemma. \nHe is learning how to recognize and understand the market's collective behavior patterns, and that's \ngood. It even feels good. He's inspired because he assumes he's learning about the market in order to \nbecome a winner. As a result, he will typically go on a knowledge quest, learning about trend lines, \nchart patterns, support and resistance, candlesticks, market profiles, point and line charts, Elliott waves, \nFibonacci retracements, oscillators, relative strength, stochastics, and many more technical tools too \nnumerous to mention. \n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 47,
      "text": "Curiously, even though his knowledge has increased, he now finds that he's developed problems \nexecuting his trades. He hesitates, second guesses himself, or doesn't put on a trade at all, in spite of \nany number of clear signals to do so. It's all frustrating, even maddening, because what's happened \ndoesn't make sense. He did what he was supposed to do—he learned—only to find that the more he \nlearned, the less he took advantage of. He would never believe that he did anything wrong by devoting \nhimself to learning; he simply did it for the wrong reasons. \nHe won't be able to trade effectively if he is trying to prove something or anything for that matter. If \nyou have to win, if you have to be right, if you can't lose or can't be wrong, you will cause yourself to \ndefine and perceive categories of market information as painful. In other words, you will view as \npainful any information the market generates that is in opposition to what will make you happy. \nThe dilemma is that our minds are wired to avoid both physical and emotional pain, and learning about \nthe markets will not compensate for the negative effects our pain-avoidance mechanisms have on our \ntrading. Everybody understands the nature of avoiding physical pain. Accidentally set your hand on a \nhot burner, and your hand moves away from the heat automatically; its an instinctive reaction. \nHowever, when it comes to avoiding emotional pain and the negative consequences it creates, \nespecially for traders, very few people understand the dynamics. Its absolutely essential to your \ndevelopment that you understand these negative effects and learn how to take conscious control in a \nway that helps you fulfill your goals. \nOur minds have a number of ways to shield us from information that we have learned to perceive as \npainful. For example, at a conscious level, we can rationalize, justify, or make a case for staying in a \nlosing trade. Some of the more typical ways we do this are to call our trading buddies, talk to our \nbroker, or look at indicators we never use, all for the express purpose of gathering nonpainful \ninformation in order to deny the validity of the painful information. At a subconscious level, our minds \nwill automatically alter, distort, or specifically exclude information from our conscious awareness. In \nother words, we don't know at a conscious level that our pain-avoidance mechanisms are either \nexcluding or altering the information being offered by the market. \nConsider the experience of being in a losing trade when the market is making consistently higher highs \nand higher lows or lower highs and lower lows against your position, while you refuse to acknowledge \nyou are in a losing trade because you have focused all your attention on the tics that go in your favor. \nOn the average, you are only getting one out of four or five tics in your direction; but it doesn't matter \nbecause every time you get one, you are convinced the market has reversed and is coming back. Instead \nthe market keeps going against you. At some point, the dollar value of the loss becomes so great that it \ncannot be denied and you finally exit the trade. The first reaction that traders universally have when \nlooking back at such a trade is, \"Why didn't I just take my loss and reverse?\" \nThe opportunity to put on a trade in the opposite direction was easily recognized once there was \nnothing at stake. But we were blinded to this opportunity while we were in the trade, because at that \ntime the information indicating it was an opportunity was defined as painful, so we blocked it from our \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 48,
      "text": "awareness.  \nWhen our hypothetical trader first started trading, he was having fun; he was in a carefree state of \nmind; he had no personal agendas and nothing to prove. As long as he was winning, he put his trades \non from a \"let's see what will happen\" perspective. The more he won, the less he considered the \npossibility of ever losing. When he finally did lose, he was probably in a state of mind where he least \nexpected it. Instead of assuming that the cause of his pain was his erroneous expectation about what the \nmarket was supposed to do or not do, he blamed the market, and resolved that by gaining market \nknowledge, he could prevent such experiences from recurring. In other words, he made a dramatic shift \nin his perspective from carefree to preventing pain by avoiding losses. \nThe problem is that preventing pain by avoiding losses can't be done. The market generates behavior \npatterns and the patterns repeat themselves, but not every time. So again, there is no possible way to \navoid losing or being wrong. Our trader won't sense these trading realities, because he is being driven \nforward by two compelling forces: (1) he desperately wants that winning feeling back, and (2) he is \nextremely enthusiastic about all of the market knowledge he is acquiring. What he doesn't realize is \nthat, in spite of his enthusiasm, when he went from a carefree state of mind to a preventand-avoid mode \nof thinking, he shifted from a positive to a negative attitude. \nHe's no longer focused on just winning, but rather on how he can avoid pain by preventing the market \nfrom hurting him again. This kind of negative perspective isn't any different from the tennis player or \ngolfer who is focused on trying not to make a mistake, the more he tries not to make a mistake, the \nmore mistakes he makes. However, this mode of thinking is much easier to recognize in sports because \nthere's a more discemable connection between one's focus and one's results. With trading, the \nconnection can be obscured and more difficult to recognize as a result of the positive feelings being \ngenerated from discovering new relationships in market data and behavior. \nSince he is feeling good, there's no reason to suspect that anything is wrong, except that the degree to \nwhich his focus is weighted toward pain-avoidance is the same degree by which he will create the very \nexperiences he is trying to avoid. In other words, the more he has to win and not lose, the less tolerance \nhe will have for any information that might indicate he is not getting what he wants. The mor \ninformation that he has the potential to block, the less he will be able to perceive an opportunity to act \nin his own best interests. \nLearning more and more about the markets only to avoid pain will compound his problems because the \nmore he learns, the more he will naturally expect from the markets, making it all the more painful when \nthe markets don't do their part. He has unwittingly created a vicious cycle where the more he learns, the \nmore debilitated he becomes; the more debilitated he becomes, the more he feel compelled to learn. \nThe cycle will continue until he either quits trading in disgust or recognizes that the root cause of his \ntrading problems is his perspective, not his lack of market knowledge. \n \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 51,
      "text": "In other words, not all parts of you would argue for the same outcome. Therefore, you can't assume that \nyou have the capacity to give yourself an unlimited amount of money just because you have learned \nhow to trade and the money is there for the taking. \nA futures broker at one of the major brokerage firms once commented that when it comes to his \ncustomers, he lives by the motto that all commodity traders are terminal, and it is his job to keep them \nhappy until they're gone. He said this facetiously, but there is a lot of truth to his statement. Obviously, \nif you lose more money than you make, you can't survive. What's less obvious, and one of the \nmysteries of being successful, is that if you win, you may still be terminal; that is, if you win and you \nhaven't learned how to create a healthy balance between confidence and restraint, or you haven't \nlearned how to recognize and compensate for any potential you have to self-destruct, you will sooner or \nlater lose. \nIf you are among those in the boom-and-bust cycle, consider this: If you could redo every losing trade \nthat was the result of an error or recklessness, how much money would you have now? Based on these \nrecalculated results, what would your equity curve look like? I'm sure many of you would fall into the \ncategory of consistent winners. Now think about how you responded to your losses when they \noccurred. Did you assume complete responsibility for them? Did you try to identify how you might \nchange your perspective, attitude, or behavior? Or did you look to the market and wonder what you \nmight learn about it to prevent such a thing from happening again? Obviously, the market has nothing \nto do with your potential for recklessness, nor does it have anything to do with the errors you make as a \nresult of some internal conflict about deserving the money.  \nProbably one of the hardest concepts for traders to effectively assimilate is that the market doesn't \ncreate your attitude or state of mind; it simply acts as a mirror reflecting what's inside back to you. If \nyou are confident, it's not because the market is making you feel that way; it is because your beliefs and \nattitudes are aligned in a way that allows you to step forward into an experience, take responsibility for \nthe outcome, and extract the insight that's been made available. You maintain your confident state of \nmind simply because you are constantly learning. Conversely, if you're angiy and afraid, it's because \nyou believe to some degree that the market creates your outcomes, not the other way around. \nUltimately, the worst consequence of not taking responsibility is that it keeps you in a cycle of pain and \ndissatisfaction. Think about it for a moment. If you're not responsible for your results, then you can \nassume there's nothing for you to learn, and you can stay exactly as you are.  \nYou won't grow and you won't change. As a result, you will perceive events in exactly the same way, \nand therefore respond to them in the same way, and get the same dissatisfying results. Or, you might \nalso assume the solution to your problems is to gain more market knowledge. It is always virtuous to \nlearn, but in this case if you don't take responsibility for your attitudes and perspective, then I vou're \nlearninc* snmpfhinff valuaVilp fnr wrnnrr that will cause you to use what you've learned in \ninappropriate ways. Without realizing it, you'll be using your knowledge to avoid the responsibility of \ntaking risks. In the process, you end up creating the veiy things you are trying to avoid, keeping you in \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 52,
      "text": "a cycle of pain and dissatisfaction. However, there is one tangible benefit to be gained from blaming \nthe market for what you wanted and didn't get.  \nYou can temporarily shield yourself from your own harsh self-criticism. I say \"temporarily\" because, \nwhen you shift responsibility, you cut yourself off from whatever you needed to learn from the \nexperience. Remember our definition of a winning attitude: a positive expectation of your efforts with \nan acceptance that whatever results you get are a perfect reflection of your level of development and \nwhat you need to learn to do better. If you shift the blame in order to block the painful feelings that \nresult from beating yourself up, all you've done is put an infected Band-Aid on the wound. You may \nthink you have solved the problem, but the problem is only going to resurface later, worse than before. \nIt has to, simply because you haven't learned anything that would cause you to make the land of \ninterpretations that would result in a more satisfying experience.  \nDid you ever wonder why leaving money on the table is often more painful than taking a loss? When \nwe lose, there are any number of ways in which we can shift the blame to the market and not accept \nresponsibility. But when we leave money on the table, we can't blame the market. The market didn't do \nanything but give us exactly what we wanted, but for whatever reason, we weren't capable of acting on \nthe opportunity appropriately. In other words, there's no way to rationalize the pain away. You are not \nresponsible for what the market does or doesn't do, but you are responsible for everything else that \nresults from your trading activities. You are responsible for what you have learned, as well as for \neverything you haven't learned yet that's waiting to be discovered by you. The most efficient path to \ndiscovering what you need to be successful is to develop a winning attitude, because it's an inherently \ncreative Dersoective. Not onlv does a winnin? attitude onen vou un to what you need to learn; it also \nproduces the land of mind-set that is most conducive to discovering something no one else has \nexperienced. Developing a winning attitude is the key to your success. The problem for many traders is \nthat either they think they already have one, when they don't, or they expect the market to develop the \nattitude for them by giving them winning trades. You are responsible for developing your own winning \nattitude. The market is not going to do it for you, and, I want to be as emphatic as I can, no amount of \nmarket analysis will compensate for developing a winning attitude if you lack one.  \nUnderstanding the markets will give you the edge you need to create some winning trades, but your \nedge won't make you a consistent winner if you don't have a winning attitude. Certainly one could \nargue that some traders lose because they don't understand enough about the markets and therefore they \nusually pick the wrong trades. As reasonable as this may sound, it has been my experience that traders \nwith losing attitudes pick the wrong trades regardless of how much they know about the markets. In \nany case, the result is the same—they lose.  \nOn the other hand, traders with winning attitudes who know virtually nothing about the markets can \npick winners; and if they know a lot about the markets, they can pick even more winners. If you want \nto change your experience of the markets from fearful to confident, if you want to change your results \nfrom an erratic equity curve to a steadily rising one, the first step is to embrace the responsibility and \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 58,
      "text": "ALIGNING YOUR MENTAL ENVIRONMENT \n \nNow we're going to start zeroing in on exactly how you can align your mental environment in order to \naccept the risk and function like a professional trader. Most of what I've discussed up to this point was \ndesigned to get you ready to do the real work. I'm going to teach you a thinking strategy that has, at its \ncore, a firm belief in probabilities and edges.  \nWith this new thinking strategy, you'll learn how to create a new relationship with the market, one that \ndisassociates your trading from what it typically means to be wrong or to lose, and that precludes you \nfrom perceiving anything about the market as threatening. When the threat of pain is gone, the fear will \ncorrespondingly disappear, as will the fear-based errors you are susceptible to. You will be left with a \nmind that is free to see what is available and to act on what you see. Getting to this carefree, fearless \nstate of mind, in spite of being burned over and over again, will take some work, but it's not going to be \nso difficult as you may think. In fact, by the time you've finished reading this book, most of you will be \namazed at how simple the solutions to your problems really are. In many respects, a state of mind or \nperspective is like software code.  \nYou could have several thousand lines of perfectly written code, with only one flawed line, and in that \none flawed line there might be only one character out of place. Depending on the purpose of the \nsoftware and where that flaw is in relation to everything else, that one misplaced character could ruin \nthe performance of an otherwise perfectly written system. You see, the solution was simple: Fix the \nmisplaced character, and everything runs smoothly. However, finding the error or even knowing it \nexists in the first place can take considerable expertise.  \nWhen it comes to the ideal trading mentality, everybody is a certain psychological distance away. In \nother words, virtually everyone starts out with flawed software code. I use terms like clicks or degrees \nto indicate psychological distance but these terms don't imply a specific distance. So, for example, \nmany of you will find that you are only, let's say, one click away in perspective from the ideal mind-\nset. That one click could represent one or two erroneous or misplaced assumptions you have about the \nnature of trading. As you reflect upon some of the ideas presented in this book, your perspective may \nshift.  \nTo use the analogy of software code, that shift would be equivalent to finding the flawed line in your \nmental system and replacing it with something that works properly. People normally describe this kind \nof internal mental shift as an \"ah, ha\" experience, or the moment when the light goes on. Everyone has \nhad these kinds of experiences, and there are some common qualities associated with them. First, we \nusually feel different. The world even seems different, as if it had suddenly changed. Typically, we \nmight say at the moment of the breakthrough something like, \"Why didn't you tell me this before?\" or, \n\"It was right in front of me the whole time, but I just didn't see it\" or, \"It's so simple; why couldn't I see \nit?\"  \nAnother interesting phenomenon of the \"ah, ha\" experience, is that sometimes within moments, \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 59,
      "text": "although the amount of time can vary, we feel as if this new part of our identity has always been a part \nof who we are. It then becomes difficult to believe that we were ever the way we were before we had \nthe experience. In short, you may already have some awareness of much of what you need to know to \nbe a consistently successful trader. But being aware of something doesn't automatically make it a \nfunctional part of who you are. Awareness is not necessarily a belief. You can't assume that learning \nabout something new and agreeing with it is the same as believing it at a level where you can act on it. \nTake the example of my client who is afraid of snakes. He is certainly aware that not all snakes are \ndangerous, and that learning how to make a distinction between the ones that are dangerous and the \nones that aren't would not be difficult.  \nWill learning how to make these distinctions suddenly cause him not to be afraid of \"non-dangerous \nsnakes\"? Can we assume that his awareness will drop down to a level in his mental environment where \nhe can now interact with snakes without fear or immobility? No, we cannot make this assumption. His \nawareness that some snakes aren't dangerous and his fear of snakes can exist side by side in his mental \nenvironment, as a contradiction to each other. You could confront him with a snake and he might \nreadily acknowledge that he knows the snake is not dangerous and wouldn't hurt him; but, at the same \ntime, he would still find it extremely difficult to touch the snake, even if he wanted to. Does this mean \nthat he is doomed to be afraid of snakes for the rest of his life? Only if he wants to be. It's really a \nmatter of willingness.  \nIt's certainly possible to neutralize his fear, but he will have to work at it, and working at anything \nrequires sufficient motivation. Many of us have what we know to be irrational fears and simply choose \nto live with the contradiction because we don't want to go through the emotional work that is necessary \nto overcome the fear. In this example, the contradiction is obvious. However, in my many years of \nworking with traders, I have uncovered several typical contradictions and conflicts surrounding the \nissues of risk and responsibility, where holding two or more conflicting beliefs can easily cancel out \nyour positive intentions, no matter how motivated you are to be successful.  \nThe problem is that none of these contradictions are really obvious, at least not at first glance. \nContradictory beliefs, however, aren't the only problems. What about assertions like \"I'm a risk taker,\" \nthat traders typically assume have dropped down to the functional level of a belief when, in fact, the \nunderlying dynamics of the way they perceive the market indicates they are doing everything possible \nto avoid risk. Contradictory beliefs and nonfunctional awareness represent flawed mental software \ncode; code that destroys your ability to stay focused and accomplish your goals; code that makes it \nseem as if you simultaneously have one foot on the accelerator and the other on the brake; code that \ngives learning how to trade a mysterious quality that will be challenging in a fun way at first, but \nusually turns into pure, unadulterated exasperation. When I was in college in the late 1960s, one of my \nfavorite movies was Cool Hand Luke, starring Paul Newman. It was a very popular movie back then, so \nI'm sure some of you have seen it on late-night TV.  \nLuke was in a Georgia chain gang. After he escaped and was caught for the second time, the warden \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 62,
      "text": "energy and stored in our mental environment as a memory and/or dis- I think all of this is fairly self-\nevident to most people, but there are some profound implications here that aren't self-evident, and we \ntypically take them completely for granted.  \nFirst of all, there's a cause-and-effect relationship that exists between ourselves and everything else that \nexists in the external environment. As a result, our encounters with external forces create what I am \ngoing to call \"energy structures\" inside our minds. The memories, distinctions, and, ultimately, the \nbeliefs we acquire throughout our lives exist in our mental environment in the form of structured \nenergy. Structured energy is an abstract concept. You might be asking yourself, \"How does energy take \nshape or form?\" Before I answer this question, an even more fundamental question needs to be \naddressed.  \nHow do we know that memories, distinctions, and beliefs exist in the form of energy in the first place? \nI don't know if it's been scientifically proven or completely accepted by the scientific community, but \nask yourself in what other form could these mental components exist? Here's what we know for sure: \nAnything composed of atoms and molecules takes up space and, therefore, can be observed. If \nmemories, distinctions, and beliefs existed in some physical form, then we should be able to observe \nthem. To my knowledge, no such observations have been made.  \nThe scientific community has dissected brain tissue (both living and dead) examined it at the level of \nthe individual atom, mapped various regions of the brain in terms of their functions, but nobody, as yet, \nhas observed a memory, distinction, or belief in its natural form. By \"in its natural form\" I mean that \nalthough a scientist can observe the individual brain cells that contain certain memories, he can't \nexperience those memories first hand. He can only experience them if the person to whom the \nmemories belong is alive and chooses to express them in some way. If memories, distinctions, and \nbeliefs don't exist as physical matter, then there really isn't any alternative way for them to exist except \nas some form of energy. If this is in fact the case, can this energy take on a specific shape? Can it be \nstructured in a way that reflects the external forces that caused it to come into existence? Most \ndefinitely! Is there anvthing in the environment that is analogous to energy having shape  \nThoughts are energy. Because you think in a language, your thoughts are structured by the limitations \nand rules that govern the particular language in which you think. When you express those thoughts \naloud, you create sound waves, which are a form of energy. The sound waves created by the interaction \nof your vocal cords and tongue are structured by the content of your message. Microwaves are energy. \nMany phone calls are relayed by microwaves, which means that the microwave energy has to be \nstructured in a way that reflects the message it is carrying.  \nLaser light is energy, and if you've ever witnessed a demonstration of a laser light show, or laser art, \nwhat you've seen is pure energy taking a shape that reflects the creative desires of the artists. All of \nthese are good examples of how energy can take shape, form, and structure. Of course, there are many \nmore, but there is one more example that illustrates the point in the most graphic way. At the most \nfundamental level, what are dreams? I am not asking you what dreams mean or what you think their \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 64,
      "text": "information the environment is generating about itself? Do we see, hear, taste, smell, or feel through \nour senses every possible distinction, trait, and characteristic being senses? Absolutely not! The energy \nthat's inside of us will categorically limit and block our awareness of much of this information by \nworking through the same sensory mechanisms the external environment works through. Now, if you \ntake a moment and think about it, some of what I just said should be self-evident. For example, there \nare many ways in which the external environment can express itself that we don't perceive simply \nbecause we haven't learned about them yet.  \nThis is easy to illustrate. Think back to the first time you ever looked at a price chart. What did you \nsee? Exactly what did you perceive? With no previous exposure, I'm sure, like everyone else, you saw \na bunch of lines that had no meaning. Now if you're like most traders, when you look at a price chart \nyou see characteristics, traits, and behavior patterns that represent the collective actions of all the \ntraders who participated in those particular trades. Initially, the chart represented undifferentiated \ninformation. Undifferentiated information usually creates a state of confusion, and that's probably what \nyou experienced when you first encountered a chart.  \nGradually, however, you learned to make distinctions about that information, such as trends and trend \nlines, consolidations, support and resistance, retracements or significant relationships between volume, \nand open interest and price action, just to name a few. You learned that each of these distinctions in the \nmarket s behavior represented an opportunity to fulfill some personal need, goal, or desire. Each \ndistinction now had a meaning and some relative degree of significance or importance attached to it. \nNow, I want you to use your imagination and pretend that I just set before you the very first price chart \nyou ever saw. Would there be a difference between what you see now and what you saw then? \nAbsolutely. Instead of a bunch of undifferentiated lines, you would see everything you've learned about \nthose lines between then and now. In other words, you would see all the distinctions you've learned to \nmake, as well as all the opportunities those distinctions represent.  \nYet, everything you can see as you look at that chart now existed then, and, furthermore, was available \nto be perceived. What's the difference? The structured energy that's inside of you now—the knowledge \nyou have gained—acts as a force on your eyes, causing you to recognize the various distinctions that \nyou've learned about. Since that energy wasn't there the first time you looked at the chart, all the \nopportunities that you now see were there, but at the same time invisible to you. Furthermore, unless \nyou've learned to make every possible distinction based on every possible relationship between the \nvariables in that chart, what you haven't learned yet is still invisible. Most of us have no concept of the \nextent to which we are continually surrounded by the invisible opportunities inherent in the information \nwe're exposed to.  \nMore often than not, we never learn about these opportunities and, as a result, they remain invisible. \nThe problem, of course, is that unless we're in a completely new or unique situation or we're operating \nout of an attitude of genuine openness, we won't perceive something that we haven't learned about yet. \nTo learn about something, we have to be able to experience it in some way. So what we have here is a \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 67,
      "text": "opportunity has absolutely nothing to do with your last trade. Each trade is simply an edge with a \nprobable outcome, and statistically independent of every other trade. If you believe otherwise, then I \ncan see why you're afraid; but I can assure you that your fears are completely unfounded. As you can \nsee, one person's perception of risk can easily be perceived as irrational thinking by another. Risk is \nrelative, but to the person who perceives it in the moment, it seems absolute and beyond question. \nWhen the child encountered his first dog, he was bubbling with excitement and curiosity. What is it \nabout the way our minds think and process information that could automatically flip the boy into a state \nof fear the next time he encounters a dog, even if it's months or years later? If we look at fear as a \nnatural mechanism warning us of threatening conditions, then what is it about the way our minds \nfunction that would automatically tell the boy that the next encounter with a dog is something to be \nafraid of? What happened to the boy's natural sense of curiosity? There is surely more to learn about \nthe nature of dogs than this one experience has taught him, especially in light of the fact that our minds \nseem to have an unlimited capacity for learning. And why would it be virtually impossible to talk the \nboy out of his fear? \n \nTHE POWER OF ASSOCIATION \n \nAs complex as these questions may seem at first glance, most of them can be answered quite easily. I'm \nsure many of you already know the answer: Our minds have an inherent design characteristic that \ncauses us to associate and link anything that exists in the external environment that is similar in quality, \ncharacteristics, properties, or traits to anything that already exists in our mental environment as a \nmemory or distinction. In other words, in the example of the child being afraid of dogs, the second dog \nor any other dog he encounters thereafter, doesn't have to be the dog that attacked in order for him to \nexperience emotional pain.  \nThere just has to be enough of a likeness or similarity for his mind to make a connection between the \ntwo. This natural tendency for our minds to associate is an unconscious mental function that occurs \nautomatically. It's not something we have to think about or make a decision about. An unconscious \nmental function would be analogous to an involuntary physical function such as a heartbeat. Just as we \ndon't have to consciously think about the process of making our hearts beat, we don't have to think \nabout linking experiences and our feelings about them. Its simply a natural function of the way our \nminds process information, and, like a heartbeat, it's a function that has a profound effect on the way \nwe experience our lives.  \nI'd like you to try and visualize the two-way flow of energy that reverses the cause-and-effect \nrelationship that will make it difficult (if not impossible) for the boy to perceive any other possibilities \nthan the one that's in his mind. To help you, I'm going to break this process down into its smallest parts, \nand go through what happens step by step, All of this may seem a bit abstract, but understanding this \nprocess plays a big part in unlocking your potential to achieve consistent success as a big trader. First, \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 70,
      "text": "circumstances? The underlining psychological dynamics work in exactly the same way. One of your \nbasic objectives as a trader is to perceive the opportunities available, not the threat of pain. To learn \nhow to stay focused on the opportunities, you need to know and understand in no uncertain terms the \nsource of the threat. It's not the market.  \nThe market generates information about its potential to move from a neutral perspective. At the same \ntime, it provides you (the observer) with an unending stream of opportunities to do something on your \nown behalf. If what you perceive at any given moment causes you to feel fear, ask yourself this \nquestion: Is the information inherently threatening, or are you simply experiencing the effect of your \nown state of mind reflected back to you (as in the above illustration)? I know this is a difficult concept \nto accept, so I'll give you another example to illustrate the point. Let's set up a scenario, where your last \ntwo or three trades were losers.  \nYou are watching the market, and the variables you use to indicate that an opportunity exists are now \npresent. Instead of immediately executing the trade, you hesitate. The trade feels very risky, so risky, in \nfact, that you start questioning whether this is \"really\" a signal. As a result, you start gathering \ninformation to support why this trade probably won't work. This is information you normally wouldn't \nconsider or pay attention to, and it's certainly not information that is part of your trading methodology. \nIn the meantime, the market is moving. Unfortunately, it is moving away from your original entry \npoint, the point at which you would have gotten into the trade if you hadn't hesitated. Now you are \nconflicted, because you still want to get in; the thought of missing a winning trade is painful. At the \nsame time, as the market moves away from your entry point, the dollar value of the risk to participate \nincreases. The tug of war inside your mind intensifies.  \nYou don't want to miss out, but you don't want to get whipsawed either. In the end, you do nothing, \nbecause you are paralyzed by the conflict. You justify your state of immobility by telling yourself that \nit's just too risky to chase the market, while you agonize over every tic the market moves in the \ndirection of what would have been a nice winning trade. If this scenario sounds familiar, I want you to \nask yourself whether, at the moment you hesitated, were you perceiving what the market was making \navailable, or perceiving what was in your mind reflected back to you? The market gave you a signal. \nBut you didn't perceive the signal from an objective or positive perspective. You didn't see it as an \nopportunity to experience the positive feeling you would get from winning or making money, but that's \nexactly what the market was making available to you.  \nThink about this for a moment: If I change the scenario so that your last two or three trades were \nwinners instead of losers, would you have perceived the signal any differently? Would you have \nperceived it more as an opportunity to win than you did in the first scenario? If you were coming off \nthree winners in a row, would you have hesitated to put that trade on? Very unlikely! In fact, if you're \nlike most traders, you probably would have been giving very strong consideration to loading up \n(putting on a position much larger than your normal size). In each situation, the market generated the \nsame signal. But your state of mind was negative and fear-based in the first scenario, and that caused \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 72,
      "text": " \nCHAPTER 6 \n \nTHE MARKET'S PERSPECTIVE \n \nFor the most part, a typical traders perception of the risk in any given trading situation is a function of \nthe outcome of his most recent two or three trades (depending on the individual). The best traders, on \nthe other hand, are not impacted (either negatively or too positively) by the outcomes of their last or \neven their last several trades. So their perception of the risk of any given trading situation is not \naffected by this personal, psychological variable. There's a huge psychological gap here that might lead \nyou to believe that the best traders have inherent design qualities in their minds that account for this \ngap, but I can assure you this is not the case. Every trader I've worked with over the last 18 years has \nhad to learn how to train his mind to stay properly focused in the \"now moment opportunity flow.\" This \nis a universal problem, and has to do both with the way our minds are wired and our common social \nupbringing (meaning, this particular trading problem is not personspecific).  \nThere are other factors relating to self-esteem that may also act as obstacles to your consistent success, \nbut what we are going to discuss now is the most important and fundamental building block to your \nsuccess as a trader.  \n \nTHE \"UNCERTAINTY\" PRINCIPLE \n \nIf there is such a thing as a secret to the nature of trading, this is it: At the very core of one's ability 1) \nto trade without fear or overconfidence, 2) perceive what the market is offering from its perspective, 3) \nstay completely focused in the \"now moment opportunity flow,\" and 4) spontaneously enter the \"zone,\" \nit is a strong virtually unshakeable belief in an uncertain outcome with an edge in your favor. The best \ntraders have evolved to the point where they believe, without a shred of doubt or internal conflict, that \n\"anything can happen.\"  \nThey don't just suspect that anything can happen or give lip service to the idea. Their belief in \nuncertainty is so powerful that it actually prevents their minds from associating the \"now moment\" \nsituation and circumstance with the outcomes of their most recent trades.By preventing this association, \nthey are able to keep their minds free of unrealistic and rigid expectations about how the market will \nexpress itself. Instead of generating the kind of unrealistic expectations that more often than not result \nin both emotional and financial pain, they have learned to \"make themselves available\" to take \nadvantage of whatever opportunities the market may offer in any given moment. \"Making yourself \navailable\" is a perspective from which you understand that the framework from which you are \nperceiving information is limited relative to what's being offered.  \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 73,
      "text": "Our minds don't automatically perceive every opportunity that presents itself in any given moment. \n(The \"boy and the dog\" illustration from Chapter 5 is a perfect example of how our own personal \nversions of the truth are reflected back to us.) This same land of perceptual blindness happens all the \ntime in trading. We can't perceive the potential for the market to continue to move in a direction that is \nalready against our position if, for example, we are operating out of a fear of being wrong. The fear of \nadmitting we are wrong causes us to place an inordinate amount of significance on information that \ntells us that we're right. This happens even if there's ample information to indicate that the market has \nin fact established a trend in the opposite direction of our position.  \nA trending market is a distinction about the market's behavior we can ordinarily perceive, but this \ndistinction can easily become invisible if we are operating out of fear. The trend and the opportunity to \ntrade in the direction of that trend don't become visible until we are out of the trade. In addition, there \nare opportunities that are invisible to us because we haven't learned to make the distinctions that would \nallow us to perceive them. Recall our discussion in Chapter 5 of the first price chart you ever looked at. \nWhat we haven't learned yet is invisible to us, and remains invisible until our minds are open to an \nexchange of energy. A perspective from which you make yourself available takes into consideration \nboth the known and the unknown: For example, you've built a mental framework that allows you to \nrecognize a set of variables in the markets behavior that indicates when an opportunity to buy or sell is \npresent. This is your edge and something you know.  \nHowever, what you don't know is exactly how the pattern your variables identify will unfold. With the \nperspective of making yourself available, you know that your edge places the odds of success in your \nfavor, but, at the same time, you completely accept the fact that you don't know the outcome of any \nparticular trade. By making yourself available, you consciously open yourself up to find out what will \nhappen next; instead of giving way to an automatic mental process that causes you to think you already \nknow. Adopting this perspective leaves your mind free of internal resistance that can prevent you from \nperceiving whatever opportunity the market is making available from its perspective (its truth). Your \nmind is open for an exchange of energy. Not only can you learn something about the market that you \npreviously didn't know, but you also set up the mental condition most conducive to entering \"the zone.\"  \nThe essence of what it means to be in \"the zone\" is that your mind and the market are in sync. As a \nresult, you sense what the market is about to do as if there is no separation between yourself and the \ncollective consciousness of everyone else participating in the market. The zone is a mental space where \nyou are doing more than just reading the collective mind, you are also in complete harmony with it. If \nthis sounds a bit strange to you, ask yourself how it is that a flock of birds or a school of fish can \nchange direction simultaneously. There must be a way in which they are linked to one another. If it is \npossible for people to become linked in the same way, then there will be times when information from \nthose with whom we are linked can and will bleed through to our consciousness.  \nTraders who have experienced being tapped into the collective consciousness of the market can \nanticipate a change in direction just as a bird in the middle of a flock or a fish in the middle of a school \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 76,
      "text": "MARKETS MOST FUNDAMENTAL CHARACTERISTIC  \n(IT CAN EXPRESS ITSELF IN AN ALMOST INFINITE COMBINATION OF WAYS ) \n \nThe market can do virtually anything at any time. This seems obvious enough, especially for anybody \nwho has experienced a market that has displayed erratic and volatile price swings. The problem is that \nall of us have the tendency to take this characteristic for granted, in ways that cause us to make the \nmost fundamental trading errors over and over again. The fact is that if traders really believed that \nanything could happen at any time, there would be considerably fewer losers and more consistent \nwinners. How do we know that virtually anything can happen? This fact is easy to establish. All we \nhave to do is dissect the market into its component parts and look at how the parts operate. The most \nfundamental component of any market is its traders. Individual traders act as a force on prices, making \nthem move by either bidding a price up or offering it lower.  \nWhy do traders bid a price up or offer it lower? To answer this question we have to establish the \nreasons why people trade. There are many reasons and purposes behind a person s motivation to trade \nin any given market. However, for the purposes of this illustration, we don't have to know all the \nunderlying reasons that compel any individual trader to act because ultimately they all boil down to one \nreason and one purpose: to make money. We know this because there are only two things a trader can \ndo (buy and sell) and there are only two possible outcomes for every trade (profit or loss). Therefore, I \nthink we can safely assume that regardless of one's reasons for trading, the bottom line is that everyone \nis looking for the same outcome: Profits. And there are only two ways to create those profits: Either \nbuy low and sell high, or sell high and buy low. If we assume that everyone wants to make money, then \nthere's only one reason why any trader would bid a price up to the next highest level: because he \nbelieves he can sell whatever he's buying at a higher price at some point in the future.  \nThe same is true for the trader who's willing to sell something at a price that is less than the last posted \nprice (offer a market lower). He does it because he believes he can buy back whatever he's selling at a \nlower price at some point in the future. If we look at the market's behavior as a function of price \nmovement, and if price movement is a function of traders who are willing to bid prices up or offer them \nlower, then we can say that all price movement (market behavior) is a function of what traders believe \nabout the future. To be more specific, all price movement is a function of what individual traders \nbelieve about what is high and what is low. The underlying dynamics of market behavior are quite \nsimple. Only three primary forces exist in any market: traders who believe the price is low, traders who \nbelieve the price is high, and traders who are watching and waiting to make up their minds about \nwhether the price is low or high. Technically, the third group constitutes a potential force. The reasons \nthat support any given traders belief that something is high or low are usually irrelevant, because most \npeople who trade act in an undisciplined, unorganized, haphazard, and random manner. So, their \nreasons wouldn't necessarily help anyone gain a better understanding of what is going on. But, \nunderstanding what's going on isn't that difficult, if you remember that all price movement or lack of \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 77,
      "text": "movement is a function of the relative balance or imbalance between two primary forces: traders who \nbelieve the price is going up, and traders who believe the price is going down.  \nIf there's balance between the two groups, prices will stagnate, because each side will absorb the force \nof the other side's actions. If there is an imbalance, prices will move in the direction of the greater \nforce, or the traders who have the stronger convictions in their beliefs about in what direction the price \nis going. Now, I want you to ask yourself, what's going to stop virtually anything from happening at \nany time, other than exchange-imposed limits on price movement. There's nothing to stop the price of \nan issue from going as high or low as whatever some trader in the world believes is possible—if, of \ncourse, the trader is willing to act on that belief. So the range of the market's behavior in its collective \nform is limited only by the most extreme beliefs about what is high and what is low held by any given \nindividual participating in that market. I think the implications are self-evident:  \nThere can be an extreme diversity of beliefs present in any given market in any given moment, making \nvirtually anything possible. When we look at the market from this perspective, it's easy to see that \nevery potential trader who is willing to express his belief about the future becomes a market variable. \nOn a more personal level, this means that it only takes one other trader, anywhere in the world, to \nnegate the positive potential of your trade. Put another way, it takes only one other trader to negate \nwhat you believe about what is high or what is low. That's all, only one! Here's an example to illustrate \nthis point. Several years ago, a trader came to me for help. He was an excellent market analyst; in fact, \nhe was one of the best I've ever met. But after years of frustration during which he lost all his money \nand a lot of other people's money, he was finally ready to admit that, as a trader, he left a lot to be \ndesired. After talking to him for a while, I determined that a number of serious psychological obstacles \nwere preventing him from being successful.  \nOne of the most troublesome obstacles was that he was a know-it-all and extremely arrogant, making it \nimpossible for him to achieve the degree of mental flexibility required to trade effectively. It didn't \nmatter how good an analyst he was. When he came to me, he was so desperate for money and help that \nhe was willing to consider anything. The first suggestion I made was that instead of looking for another \ninvestor to back what ultimately would be another failed attempt at trading, he would be better off \ntaking a job, doing something he was truly good at. He could be paid a steady income while working \nthrough his problems, and at the same time provide someone with a worthwhile service. He took my \nadvice and quickly found a position as a technical analyst with a fairly substantial brokerage house and \nclearing firm in Chicago.  \nThe semiretired chairman of the board of the brokerage firm was a longtime trader with nearly 40 years \nof experience in the grain pits at the Chicago Board of Trade. He didn't know much about technical \nanalysis, because he never needed it to make money on the floor. But he no longer traded on the floor \nand found the transition to trading from a screen difficult and somewhat mysterious. So he asked the \nfirm's newly acquired star technical analyst to sit with him during the trading day and teach him \ntechnical trading. The new hire jumped at the opportunity to show off his abilities to such an \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 78,
      "text": "experienced and successful trader. The analyst was using a method called \"point and line,\" developed \nby Charlie Drummond. (Among other things, point and line can accurately define support and \nresistance.) One day, as the two of them were watching the soybean market together, the analyst had \nprojected major support and resistance points and the market happened to be trading between these two \npoints.  \nAs the technical analyst was explaining to the chairman the significance of these two points, he stated \nin very emphatic, almost absolute terms that if the market goes up to resistance, it will stop and reverse; \nand if the market goes down to support, it will also stop and reverse. Then he explained that if the \nmarket went down to the price level he calculated as support, his calculations indicated that would also \nbe the low of the day. As they sat there, the bean market was slowly trending down to the price the \nanalyst said would be the support, or low, of the day. When it finally got there, the chairman looked \nover to the analyst and said, \"This is where the market is supposed to stop and go higher, right?\"  \nThe analyst responded, \"Absolutely! This is the low of the day.\" \"That's bullshit!\" the chairman \nretorted. \"Watch this.\" He picked up the phone, called one of the clerks handling orders for the soybean \npit, and said, \"Sell two million beans (bushels) at the market.\" Within thirty seconds after he placed the \norder, the soybean market dropped ten cents a bushel. The chairman turned to look at the horrified \nexpression on the analysts face. Calmly, he asked, \"Now, where did you say the market was going to \nstop? If I can do that, anyone can.\"  \nThe point is that from our own individual perspective as observers of the market, anything can happen, \nand it takes only one trader to do it. This is the hard, cold reality of trading that only the very best \ntraders have embraced and accepted with no internal conflict. How do I know this? Because only the \nbest traders consistently predefine their risks before entering a trade. Only the best traders cut their \nlosses without reservation or hesitation when the market tells them the trade isn't working. And only \nthe best traders have an organized, systematic, money-management regimen for taking profits when the \nmarket goes in the direction of their trade. Not predefining your risk, not cutting your losses, or not \nsystematically taking profits are three of the most common—and usually the most costly—trading \nerrors you can make. Only the best traders have eliminated these errors from their trading. At some \npoint in their careers, they learned to believe without a shred of doubt that anything can happen, and to \nalways account for what they don't know, for the unexpected. Remember that there are only two forces \nthat cause prices to move: traders who believe the markets are going up, and traders who believe the \nmarkets are going down. At any given moment, we can see who has the stronger conviction by \nobserving where the market is now relative to where it was at some previous moment. If a recognizable \npattern is present, that pattern may repeat itself, giving us an indication of where the market is headed. \nThis is our edge, something we know. But there's also much that we don't know, and will never know \nunless we learn how to read minds. For instance, do we know how many traders may be sitting on the \nsidelines and about to enter the market? Do we know how many of them want to buy and how many \nwant to sell, or how many shares they are willing to buy or sell? What about the traders whose \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 80,
      "text": "foundation for building every other belief and attitude that he needs to be a successful trader. Without \nthat belief, his mind will automatically, and usually without his conscious awareness, cause him to \navoid, block, or rationalize away any information that indicates the market may do something he hasn't \naccepted as possible.  \nIf he believes that anything is possible, then there's nothing for his mind to avoid. Because anything \nincludes everything, this belief will act as an expansive force on his perception of the market that will \nallow him to perceive information that might otherwise have been invisible to him. In essence, he will \nbe making himself available (opening his mind) to perceive more of the possibilities that exist from the \nmarkets perspective. Most important, by establishing a belief that anything can happen, he will be \ntraining his mind to think in probabilities. This is by far the most essential as well as the most difficult \nprinciple for people to grasp and to effectively integrate into their mental systems. CHAPTER 7  \n \nCHAPTER 7 \n \nTHE TRADER'S EDGE: THINKING IN PROBABILITIES \n \nExactly what does it mean to think in probabilities, and why is it so essential to one's consistent success \nas a trader? If you take a moment and analyze the last sentence, you will notice that I made consistency \na function of probabilities. It sounds like a contradiction: How can someone produce consistent results \nfrom an event that has an uncertain probabilistic outcome? To answer this question, all we have to do is \nlook to the gambling industry. Corporations spend vast amounts of money, in the hundreds of millions, \nif not billions, of dollars, on elaborate hotels to attract people to their casinos.  \nIf you've been to Las Vegas you know exactly what I am talking about. Gaming corporations are just \nlike other corporations, in that they have to justify how they allocate their assets to a board of directors \nand ultimately to their stockholders. How do you suppose they justify spending vast sums of money on \nelaborate hotels and casinos, whose primary function is to generate revenue from an event that has a \npurely random outcome?  \n \nPROBABILITIES PARADOX: RANDOM OUTCOME, CONSISTENT RESULTS \n \nHere's an interesting paradox. Casinos make consistent profits day after day and year after year, \nfacilitating an event that has a purely random outcome. At the same time, most traders believe that the \noutcome of the market's behavior is not random, yet can't seem to produce consistent profits. Shouldn't \na consistent, nonrandom outcome produce consistent results, and a random outcome produce random, \ninconsistent results? What casino owners, experienced gamblers, and the best traders understand that \nthe typical trader finds difficult to grasp is: even that have probable outcomes can produce consistent \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 81,
      "text": "results, if you can get the odds in your favor and there is a large enough sample size. The best traders \ntreat trading like a numbers game, similar to the way in which casinos and professional gamblers \napproach gambling. To illustrate, let's look at the game of blackjack. In blackjack, the casinos have \napproximately a 4.5-percent edge over the player, based on the rules they require players to adhere to. \nThis means that, over a large enough sample size (number of hands played), the casino will generate \nnet profits of four and a half cents on every dollar wagered on the game. This average of four and a half \ncents takes into account all the players who walked away big winners (including all winning streaks), \nall the players who walked away big losers, and everybody in between. At the end of the day, week, \nmonth, or year, the casino always ends up with approximately 4.5 percent of the total amount wagered.  \nThat 4.5 percent might not sound like a lot, but let's put it in perspective. Suppose a total of $100 \nmillion dollars is wagered collectively at all of a casino's blackjack tables over the course of a year. The \ncasino will net $4.5 million. What casino owners and professional gamblers understand about the \nnature of probabilities is that each individual hand played is statistically independent of every other \nhand. This means that each individual hand is a unique event, where the outcome is random relative to \nthe last hand played or the next hand played. If you focus on each hand individually, there will be a \nrandom, unpredictable distribution between winning and losing hands. But on a collective basis, just \nthe opposite is true. If a large enough number of hands is played, patterns will emerge that produce a \nconsistent, predictable, and statistically reliable outcome.  \nHere's what makes thinking in probabilities so difficult. It requires two layers of beliefs that on the \nsurface seem to contradict each other. We'll call the first layer the micro level. At this level, you have \nto believe in the uncertainty and unpredictability of each individual hand. You know the truth of this \nuncertainty, because there are always a number of unknown variables affecting the consistency of the \ndeck that each new hand is drawn from. For example, you can't know in advance how any of the other \nparticipants will decide to play their hands, since they can either take or decline additional cards. Any \nvariables acting on the consistency of the deck that can't be controlled or known in advance will make \nthe outcome of any particular hand both uncertain and random (statistically independent) in \nrelationship to any other hand. The second layer is the macro level. At this level, you have to believe \nthat the outcome over a series of hands played is relatively certain and predictable. The degree of \ncertainty is based on the fixed or constant variables that are known in advance and specifically \ndesigned to give an advantage (edge) to one side or the other.  \nThe constant variables I am referring to are the rules of the game. So, even though you don't or couldn't \nknow in advance (unless you are psychic) the sequence of wins to losses, you can be relatively certain \nthat if enough hands are played, whoever has the edge will end up with more wins than losses. The \ndegree of certainty is a function of how good the edge is. It's the ability to believe in the \nunpredictability of the game at the micro level and simultaneously believe in the predictability of the \ngame at the macro level that makes the casino and the professional gambler effective and successful at \nwhat they do. Their belief in the uniqueness of each hand prevents them from engaging in the pointless \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 82,
      "text": "endeavor of trying to predict the outcome of each individual hand. They have learned and completely \naccepted the fact that they don't know what's going to happen next. More important, they don't need to \nknow in order to make money consistently.  \nBecause they don't have to know what's going to happen next, they don't place any special significance, \nemotional or otherwise, on each individual hand, spin of the wheel, or roll of the dice. In other words, \nthey're not encumbered by unrealistic expectations about what is going to happen, nor are their egos \ninvolved in a way that makes them have to be right. As a result, it's easier to stay focused on keeping \nthe odds in their favor and executing flawlessly, which in turn makes them less susceptible to making \ncostly mistakes.  \nThey stay relaxed because they are committed and willing to let the probabilities (their edges) play \nthemselves out, all the while knowing that if their edges are good enough and the sample sizes are big \nenough, they will come out net winners. The best traders use the same thinking strategy as the casino \nand professional gambler. Not only does it work to their benefit, but the underlying dynamics \nsupporting the need for such a strategy are exactly the same in trading as they are in gambling.  \nA simple comparison between the two will demonstrate this quite clearly. First, the trader, the gambler, \nand the casino are all dealing with both known and unknown variables that affect the outcome of each \ntrade or gambling event. In gambling, the known variables are the rules of the game. In trading, the \nknown variables (from each individual trader's perspective) are the results of their market analysis. \nMarket analysis finds behavior patterns in the collective actions of everyone participating in a market. \nWe know that individuals will act the same way under similar situations and circumstances, over and \nover again, producing observable patterns of behavior. By the same token, groups of individuals \ninteracting with one another, day after day, week after week, also produce behavior patterns that repeat \nthemselves. These collective behavior patterns can be discovered and sub- «pnii<=-nflv identified bv \nnsinf analvtical tools such as trend lines, moving averages, oscillators, or retracements, just to name a \nfew of the thousands that are available to any trader. Each analytical tool uses a set of criteria to define \nthe boundaries of each behavior pattern identified. The set of criteria and the boundaries identified are \nthe trader's known market variables.  \nThey are to the individual trader what the rules of the game are to the casino and gambler. By this I \nmean, the trader's analytical tools are the known variables that put the odds of success (the edge) for \nany given trade in the trader's favor, in the same way that the rules of the game put the odds of success \nin favor of the casino. Second, we know that in gambling a number of unknown variables act on the \noutcome of each game. In blackjack, the unknowns are the shuffling of the deck and how the players \nchoose to play their hands. In craps, it's how the dice are thrown. And in roulette, it's the amount of \nforce applied to spin the wheel. All these unknown variables act as forces on the outcome of each \nindividual event, in a way that causes each event to be statistically independent of any other individual \nevent, thereby creating a random distribution between wins and losses. Trading also involves a number \nof unknown variables that act on the outcome of any particular behavior pattern a trader may identify \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 83,
      "text": "and use as his edge. In trading, the unknown variables are all other traders who have the potential to \ncome into the market to put on or take off a trade.  \nEach trade contributes to the market's position at any given moment, which means that each trader, \nacting on a belief about what is high and what is low, contributes to the collective behavior pattern that \nis displayed at that moment. If there is a recognizable pattern, and if the variables used to define that \npattern conform to a particular trader's definition of an edge, then we can say that the market is offering \nthe trader an opportunity to buy low or sell high, based on the trader's definition. Suppose the trader \nseizes the opportunity to take advantage of his edge and puts on a trade. What factors will determine \nwhether the market unfolds in the direction of his edge or against it? The answer is: the behavior of \nother traders!  \nAt the moment he puts a trade on, and for as long as he chooses to stay in that trade, other traders will \nbe participating in that market. They will be acting on their beliefs about what is high and what is low. \nAt any given moment, some percentage of other traders will contribute to an outcome favorable to our \ntraders edge, and the participation of some percentage of traders will negate his edge. There's no way to \nknow in advance how everyone else is going to behave and how their behavior will affect his trade, so \nthe outcome of the trade is uncertain.  \nThe fact is, the outcome of every (legal) trade that anyone decides to make is affected in some way by \nthe subsequent behavior of other traders participating in that market, making the outcome of all trades \nuncertain. Since all trades have an uncertain outcome, then like gambling, each trade has to be \nstatistically independent of the next trade, the last trade, or any trades in the future, even though the \ntrader may use the same set of known variables to identify his edge for each trade. Furthermore, if the \noutcome of each individual trade is statistically independent of every other trade, there must also be a \nrandom distribution between wins and losses in any given string or set of trades, even though the odds \nof success for each individual trade may be in the traders favor.  \nThird, casino owners don't try to predict or know in advance the outcome of each individual event. \nAside from the fact that it would be extremely difficult, given all the unknown variables operating in \neach game, it isn't necessary to create consistent results. Casino operators have learned that all they \nhave to do is keep the odds in their favor and have a large enough sample size of events so that their \nedges have ample opportunity to work.  \n \nTRADING IN THE MOMENT \n \nTraders who have learned to think in probabilities approach the markets from virtually the same \nperspective. At the micro level, they believe that each trade or edge is unique. What they understand \nabout the nature of trading is that at any given moment, the market may look exactly the same on a \nchart as it did at some previous moment; and the geometric measurements and mathematical \ncalculations used to determine each edge can be exactly the same from one edge to the next; but the \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 84,
      "text": "actual consistency of the market itself from one moment to the next is never the same.  \nFor any particular pattern to be exactly the same now as it was in some previous moment would require \nthat every trader who participated in that previous moment be present. What's more, each of them \nwould also have to interact with one another in exactly the same way over some period of time to \nproduce the exact same outcome to whatever pattern was being observed. The odds of that happening \nare nonexistent. It is extremely important that you understand this phenomenon because the \npsychological implications for your trading couldn't be more important.  \nWe can use all the various tools to analyze the market's behavior and find the patterns that represent the \nbest edges, and from an analytical perspective, these patterns can appear to be precisely the same in \neveiy respect, both mathematically and visually. But, if the consistency of the group of traders who are \ncreating the pattern \"now\" is different by even one person from the group that created the pattern in the \npast, then the outcome of the current pattern has the potential to be different from the past pattern. (The \nexample of the analyst and chairman illustrates this point quite well.) It takes only one trader, \nsomewhere in the world, with a different belief about the future to change the outcome of any particular \nmarket pattern and negate the edge that pattern represents. The most fundamental characteristic of the \nmarket's behavior is that each \"now moment\" market situation, each \"now moment\" behavior pattern, \nand each \"now moment\" edge is always a unique occurrence with its own outcome, independent of all \nothers. Uniqueness implies that anything can happen, either what we know (expect or anticipate), or \nwhat we don't know (or can't know, unless we had extraordinary perceptual abilities). A constant flow \nof both known and unknown variables creates a probabilistic environment where we don't know for \ncertain what will happen next.  \nThis last statement may seem quite logical, even self-evident, but there's a huge problem here that is \nanything but logical or selfevident. Being aware of uncertainty and understanding the nature of \nprobabilities does not equate with an ability to actually function effectively from a probabilistic \nperspective. Thinking in probabilities can be difficult to master, because our minds don't naturally \nprocess information in this manner. Quite the contrary, our minds cause us to perceive what we know, \nand what we know is part of our past, whereas, in the market, every moment is new and unique, even \nthough there may be similarities to something that occurred in the past. This means that unless we train \nour minds to perceive the uniqueness of each moment, tiiat uniqueness will automatically be filtered \nout of our perception. We will perceive only what we know, minus any information that is blocked by \nour fears; everything else will remain invisible.  \nThe bottom line is that there is some degree of sophistication to thinking in probabilities, which can \ntake some people a considerable amount of effort to integrate into their mental systems as a functional \nthinking strategy. Most traders don't fully understand this; as a result, they mistakenly assume they are \nthinking in probabilities, because they have some degree of understanding of the concepts. I've worked \nwith hundreds of traders who mistakenly assumed they thought in probabilities, but didn't. Here is an \nexample of a trader I worked with whom I'll call Bob. Bob is a certified trading advisor (CTA) who \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 85,
      "text": "manages approximately $50 million in investments. He's been in the business for almost 30 years. He \ncame to one of my workshops because he was never able to produce more than a 12- to 18-percent \nannual return on the accounts he managed.  \nThis was an adequate return, but Bob was extremely dissatisfied because his analytical abilities \nsuggested that he should be achieving an annual return of 150 to 200 percent. I would describe Bob as \nbeing well-versed in the nature of probabilities. In other words, he understood the concepts, but he \ndidn't function from a probabilistic perspective. Shortly after attending the workshop, he called to ask \nme for some advice. Here is the entry from my journal written immediately after that phone \nconversation.  \n9-28-95: Bob called with a problem. He put on a belly trade and put his stop in the market. The market \ntraded about a third of the way to his stop and then went back to his entry point, where he decided to \nbail out of the trade. Almost immediately after he got out, the bellies went 500 points in the direction of \nthis trade, but of course he was out of the market. He didn't understand what was going on. First, I \nasked him what was at risk. He didn't understand the question. He assumed that he had accepted the \nrisk because he put in a stop. I responded that just because he put in a stop it didn't mean that he had \ntruly accepted the risk of the trade. There are many things that can be at risk: losing money, being \nwrong, not being perfect, etc., depending on one's underlying motivation for trading. I pointed out that \na person's beliefs are always revealed by their actions.  \nWe can assume that he was operating out of a belief that to be a disciplined trader one has to define the \nrisk and put a stop in. And so he did. But a person can put in a stop and at the same time not believe \nthat he is going to be stopped out or that the trade will ever work against him, for that matter. By the \nway he described the situation, it sounded to me as if this is exactly what happened to him. When he \nput on the trade, he didn't believe he would be stopped out. Nor did he believe the market would trade \nagainst him. In fact, he was so adamant about this, that when the market came back to his entry point, \nhe got out of the trade to punish the market with an \"I'll show you\" attitude for even going against him \nby one tic. After I pointed this out to him, he said this was exactly the attitude he had when he took off \nthe trade. He said that he had been waiting for this particular trade for weeks and when the market \nfinally got to this point, he thought it would immediately reverse.  \nI responded by reminding him to look at the experience as simply pointing the way to something that \nhe needs to learn. A prerequisite for thinking in probabilities is that you accept the risk, because if you \ndon't, you will not want to face the possibilities that you haven't accepted, if and when they do present \nthemselves. When you've trained your mind to think in probabilities, it means you have fully accepted \nall the possibilities (with no internal resistance or conflict) and you always do something to take the \nunknown forces into account. Thinkine this way is virtually impossible unless you've done the mental \nwork necessary to \"let go\" of the need to know what is going to happen next or the need to be right on \neach trade. In fact, the degree by which you think you know, assume you know, or in any way need to \nknow what is going to happen next, is equal to the degree to which you will fail as a trader. Traders \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 86,
      "text": "who have learned to think in probabilities are confident of their overall success, because they commit \nthemselves to taking every trade that conforms to their definition of an edge.  \nThey don't attempt to pick and choose the edges they think, assume, or believe are going to work and \nact on those; nor do they avoid the edges that for whatever reason they think, assume, or believe aren't \ngoing to work. If they did either of those things, they would be contradicting their belief that the \"now\" \nmoment situation is always unique, creating a random distribution between wins and losses on any \ngiven string of edges. They have learned, usually quite painfully, that they don't know in advance \nwhich edges are going to work and which ones aren't. They have stopped trying to predict outcomes. \nThey have found that by taking every edge, they correspondingly increase their sample size of trades, \nwhich in turn gives whatever edge they use ample opportunity to play itself out in their favor, just like \nthe casinos. On the other hand, why do you think unsuccessful traders are obsessed with market \nanalysis.  \nThey crave the sense of certainty that analysis appears to give them. Although few would admit it, the \ntruth is that the typical trader wants to be right on every single trade. He is desperately trying to create \ncertainty where it just doesn't exist. The irony is that if he completely accepted the fact that certainty \ndoesn't exist, he would create the certainty he craves: He would be absolutely certain that certainty \ndoesn't exist. When you achieve complete acceptance of the uncertainty of each edge and the \nuniqueness of each moment, your frustration with trading will end. Furthermore, you will no longer be \nsusceptible to making all the typical trading errors that detract from your potential to be consistent and \ndestroy your sense of self-confidence. For examnle not rlefminff the risk before crRftincr into a trarle is \nhv far rhp most common of all trading errors, and starts the whole process of trading from an \ninappropriate perspective. In light of the fact that anything can happen, wouldn't it make perfect sense \nto decide before executing a trade what the market has to look, sound, or feel like to tell you your edge \nisn't working? So why doesn't the typical trader decide to do it or do it every single time?  \nI have already given you the answer in the last chapter, but there's more to it and there's also some \ntricky logic involved, but the answer is simple. The typical trader won't predefine the risk of getting \ninto a trade because he doesn't believe it's necessary. The only way he could believe \"it isn't necessary\" \nis if he believes he knows what's going to happen next. The reason he believes he knows what's going \nto happen next is because he won't get into a trade until he is convinced that he's right. At the point \nwhere he's convinced the trade will be a winner, it's no longer necessary to define the risk (because if \nhe's right, there is no risk). Typical traders go through the exercise of convincing themselves that \nthey're right before they get into a trade, because the alternative (being wrong) is simply unacceptable. \nRemember that our minds are wired to associate.  \nAs a result, being wrong on any given trade has the potential to be associated with any (or every) other \nexperience in a trader's life where he's been wrong. The implication is that any trade can easily tap him \ninto the accumulated pain of every time he has been wrong in his life. Given the huge backlog of \nunresolved, negative energy surrounding what it means to be wrong that exists in most people, it's easy \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 87,
      "text": "to see why each and every trade can literally take on the significance of a life or death situation. So, for \nthe typical trader, determining what the market would have to look, sound, or feel like to tell him that a \ntrade isn't working would create an irreconcilable dilemma. On one hand, he desperately wants to win \nand the only way he can do that is to participate, but the only way he will participate is if he's sure the \ntrade will win. On the other hand, if he defines his risk, he is willfully gathering evidence that would \nnegate something he has already convinced himself of.  \nHe will be contradicting the decision-making process he went through to convince himself that the \ntrade will work. If he exposed himself to conflicting information, it would surely create some degree of \ndoubt about the viability of the trade. If he allows himself to experience doubt, it's very unlikely he will \nparticipate. If he doesn't put the trade on and it turns out to be a winner, he will be in extreme agony. \nFor some people, nothing hurts more than an opportunity recognized but missed because of self-doubt. \nFor the typical trader, the only way out of this psychological dilemma is to ignore the risk and remain \nconvinced that the trade is right. If any of this sounds familiar, consider this: When you're convincing \nyourself that you're right, what you're saying to yourself is, \"I know who's in this market and who's \nabout to come into this market. I know what they believe about what is high or what is low. \nFurthermore, I know each individual's capacity to act on those beliefs (the degree of clarity or relative \nlack of inner conflict), and with this knowledge, I am able to determine how the actions of each of \nthese individuals will affect price movement in its collective form a second, a minute, an hour, a day, or \na week from now.\"  \nLooking at the process of convincing yourself that you're right from this perspective, it seems a bit \nabsurd, doesn't it? For the traders who have learned to think in probabilities, there is no dilemma. \nPredefining the risk doesn't pose a problem for these traders because they don't trade from a right or \nwrong perspective. They have learned that trading doesn't have anything to do with being right or \nwrong on any individual trade. As a result, they don't perceive the risks of trading in the same way the \ntypical trader does. Any of the best traders (the probability thinkers) could have just as much negative \nenergy surrounding what it means to be wrong as the typical trader.  \nBut as long as they legitimately define trading as a probability game, their emotional responses to the \noutcome of any particular trade are equivalent to how the typical trader would feel about flipping a \ncoin, calling heads, and seeing the coin come up tails. A wrong call, but for most people being wrong \nabout predicting the flip of a coin would not tap them into the accumulated pain of every other time in \ntheir lives they had been wrong. Why? Most people know that the outcome of a coin toss is random. If \nyou believe the outcome is random, then you naturally expect a random outcome. Randomness implies \nat least some degree of uncertainty. So when we believe in a random outcome, there is an implied \nacceptance that we don't know what that outcome will be. When we accept in advance of an event that \nwe don't know how it will turn out, that acceptance has the effect of keeping our expectations neutral \nand open-ended. Now we're getting down to the very core of what ails the typical trader. Any \nexpectation about the markets behavior that is specific, well-defined, or rigid—instead of being neutral \n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 88,
      "text": "and open-ended—is unrealistic and potentially damaging. I define an unrealistic expectation as one that \ndoes not correspond with the possibilities available from the market's perspective. If each moment in \nthe market is unique, and anything is possible, then any expectation that does not reflect these \nboundary-less characteristics is unrealistic.  \n \nMANAGING EXPECTATIONS \n \nThe potential damage caused by holding unrealistic expectations comes from how it affects the way we \nperceive information. Expectations are mental representations of what some future moment will look, \nsound, taste, smell, or feel like. Expectations come from what we know. This makes sense, because we \ncan't expect something that we have no knowledge or awareness of. What we know is synonymous \nwith what we have learned to believe about the ways in which the external environment can express \nitself. What we believe is our own personal version of the truth. When we expect something, we are \nprojecting out into the future what we believe to be true.  \nWe are expecting the outside environment a minute, an hour, a day, a week, or a month from now to be \nthe way we have represented it in our minds. We have to be careful about what we project out into the \nfuture, because nothing else has the potential to create more unhappiness and emotional misery than an \nunfulfilled expectation. When things happen exactly as you expect them to, how do you feel? The \nresponse is generally wonderful (including feelings like happiness, joy, satisfaction, and a greater sense \nof well-being), unless, of course, you were expecting something dreadful and it manifested itself. \nConversely, how do you feel when your expectations are not fulfilled? The universal response is \nemotional pain.  \nEveryone experiences some degree of anger, resentment, despair, regret, disappointment, \ndissatisfaction, or betrayal when the environment doesn't turn out to be exactly as we expected it to be \n(unless, of course, we are completely surprised by something much better than we imagined). Here's \nwhere we run into problems. Because our expectations come from what we know, when we decide or \nbelieve that we know something, we naturally expect to be right. At that point, we're no longer in a \nneutral or open state of mind, and it's not difficult to understand why. If we're going to feel great if the \nmarket does what we expect it to do, or feel horrible if it doesn't, then we're not exactly neutral or open-\nminded. Quite the contrary, the force of the belief behind the expectation will cause us to perceive \nmarket information in a way that confirms what we expect (we naturally like feeling good); and our \npain-avoidance mechanisms will shield us from information that doesn't confirm what we expect (to \nkeep us from feeling bad).  \nAs I've already indicated, our minds are designed to help us avoid pain, both physical and emotional. \nThese pain-avoidance mechanisms exist at both conscious and subconscious levels. For example, if an \nobject is coming toward your head, you react instinctively to get out of the way. Ducking does not \nrequire a conscious decision-making process. On the other hand, if you clearly see the object and have \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 89,
      "text": "time to consider the alternatives, you may decide to catch the object, bat it away with your hand, or \nduck. These are examples of how we protect ourselves from physical pain. Protecting ourselves from \nemotional or mental pain works in the same way, except that we are now protecting ourselves from \ninformation. For example, the market expresses information about itself and its potential to move in a \nparticular direction. If there's a difference between what we want or expect and what the market is \noffering or making available, then our pain-avoidance mechanisms kick in to compensate for the \ndifferences. As with physical pain, these mechanisms operate at both the conscious and subconscious \nlevels.  \nTo protect ourselves from painful information at the conscious level, we rationalize, justify, make \nexcuses, willfully gather information that will neutralize the significance of the conflicting information, \nget angry (to ward off the conflicting information), or just plain lie to ourselves. At the subconscious \nlevel, the pain-avoidance process is much more subtle and mysterious. At this level, our minds may \nblock our ability to see other alternatives, even though in other circumstances we would be able to \nperceive them. Now, because they are in conflict with what we want or expect, our pain-avoidance \nmechanisms can make them disappear (as if they didn't exist). To illustrate this phenomenon, the best \nexample is one I have already given you: We are in a trade where the market is moving against us. In \nfact, the market has established a trend in the opposite direction to what we want or expect. Ordinarily, \nwe would have no problem identifying or perceiving this pattern if it weren't for the fact that the market \nwas moving against our position. But the pattern loses its significance (becomes invisible) because we \nfind it too painful to acknowledge.  \nTo avoid the pain, we narrow our focus of attention and concentrate on information that keeps us out of \npain, regardless of how insignificant or minute. In the meantime, the information that clearly indicates \nthe presence of a trend and the opportunity to trade in the direction of that trend becomes invisible. The \ntrend doesn't disappear from physical reality, but our ability to perceive it does. Our pain-avoidance \nmechanisms block our ability to define and interpret what the market is doing as a trend. The trend will \nthen stay invisible until the market either reverses in our favor or we are forced out of the trade because \nthe pressure of losing too much money becomes unbearable. It's not until we are either out of the trade \nor out of danger that the trend becomes apparent, as well as all the opportunities to make money by \ntrading in the  \nAll the distinctions that would otherwise be perceivable become perfectly clear, after the fact, when \nthere is no longer anything for our minds to protect us from. We all have the potential to engage in self-\nprotective painavoidance mechanisms, because they're natural functions of the way our minds operate. \nThere may be times when we are protecting ourselves from information that has the potential to bring \nup deepseated emotional wounds or trauma that we're just not ready to face, or don't have the \nappropriate skills or resources to deal with. In these cases, our natural mechanisms are serving us well. \nBut more often, our pain-avoidance mechanisms are just protecting us from information that would \nindicate that our expectations do not correspond with what is available from the environments \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 90,
      "text": "perspective. This is where our pain-avoidance mechanisms do us a disservice, especially as traders. To \nunderstand this concept, ask yourself what exactly about market information is threatening. Is it \nthreatening because the market actually expresses negatively charged information as an inherent \ncharacteristic of the way it exists? \nIt may seem that way, but at the most fundamental level, what the market gives us to perceive are \nuptics and down-tics or up-bars and down-bars. These up and down tics form patterns that represent \nedges. Now, are any of these tics or the patterns they form negatively charged? Again, it may certainly \nseem that way, but from the market's perspective the information is neutral. Each up-tic, down-tic, or \npattern is just information, telling us the market's position. If any of this information had a negative \ncharge as an inherent characteristic of the way it exists, then wouldn't everyone exposed to it \nexperience emotional pain? For example, if both you and I get hit on the head with a solid object, there \nprobably wouldn't be much difference in how we would feel. We'd both be in pain. Any part of our \nbodies coming into contact with a solid object with some degree of force will cause anyone with a \nnormal nervous system to experience pain.  \nWe share the experience because our bodies are constructed in basically the same way. The pain is an \nautomatic physiological response to the impact with a tangible object. Information in the form of words \nor gestures expressed by the environment, or up and down tics expressed by the market, can be just as \npainful as being hit with a solid object; but there's an important difference between information and \nobjects. Information is not tangible. Information doesn't consist of atoms and molecules. To experience \nthe potential effects of information, whether negative or positive, requires an interpretation. The \ninterpretations we make are functions of our unique mental frameworks. Everyone's mental framework \nis unique for two fundamental reasons.  \nFirst, all of us were born with different genetically encoded behavior and personality characteristics \nthat cause us to have different needs from one another. How positively or negatively and to what \ndegree the environment responds to these needs creates experiences unique to each individual. Second, \neveryone is exposed to a variety of environmental forces. Some of these forces are similar from one \nindividual to the next, but none are exactly the same. If you consider the number of possible \ncombinations of genetically encoded personality characteristics we can be born with, in relation to the \nalmost infinite variety of environmental forces we can encounter throughout our lives, all of which \ncontribute to the construction of our mental framework, then it's not difficult to see why there is no \nuniversal mental framework common to everyone.  \nUnlike our bodies, which have a common molecular structure that experiences physical pain, there is \nno universal mind-set to assure us that we will share the potential negative or positive effects of \ninformation in the same way. For example, someone could be projecting insults at you, intending to \ncause you to feel emotional pain. From the environment's perspective, this is negatively charged \ninformation. Will you experience the intended negative effects? Not necessarily! You have to be able to \ninterpret the information as negative to experience it as negative. What if this person is insulting you in \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 91,
      "text": "a language you don't understand, or is using words you don't know the meaning of? Would you feel the \nintended pain? Not until you built a framework to define and understand the words in a derogatory \nway. Even then, we can't assume that what you'd feel would correspond to the intent behind the insult. \nYou could have a framework to perceive the negative intent, but instead of feeling pain, you might \nexperience a perverse type of pleasure. I've encountered many people who, simply for their own \namusement, like to get people riled up with negative emotions.  \nIf they happen to be insulted in the process, it creates a sense of joy because then they know how \nsuccessful they've been. A person expressing genuine love is projecting positively charged information \ninto the environment. Let's say the intent behind the expression of these positive feelings is to convey \naffection, endearment, and friendship. Are there any assurances that the person or persons this \npositively charged information is being projected toward will interpret and experience it as such? No, \nthere aren't. A person with a very low sense of self-esteem, or someone who experienced a great deal of \nhurt and disappointment in relationships, will often misinterpret an expression of genuine love as \nsomething else. In the case of a person with low self-esteem, if he doesn't believe he deserves to be \nloved in such a way, he will find it difficult, if not impossible, to interpret what he is being offered as \ngenuine or real. In the second case, where one has a significant backlog of hurt and disappointment in \nrelationships, a person could easily come to believe that a genuine expression of love is extremely rare, \nif not non-existent, and would probably interpret the situation either as someone wanting something or \ntrying to take advantage of him in some way.  \nI'm sure that I don't have to go on and on, sighting examples of all the possible ways there are to \nmisinterpret what someone is trying to communicate to us or how what we express to someone can be \nmisconstrued and experienced in ways completely unintended by us. The point that I am making is that \neach individual will define, interpret, and consequently experience whatever information he is exposed \nto in his own unique way. There's no standardized way to experience what the environment may be \noffering—whether it's positive, neutral, or negative information—simply because there is no \nstandardized mental framework in which to perceive information. Consider that, as traders, the market \noffers us something to perceive at each moment. In a sense, you could say that the market is \ncommunicating with us.  \nIf we start out with the premise that the market does not generate negatively charged information as an \ninherent characteristic of the way it exists, we can then ask, and answer, the question, \"What causes \ninformation to take on a negative quality?\" In other words, where exactly does the threat of pain come \nfrom? If it's not coming from the market, then it has to be coming from the way we define and interpret \nthe available information. Defining and interpreting information is a function of what we assume we \nknow or what we believe to be true. If what we know or believe is in fact true—and we wouldn't \nbelieve it if it weren't—then when we project our beliefs out into some future moment as an \nexpectation, we naturally expect to be right. When we expect to be right, any information that doesn't \nconfirm our version of the truth automatically becomes threatening. Any information that has the \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 92,
      "text": "potential to be threatening also has the potential to be blocked, distorted, or diminished in significance \nby our pain-avoidance mechanisms.  \nIt's this particular characteristic of the way our minds function that can really do us a disservice. As \ntraders, we can't afford to let our pain-avoidance mechanisms cut us off from what the market is \ncommunicating to us about what is available in the way of the next opportunity to get in, get out, add \nto, or subtract from a position, just because it's doing something that we don't want or expect. For \nexample, when you're watching a market (one you rarely, if ever, trade in) with no intention of doing \nanything, do any of the up or down tics cause you to feel angry, disappointed, frustrated, disillusioned, \nor betrayed in any way? No! The reason is that there's nothing at stake. You're simply observing \ninformation that tells you where the market is at that moment. If the up and down tics that you're \nwatching form into some sort of behavior pattern you've learned to identify, don't you readily recognize \nand acknowledge the pattern? Yes, for the same reason: There's nothing at stake.  \nThere is nothing at stake because there's no expectation. You haven't projected what you believe, \nassume, or think you know about that market into some future moment. As a result, there's nothing to \nbe either right about or wrong about, so the information has no potential to take on a threatening or \nnegatively charged quality. With no particular expectation, you haven't placed any boundaries on how \nthe market can express itself. Without any mental boundaries, you will be making yourself available to \nperceive everything you've learned about the nature of the ways in which the market moves.  \nThere's nothing for your pain-avoidance mechanisms to exclude, distort, or diminish from your \nawareness in order to protect you. In my workshops, I always ask participants to resolve the following \nprimary trading paradox: In what way does a trader have to learn how to be rigid and flexible at the \nsame time? The answer is: We have to be rigid in our rules and flexible in our expectations. We need to \nbe rigid in our rules so that we gain a sense of self-trust that can, and will always, protect us in an \nenvironment that has few, if any, boundaries. We need to be flexible in our expectations so we can \nperceive, with the greatest degree of clarity and objectivity, what the market is communicating to us \nfrom its perspective. At this point, it probably goes without saying that the typical trader does just the \nopposite: He is flexible in his rules and rigid in his expectations. Interestingly enough, the more rigid \nthe expectation, the more he has to either bend, violate, or break his rules in order to accommodate his \nunwillingness to give up what he wants in favor of what the market is offering.  \n \nELIMINATING THE EMOTIONAL RISK \n \nTo eliminate the emotional risk of trading, you have to neutralize your expectations about what the \nmarket will or will not do at any given moment or in any given situation. You can do this by being \nwilling to think from the markets perspective. Remember, the market is always communicating in \nprobabilities. At the collective level, your edge may look perfect in every respect; but at the individual \nlevel, every trader who has the potential to act as a force on price movement can negate the positive \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 93,
      "text": "outcome of that edge. To think in probabilities, you have to create a mental framework or mind-set that \nis consistent with the underlying principles of a probabilistic environment. A probabilistic mind-set \npertaining to trading consists of five fundamental truths.  \n1. Anything can happen.  \n2. You don't need to know what is going to happen next in order to make money.  \n3. There is a random distribution between wins and losses for any given set of variables that define an \nedge.\n4. An edge is nothing more than an indication of a higher probability of one thing happening over \nanother.  \n5. Every moment in the market is unique.  \nKeep in mind that your potential to experience emotional pain comes from the way you define and \ninterpret the information you're exposed to. When you adopt these five truths, your expectations will \nalways be in line with the psychological realities of the market environment. With the appropriate \nexpectations, you will eliminate your potential to define and interpret market information as either \npainful or threatening, and you thereby effectively neutralize the emotional risk of trading. The idea is \nto create a carefree state of mind that completely accepts the fact that there are always unknown forces \noperating in the market. When you make these truths a fully functional part of your belief system, the \nrational part of your mind will defend these truths in the same way it defends any other belief you hold \nabout the nature of trading.  \nThis means that, at least at the rational level, your mind will automatically defend against the idea or \nassumption that you can know for sure what will happen next. It's a contradiction to believe that each \ntrade is a unique event with an uncertain outcome and random in relationship to any other trade made \nin the past; and at the same time to believe you know for sure what will happen next and to expect to be \nright. If you really believe in an uncertain outcome, then you also have to expect that virtually anything \ncan happen. Otherwise, the moment you let your mind hold onto the notion that you know, you stop \ntaking all of the unknown variables into consideration. Your mind won't let you have it both ways. If \nyou believe you know something, the moment is no longer unique.  \nIf the moment isn't unique, then everything is known or knowable; that is, there's nothing not to know. \nHowever, the moment you stop factoring in what you don't or can't know about the situation instead of \nbeing available to perceive what the market is offering, you make yourself susceptible to all of the \ntypical trading errors. For example, if you really believed in an uncertain outcome, would you ever \nconsider putting on a trade without defining your risk in advance? Would you ever hesitate to cut a \nloss, if you really believed you didn't know? What about trading errors like jumping the gun? How \ncould you anticipate a signal that hasn't yet manifested itself in the market, if you weren't convinced \nthat you were going to miss out? Why would you ever let a winning trade turn into a loser, or not have \n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 94,
      "text": "a systematic way of taking profits, if you weren't convinced the market was going your way \nindefinitely? Why would you hesitate to take a trade or not put it on at all, unless you were convinced \nthat it was a loser when the market was at your original entiy point? Why would you break your money \nmanagement rules by trading too large a position relative to your equity or emotional tolerance to \nsustain a loss, if you weren't positive that you had a sure thing? Finally, if you really believed in a \nrandom distribution between wins and losses, could you ever feel betrayed by the market? If you \nflipped a coin and guessed right, you wouldn't necessarily expect to be right on the next flip simply \nbecause you were right on the last.  \nNor would you expect to be wrong on the next flip if you were wrong on the last. Because you believe \nin a random distribution between the sequence of heads and tails, your expectations would be perfectly \naligned with the reality of the situation. You would certainly like to be right, and if you were that \nwould be great, but if you were wrong then you would not feel betrayed by the flip, because you know \nand accept that there are unknown variables at work that affect the outcome. Unknown means \"not \nsomething your rational thinking process can take into consideration in advance of the Hi-r\" ?jXCi>v'L \n^ fu!Iv accept that you don't know As a result, there is little, if any, potential to experience the kind of \nemotional pain that wells up when you feel betrayed. As a trader, when you're expecting a random \noutcome, you will always be at least a little surprised at whatever the market does— even if it conforms \nexactly to your definition of an edge and you end up with a winning trade. However expecting a \nrandom outcome doesn't mean that you can't use your full reasoning and analytical abilities to project \nan outcome, or that you can't guess what's going to happen next, or have a hunch or feeling about it, \nbecause you can. Furthermore, you can be right in each instance.  \nYou just can't expect to be right. And if you are right, you can't expect that whatever you did that \nworked the last time will work again the next time, even though the situation may look, sound, or feel \nexactly the same. Anything that you are perceiving \"now\" in the market will never be exactly the same \nas some previous experience that exists in your mental environment. But that doesn't mean that your \nmind (as a natural characteristic of the way it functions) won't try to make the two identical. There will \nbe similarities between the \"now moment\" and something that you know from the past, but those \nsimilarities only give you something to work with by putting the odds of success in your favor. If you \napproach trading from the perspective that you don't know what will happen next, you will circumvent \nyour mind's natural inclination to make the \"now moment\" identical to some earlier experience.  \nAs unnatural as it seems to do so, you can't let some previous experience (either negative or extremely \npositive) dictate your state of mind. If you do, it will be very difficult, if not impossible, to perceive \nwhat the market is communicating from its perspective. When I put on a trade, all I expect is that \nsomething will happen. Regardless of how good I think my edge is, I expect nothing more than for the \nmarket to move or to express itself in some way. However, there are some things that I do know for \nsure. I know that based on the markets past behavior, the odds of it moving in the direction of my trade \nare good or acceptable, at least in relationship to how much I am willing to spend to find out if it does. I \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 95,
      "text": "also know before getting into a trade how much I am willing to let the market move against my \nposition. There is always a point at which the odds of success are greatly diminished in relation to the \nprofit potential. At that point, it's not worth spending any more money to find out if the trade is going \nto work. If the market reaches that point, I know without any doubt, hesitation, or internal conflict that I \nwill exit the trade.  \nThe loss doesn't create any emotional damage, because I don't interpret the experience negatively. To \nme, losses are simply the cost of doing business or the amount of money I need to spend to make \nmyself available for the winning trades. If, on the other hand, the trade turns out to be a winner, in most \ncases I know for sure at what point I am going to take my profits. (If I don't know for sure, I certainly \nhave a veiy good idea.) The best traders are in the \"now moment\" because there's no stress. There's no \nstress because there's nothing at risk other than the amount of money they are willing to spend on a \ntrade. They are not trying to be right or trying to avoid being wrong; neither are they trying to prove \nanything. If and when the market tells them that their edges aren't working or that it's time to take \nprofits, their minds do nothing to block this information. They completely accept what the market is \noffering them, and they wait for the next edge. CHAP \nTER 8  \nCHAPTER 8 \n \nWORKING WITH YOUR BELIEFS \n \nNow the task before you is to properly integrate the five fundamental truths presented in Chapter 7 in \nyour mental environment at a functional level. To help you do that, we will take an in-depth look at \nbeliefs—their nature, properties, and characteristics. However, before we do that I will review and \norganize the major concepts presented thus far into a much clearer and more practical framework. What \nyou learn from this and the next two chapters will form the foundation for understanding everything \nyou need to do to achieve your goals as a trader.  \n \nDEFINING THE PROBLEM \n \nAt the most fundamental level, the market is simply a series of up and down tics that form patterns. \nTechnical analysis defines these patterns as edges. Any particular pattern defined as an edge is simply \nan indication that there is a higher probability that the market will move in one direction over the other. \nHowever, there is a major mental paradox here because a pattern implies consistency, or, at least, a \nconsistent outcome. But the reality is each pattern is a unique occurrence. They may look (or measure) \nexactly the same from one occurrence to the next, but the similarities are only on the surface. The \nunderlying force behind each pattern is traders, and the traders who contribute to the formation of one \n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 96,
      "text": "pattern are always different from the traders who contribute to the next; so the outcome of each pattern \nis random relative to one another.  \nOur minds have an inherent design characteristic (the association mechanism) that can make this \nparadox difficult to deal with. Now these edges, or the patterns they represent, flow by in every time \nframe, making the market a never-ending stream of opportunities to get in, get out (scratch a trade), \ntake profits, cut losses, or add to or detract from a position. In other words, from the market's \nperspective, each moment presents each one of us traders with the opportunity to do something on our \nown behalf.  \n \nDEFINING THE TERMS \n \nWhat prevents us from perceiving each \"now moment\" as an opportunity to do something for ourselves \nor to act appropriately even when we do? Our fears! What is the source of our fears? We know its not \nthe market, because from the market's perspective, the up and down tics and the patterns they create are \nneither positively or negatively charged.  \nAs a result, the up and down tics themselves have no capacity to cause us to enter into any particular \nstate of mind (negative or positive), lose our objectivity, make errors, or take us out of the opportunity \nflow. If it's not the market that causes us to experience a negatively charged state of mind, then what \ndoes cause it? The way we define and interpret the information we perceive. If that's the case, then \nwhat determines what we perceive and how we define and interpret that information? What we believe \nor what we assume to be true. Our beliefs working in conjunction with the association and pain-\navoidance mechanisms act as a force on our five senses, causing us to perceive, define, and interpret \nmarket information in a way that is consistent with what we expect. What we expect is synonymous \nwith.what we believe or assume to be true. Expectations are beliefs projected into some future moment.  \nEach moment from the market's perspective is unique; but if the information being generated by the \nmarket is similar in quality, properties, or characteristic to something that is already in our minds, the \ntwo sets of information (outside and inside) automatically become linked. When this connection is \nmade, it triggers a state of mind (confidence, euphoria, fear, terror, disappointment, regret, betrayal, \netc.) that corresponds to whatever belief, assumption, or memory the outside information was linked. \nThis makes it seem as if what is outside is exactly the same as whatever is already inside of us. It's our \nstate of mind that makes the truth of whatever we're perceiving outside of us (in the market) seem \nindisputable and beyond question.  \nOur state of mind is always the absolute truth. If I feel confident, then I am confident. If I feel afraid, \nthen I am afraid. We can't dispute the quality of energy flowing through our mind and body at any \ngiven moment. And because I know as an indisputable fact how I feel, you could say that I also know \nthe truth of what I'm perceiving outside of me in the same moment. The problem is that how we feel is \nalways the absolute truth, but the beliefs that triggered our state of mind or feeling may or may not be \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 97,
      "text": "true relative to the possibilities that exist in the market at any given moment. Recall the example of the \nboy and the dog.  \nThe boy \"knew\" for an absolute fact that each dog he encountered after the first was threatening, \nbecause of the way he felt when one came into his field of awareness. These other dogs did not cause \nhis fear; his negatively charged memory working in conjunction with the association and his pain-\navoidance mechanism caused his fear. He experienced his own version of the truth, although that did \nnot correspond with the possibilities that existed from the environment's perspective. His belief about \nthe nature of dogs was limited relative to the possible characteristics and traits expressed by dogs. Yet \nthe state of mind he experienced eveiy time he encountered a dog caused him to believe thats he \n\"knew\" exactly what to expect from them.  \nThis same process causes us to believe that we \"know\" exactly what to expect from die market, when \nthe reality is there are always unknown forces operating at every moment. The trouble is, the instant we \nthink we \"know\" what to expect, we simultaneously stop taking all the unknown forces and die various \npossibilities created by those forces into consideration. The unknown forces are other traders waiting to \nenter or exit trades, based on their beliefs about the future. In other words, we really can't know exactly \nwhat to expect from the market, until we can read the minds of all the traders who have the potential to \nact as a force on price movement. Not a very likely possibility. As traders, we can't afford to indulge \nourselves in any form of \"I know what to expect from the market.\" We can \"know\" exactly what an \nedge looks, sounds, or feels like, and we can \"know\" exactly how much we need to risk to find out if \nthat edge is going to work.  \nWe can \"know\" that we have a specific plan as to how we are going to take profits if a trade works. But \nthat's it! If what we think we know starts expanding to what the market is going to do, we're in trouble. \nAnd all that's required to put us into a negatively charged, \"I know what to expect from the market\" \nstate of mind is for any belief, memoiy, or attitude to cause us to interpret the up and down tics or any \nmarket information as anything but an opportunity to do something on our own behalf.  \nWhat Are the Objectives? Ultimately, of course, making money is everyone's objective. But if trading \nwere only a matter of making money, reading this book wouldn't be necessary. Putting on a winning \ntrade or even a series of winning trades requires absolutely no skill. On the other hand, creating \nconsistent results and being able to keep what we've created does require skill. Making money \nconsistently is a by-product of acquiring and mastering certain mental skills. The degree to which you \nunderstand this is the same degree to which you will stop focusing on the money and focus instead on \nhow you can use your trading as a tool to master these skills.  \nWhat Are the Skills? Consistency is the result of a carefree, objective state of mind, where we are \nmaking ourselves available to perceive and act upon whatever the market is offering us (from its \nperspective) in any given \"now moment.\"  \nWhat Is a Carefree State of Mind? Carefree means confident, but not euphoric. When you are in a \ncarefree state of mind, you won't feel any fear, hesitation, or compulsion to do anything, because \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 98,
      "text": "you've effectively eliminated the potential to define and interpret market information as threatening. To \nremove the sense of threat, you have to accept the risk completely. When you have accepted the risk, \nyou will be at peace with any outcome. To be at peace with any outcome, you must reconcile anything \nin your mental environment that conflicts with the five fundamental truths about the market. What's \nmore, you also have to integrate these truths into your mental system as core beliefs.  \nWhat Is Objectivity? Objectivity is a state of mind where you have conscious access to everything \nyou have learned about the nature of market movement. In other words, nothing is being blocked or \naltered by your painavoidance mechanisms.  \nWhat Does it Mean to Make Yourself Available? Making yourself available means trading from the \nperspective that you have nothing to prove. You aren't trying to win or to avoid losing. You aren't \ntrying get your money back or to take revenge on the market. In other words, you come to the market \nwith no agenda other than to let it unfold in any way that it chooses and to be in the best state of mind \nto recognize and take advantage of the opportunities it makes available to you.  \nWhat Is the \"Now Moment'? Trading in the \"now moment\" means that there is no potential to \nassociate an opportunity to get into, get out of, add too, or detract from a trade with a past experience \nthat already exists in your mental environment.  \n \nHOW THE FUNDAMENTAL TRUTHS RELATE TO THE SKILLS \n \n1. Anything can happen. Why? Because there are always unknown forces operating in every market at \nevery moment, it takes only one trader somewhere in the world to negate the positive outcome of your \nedge. That's all: only one. Regardless of how much time, effort, or money you've invested in your \nanalysis, from the market's perspective there are no exceptions to this truth. Any exceptions that may \nexist in your mind will be a source of conflict and potentially cause you to perceive market information \nas threatening.  \n2. You don't need to know what is going to happen next in order to make money. Why? Because \nthere is a random distribution between wins and losses for any given set of variables that define an \nedge. (See number 3.) In other words, based on the past performance of your edge, you may know that \nout of the next 20 trades, 12 will be winners and 8 will be losers. What you don't know is the sequence \nof wins and losses or how much money the market is going to make available on the winning trades. \nThis truth makes trading a probability or numbers game.  \nWhen you really believe that trading is simply a probability game, concepts like right and wrong or win \nand lose no longer have the same significance. As a result, your expectations will be in harmony with \nthe possibilities. Keep in mind that nothing has more potential to cause emotional discord than our \nunfulfilled expectations. Emotional pain is the universal response when the outside world expresses \nitself in a way that doesn't reflect what we expect or believe to be true. As a result, any market \ninformation that does not confirm our expectations is automatically defined and interpreted as \n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 99,
      "text": "threatening. That interpretation causes us to adopt a negatively charged, defensive state of mind, where \nwe end up creating the very experience we are trying to avoid. Market information is only threatening \nif you are expecting the market to do something for you.  \nOtherwise, if you don't expect the market to make you right, you have no reason to be afraid of being \nwrong. If you don't expect the market to make you a winner, you have no reason to be afraid of losing. \nIf you don't expect the market to keep going in your direction indefinitely, there is no reason to leave \nmoney on the table. Finally, if you don't expect to be able to take advantage of every opportunity just \nbecause you perceived it and it presented itself, you have no reason to be afraid of missing out. On the \nother hand, if you believe that all you need to know is:  \n1. the odds are in your favor before you put on a trade;  \n2. how much it's going to cost to find out if the trade is going to work;  \n3. you don't need to know what's going to happen next to make money on that trade; and  \n4. anything can happen;  \nThen how can the market make you wrong? What information could the market generate about itself \nthat would cause your pain-avoidance mechanisms to kick in so that you exclude that information from \nyour awareness? None that I can think of.  \nIf you believe that anything can happen and that you don't need to know what is going to happen next \nto make money, then you will always be right. Your expectations will always be in harmony with the \nconditions as they exist from the market's perspective, effectively neutralizing your potential to \nexperience emotional pain. By the same token, how can a losing trade or even a series of losers have \nthe typical negative effect, if you really believe that trading is a probability or numbers game? If your \nedge puts the odds in your favor, then every loss puts you that much closer to a win. When you really \nbelieve this, your response to a losing trade will no longer take on a negative emotional quality.  \n3. There is a random distribution between wins and losses for any given set of variables that define \nan edge. \n If every loss puts you that much closer to a win, you will be looking forward to the next occurrence of \nyour edge, ready and waiting to jump in without the slightest reservation or hesitation. On the other \nhand, if you still believe that trading is about analysis or about being right, then after a loss you will \nanticipate the occurrence of your next edge with trepidation, wondering if it's going to work. This, in \nturn, will cause you to start gathering evidence for or against the trade. You will gather evidence for the \ntrade if your fear of missing out is greater than your fear of losing. And you will gather information \nagainst the trade if your fear of losing is greater than your fear of missing out. In either case, you will \nnot be in the most conducive state of mind to produce consistent results.  \n4. An edge is nothing more than an indication of a higher probability of one thing happening over \nanother.  \nCreating consistency requires that you completely accept that trading isn't about hoping, wondering, or \ngathering evidence one way or the other to determine if the next trade is going to work. The only \n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 100,
      "text": "evidence you need to gather is whether the variables you use to define an edge are present at any given \nmoment. When you use \"other\" information, outside the parameters of your edge to decide whether you \nwill take the trade, you are adding random variables to your trading regime. \nAdding random variables makes it extremely difficult, if not impossible, to determine what works and \nwhat doesn't. If you're never certain about the viability of your edge, you won't feel too confident about \nit. To whatever degree you lack confidence, you will experience fear. The irony is, you will be afraid of \nrandom, inconsistent results, without realizing that your random, inconsistent approach is creating \nexactly what you are afraid of. On the other hand, if you believe that an edge is simply a higher \nprobability of one thing happening over another, and there's a random distribution between wins and \nlosses for any given set of variables that define an edge, why would you gather \"other\" evidence for or \nagainst a trade? To a trader operating out of these two beliefs, gathering \"other\" evidence wouldn't \nmake any sense.  \nOr let me put it this way: Gathering \"other\" evidence makes about as much sense as trying to determine \nwhether the next flip of a coin will be heads, after the last ten flips came up tails. Regardless of what \nevidence you find to support heads coming up, there is still a 50-percent chance that the next flip will \ncome up tails. By the same token, regardless of how much evidence you gather to support acting or not \nacting on a trade, it still only takes one trader somewhere in the world to negate the validity of any, if \nnot all, of your evidence. The point is why bother! If the market is offering you a legitimate edge, \ndetermine the risk and take the trade.  \n5. Every moment in the market is unique.  \nTake a moment and think about the concept of uniqueness. \"Unique\" means not like anything else that \nexists or has ever existed. As much as we may understand the concept of uniqueness, our minds don't \ndeal with it very well on a practical level. As we have already discussed, our minds are hardwired to \nautomatically associate (without conscious awareness) anything in the exterior environment that is \nsimilar to anything that is already inside of us in the form of a memory, belief, or attitude. This creates \nan inherent contradiction between the way we naturally think about the world and the way the world \nexists. No two moments in the external environment will ever exactly duplicate themselves. To do so, \nevery atom or every molecule would have to be in the exact same position they were in some previous \nmoment.  \nNot a very likely possibility. Yet, based on the way our minds are designed to process information, we \nwill experience the \"now moment\" in the environment as being exactly the same as some previous \nmoment as it exists inside our minds. If each moment is like no other, then there's nothing at the level \nof your rational experience that can tell you for sure that you \"know\" what will happen next. So I will \nsay again, why bother trying to know?! When you try to know, you are, in essence, trying to be right. I \nam not implying here that you can't predict what the market will do next and be right, because you \nmost certainly can. It's in the trying that you run into all of the problems. If you believe that you \ncorrectly predicted the market once, you will naturally try to do it again.  \n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 101,
      "text": "As a result, your mind will automatically start scanning the market for the same pattern, circumstance, \nor situation that existed the last time you correctly predicted its movement. When you find it, your state \nof mind will make it seem as if everything is exactly as it was the last time. The problem is that, from \nthe market's perspective, it is not the same. As a result, you are setting yourself up for disappointment. \nWhat separates the best traders from all the rest is that they have trained their minds to believe in the \nuniqueness of each moment (although this training usually takes the form of losing several fortunes \nbefore they \"really\" believe in the concept of uniqueness). This belief acts as a counteracting force, \nneutralizing the automatic association mechanism. When you truly believe that each moment is unique, \nthen by definition there isn't anything in your mind for the association mechanism to link that moment \nto. This belief acts as an internal force causing you to disassociate the \"now\" moment in the market \nfrom any previous moment filed away in your mental environment. The stronger your belief in the \nuniqueness of each moment, the lower your potential to associate. The lower your potential to \nassociate, the more open your mind will be to perceive what the market is offering you from its \nperspective.  \n \nMOVING TOWARD \"THE ZONE\" \n \nWhen you completely accept the psychological realities of the market, you will correspondingly accept \nthe risks of trading. When you accept the risks of trading, you eliminate the potential to define market \ninformation in painful ways. When you stop defining and interpreting market information in painful \nways, there is nothing for your mind to avoid, nothing to protect against.  \nWhen there's nothing to protect against, you will have access to all that you know about the nature of \nmarket movement. Nothing will get blocked, which means you will perceive all the possibilities you \nhave learned about (objectively), and since your mind is open to a true exchange of energy, you will \nquite naturally start discovering other possibilities (edges) that you formerly couldn't perceive. For your \nmind to be open to a true exchange of energy, you can't be in a state of knowing or believing that you \nalready know what's going to happen next. When you are at peace with not knowing what's going to \nhappen next, you can interact with the market from a perspective where you will be making yourself \navailable to let the market tell you, from its perspective, what is likely to happen next. At that point, \nyou will be in the best state of mind to spontaneously enter \"the zone,\" where you are tapped into the \n\"now moment opportunity flow.\" CHAPTER 9  \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 103,
      "text": "Now you have come to understand that you don't have to know what's going to happen next, and that \neven trying to know will detract from your ability to be objective or to stay in the moment. What we \nhave is a direct conflict between your old belief that you need to know what will happen next to be \nsuccessful and your new understanding that you don't need to know. Now, will your new understanding \nsuddenly neutralize all the time, money, and energy expended on reinforcing the belief that you \"need \nto know\"? I wish it were that easy. And for some lucky few, it may be. If you will recall in Chapter 4 \nwhen I talked about psychological distance in relationship to software code, I said that some traders \nmay already be so close to these new perspectives that all they need is to put together a few of the \nmissing pieces to create a mindaltering, \"ah, ha\" experience. However, based on my experience of \nworking with well over a thousand traders, I can say that most are not close to these perspectives at all. \nFor those of you who are not, it may take a considerable amount of mental work (over a considerable \namount of time) to properly integrate your new understandings about trading into your mental \nenvironment.  \nThe good news is that, ultimately, the exercise I present in Chapter 11 will install the five fundamental \ntruths and resolve many of the potential conflicts, but only if you know exactly what you are doing and \nwhy you are doing it. That is the subject of this and the next chapter.  \n \nTHE ORIGINS OF A BELIEF \n \nWhat can we learn about the nature of beliefs, and how can we use that knowledge to create a mind-set \nthat fosters our desire to be a consistently successful trader? These are the two questions I am going to \nfocus on answering in this chapter. First, let's look at the origin of our beliefs. As you may recall, \nmemories, distinctions, and beliefs exist in the form of energy— specifically, structured energy. \nEarlier, I lumped these three mental components together to illustrate:  \n \n1. that memories, distinctions, and beliefs do not exist as physical matter;  \n2. that the cause-and-effect relationship that exists between ourselves and the external environment \nbrings these components into existence; and  \n3. how the cause-and-effect relationship reverses so that we can perceive in the external environment \nwhat we have learned about.  \n \nTo get at the origins of our beliefs, we're going to have to unbundle these components to illustrate the \ndifference between a memory and a belief. The best way to do this is to imagine ourselves in the mind \nof an infant. I would think that at the very beginning of a child's life, the memories of his experiences \nwould exist in their purest form. By that I mean that the memories of what he has seen, heard, smelled, \ntouched, or tasted exist in his mind as pure sensory information that is not organized or attached to any \nspecific words or concepts. Therefore, I am going to define a pure memory as sensory information \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 106,
      "text": "to do now is give you an example I used in my first book, The Disciplined Trader, to illustrate the \nvarious functions of a belief. In the spring of 1987, I was watching a locally produced television \nprogram called \"Gotcha Chicago.\" It was about some local celebrities who played practical jokes on \none another. In one segment of the program, the TV station hired a man to stand on the sidewalk along \nMichigan Avenue holding a sign that read \"Free money. Today only.\" (For those of you who are not \nfamiliar with Chicago, Michigan Avenue is home to many fashionable, exclusive department stores and \nboutiques.) The TV station gave the man a considerable amount of cash, with instructions to give \nmoney to anyone who asked for it.  \nNow, when you consider that Michigan Avenue is one of the busiest areas of the city, and if we assume \nthat most of the people who passed the man on the street could read the sign, how many people would \nyou think took him up on his offer and asked for some money? Of all the people who walked by and \nread the sign, only one person stopped, and said, \"Great! May I have a quarter to buy a bus transfer?\" \nOtherwise, no one would even go near the man. Eventually, the man grew frustrated because people \nweren't reacting the way he expected them to. He started crying out, \"Do you want any money? Please \ntake my money; I can't give it away fast enough.\" Everyone just kept walking around him as if he didn't \nexist. In fact, I noticed that several people went out of their way to avoid him.  \nAs a man wearing a suit and carrying a briefcase approached, he went right up to him and said, \"Would \nyou like some money?\" The man responded, \"Not today.\" Really frustrated now, he shot back, \"How \nmany days does this happen? Would you please take this?\" as he tried to hand the man some cash. The \nman responded with a terse \"No\" and walked on. What was going on here? Why wouldn't anyone \n(except for the person who needed a bus transfer) ask for the money? If we assume that most or all of \nthe passersby could read the sign, but still didn't make any effort to get the money, then one possible \nexplanation for their behavior is that they just didn't care about money.  \nThis is extremely unlikely, though, considering how much of our lives is devoted to the pursuit of \nmoney. If we agree that people could read the sign and that money is very important to most of us, then \nwhat could have stopped these people from helping themselves? The environment was making \navailable an experience that most people would love to have: someone giving them money with no \nstrings attached. Yet everyone walked by, oblivious to what was awaiting them. They must not have \nbeen able to perceive what was available. That's hard to imagine, because the sign clearly stated \"Free \nmoney. Today only.\" However, it's not hard to imagine if you consider that most people have a belief \n(an energized concept about how the world works) that \"Free money doesn't exist.\" If free money really \ndoesn't exist, then how does someone reconcile the obvious contradiction between that belief and the \nsign saying that it does? That's easy, just decide the man with the sign is crazy; what else could account \nfor such bizarre behavior if, in fact, free money doesn't exist? The reasoning process that could \ncompensate for the contradiction might go something like this: \"Everyone knows getting money with \nno strings attached rarely happens.  \nCertainly not from a stranger on one of the busiest streets in the city. In fact, if the man were really \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 108,
      "text": "way is being told that we can't have something because it's too expensive.  \nHow many times does the typical child hear, \"Who do you think you are anyway? Money doesn't grow \non trees, you know.\" In other words, it is probably a negatively charged belief. So the experience of \nhaving money handed to him with no strings attached and without any negative comments would likely \ncreate a state of mind of pure elation. In fact, most people would be so happy that they'd feel compelled \nto share that happiness and this new discovery with everyone they knew. I can imagine him going back \nto his office or going home, and the moment he encounters someone he knows, the first words out of \nhis mouth will be “You won’t believe what happened to me today,\" and even though he desperately \nwants those he meets to believe his story, they probably won't. Why? Because their belief that free \nmoney doesn't exist will cause them to interpret his story in a way that negates its validity.  \nTo take this example a little further, imagine what would happen to this person's state of mind if it \noccurred to him that he could have asked for more money. He is in a state of pure elation. However, the \nmoment the thought either pops into his mind or someone he relates his story to offers the idea that he \ncould have asked for a lot more money, his state of mind will immediately shift to a negatively charged \nstate of regret or despair. Why? He tapped into a negatively charged belief about what it means to miss \nout on something or not get enough. As a result, instead of being happy over what he got, he will \nlament what he could have had but didn't get.  \n \nBELIEFS VS. THE TRUTH \n \nIn all three of these examples (including the hypothetical one), everybody experienced their own \nunique version of the situation. If asked, each person would describe what he or she experienced from \ntheir perspective, as if it were the only true and valid version of the reality of the situation. The \ncontradiction between these three versions of the truth suggests to me a larger philosophical issue that \nneeds to be resolved. If beliefs limit our awareness of the information being generated by the physical \nenvironment, so that what we perceive is consistent with whatever we believe, then how do we know \nwhat the truth is? To answer this question, we have to consider four ideas:  \n1. The environment can express itself in an infinite combination of ways. When you combine all the \nforces of nature interacting with everything created by humans, then add to that the forces generated by \nall the possible ways people can express themselves, the result is a number of possible versions of \nreality that would surelv overwhelm even the most onen-minded nerson. \n2. Until we have acquired the ability to perceive eveiy possible way in which the environment can \nexpress itself, our beliefs will always represent a limited version of what is possible from the \nenvironment's perspective, making our beliefs a statement about reality, but not necessarily a definitive \nstatement of reality.  \n3. If you find yourself taking exception to the second statement, then consider that if our beliefs were a \ntrue, 100-percent accurate reflection of physical reality, then our expectations would always be \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 112,
      "text": "If beliefs are energy—structured, conscious energy that is aware of its existence—then this same \nprinciple of physics can be applied to beliefs, meaning, if we tiy to eradicate them, it's not going to \nwork. If you knew someone or something was trying to destroy you, how would you respond? You \nwould defend yourself, fight back, and possibly become even stronger than you were before you \nknew of the threat. Each individual belief is a component of what we consider to be our identity. \nIsn't it reasonable to expect that, if threatened, each individual belief would respond in a way that \nwas consistent with how all the parts respond collectively? The same principle holds true if we tiy to \nact as if a particularly troublesome belief doesn't exist. If you woke up one morning and everyone \nyou knew ignored you and acted as if you didn't exist, how would you respond? It probably wouldn't \nbe long before you grabbed someone and got right in their face to try to force them to acknowledge \nyou. Again, if purposely ignored, each individual belief will act in the very same way. It will find a \nway to force its presence into our conscious thought process or behavior. The easiest and most \neffective way to work with our beliefs is to gently render them inactive or nonfunctional by drawing \nthe energy out of them. I call this process de-activation. After de-activation, the original structure of \nthe belief remains intact, so technically it hasn't changed. The difference is that the belief no longer \nhas any energy. Without energy, it doesn't have the potential to act as a force on our perception of \ninformation or on our behavior. Here is a personal illustration:  \nAs a young child, I was taught to believe in both Santa Claus and the Tooth Fairy. In my mental \nsystem, both of these are perfect examples of what are now inactive, nonfunctional beliefs. \nHowever, even though they are inactive, they still exist inside my mental system, only now they \nexist as concepts with no energy. If you recall from the last chapter, I defined beliefs as a \ncombination of sensory experience and words that form an energized concept. The energy can be \ndrawn out of the concept, but the concept itself remains intact, in its original form. However, \nwithout energy, it no ! T.gCI h-15 th? nOt?ptial to act on my perception of inforlYiation or on my \nbehavior. So, as I'm sitting here typing into my computer, if someone came up to me and said that \nSanta Claus was at the door, how do you think I would define and interpret this information? I \nwould treat it as being irrelevant or a joke, of course. However, if I were five years old and my \nmother told me that Santa Claus was at the front door, her words would have instantly tapped me \ninto a huge reservoir of positively charged energy that would have compelled me to jump up and run \nto the front door as fast as I could.  \nNothing would have been able to stop me. I would have overcome any obstacle in my path. At some \npoint, my parents told me Santa Claus didn't exist. Of course, my first reaction was disbelief. I didn't \nbelieve them, nor did I want to believe them. Eventually, they convinced me. However, the process \nof convincing me did not destroy my belief in Santa Claus or cause it not to exist any longer; it just \ntook all the energy out of the belief. The belief was transformed into a nonfunctional, inactive \nconcept about how the world works. I'm not sure where all that energy went, but I know that some \nof it was transferred to a belief that Santa Claus doesn't exist.  \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 118,
      "text": "and, as a result, you \"know\" that the next trade is simply another trade in a series of trades that has a \nprobable outcome. Yet you find you're still afraid to put that next trade on, or you're still susceptible \nto several of the fear-based trading errors we've discussed in previous chapters. Remember that the \nunderlying cause of fear is the potential to define and interpret market information as threatening. \nWhat is the source of our potential to interpret market information as threatening? Our expectations! \nWhen the market generates information that doesn't conform to what we expect, the up and down \ntics seem to take on a threatening quality (become negatively charged). Consequently, we \nexperience fear, stress, and anxiety. What is the underlying source of our expectations? Our beliefs.  \nIn light of what you now understand about the nature of beliefs, if you are still experiencing \nnegative states of mind when you trade, you can assume there's a conflict between what you \"know\" \nabout probable outcomes and any number of other beliefs in your mental environment that are \narguing (demanding expression) for something else. Keep in mind that all active beliefs demand \nexpression, even if we don't want them to. To think in probabilities, you have to believe that every \nmoment in the market is unique, or more specifically, that every edge has a unique outcome. When \nyou believe at a functional level that every edge has a unique outcome (meaning that it's a dominant \nbelief without any other beliefs arguing for something different), you will experience a state of mind \nthat is free of fear, stress, and anxiety when you trade. It really can't work any other way. A unique \noutcome is not something we have already experienced, therefore it is not something we can already \nknow. If it were known, it could not be defined as unique.  \nWhen you believe that you don't know what is going to happen next, what exactly are you expecting \nfrom the market? If you said \"I don't know,\" you are absolutely right. If you believe that something \nwill happen and that you don't need to know exactly what that something is to make money, then \nwhere s the potential to define and interpret market information as threatening and painful? If you \nsaid \"There is none,\" you are absolutely right again. Here is one more example of how beliefs \ndemand expression. Let's look at a situation where a child's first encounter with a dog was a very \npositive experience. As a result, he has absolutely no problem interacting with dogs (any dog for \nthat matter), because he has not encountered one that's unfriendly. Therefore, he has no concept (an \nenergized belief) that it is possible for a dog to inflict any damage or cause him to experience pain. \nAs he learns to associate words with his memories, he will probably acquire a belief along the lines \nof \"all dogs are friendly and fun.\" Therefore, every time a dog comes into his field of awareness, this \nbelief will demand expression. From the perspective of someone who fi with a do?, it will seem as if \nthis child has an attitude of reckless abandon.  \nIf you tried to convince the child that he'll get bitten someday if he doesn't exercise caution, his \nbelief will cause him to either discount or completely disregard your advice. His response would be \nsomething like \"No way!\" or \"It can't happen to me.\" Let's say at some point in his life he \napproaches an unfamiliar dog that wants to be left alone. The dog growls. The warning will go \nunheeded and the dog attacks the boy. From the perspective of the boy's belief system, he's just had \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 123,
      "text": "to be confronted with the rational part of themselves that consistently, argued for another course of \naction. Of course, if they had followed their intuition, they would have experienced a very satisfying \noutcome. Instead, what they ended up with was usually very unsatisfactory, especially when compared \nwith what they otherwise perceived as possible. The only way I know of that you can try to be intuitive \nis to work at setting up a state of mind most conducive to receiving and acting on your intuitive \nimpulses.  \n \nTHE MECHANICAL STAGE \n \nThe mechanical stage of trading is specifically designed to build the kind of trading skills (trust, \nconfidence, and thinking in probabilities) that will virtually compel you to create consistent results. I \ndefine consistent results as a steadily rising equity curve with only minor draw downs that are the \nnatural consequence of edges that didn't work. Other than finding a pattern that puts the odds of a \nwinning trade in your favor, achieving a steadily rising equity curve is a function of systematically \neliminating any susceptibility you may have to making the kind of fear, euphoric or self-valuation \nbased trading errors I have described throughout this book. Eliminating the errors and expanding your \nsense of self-valuation will require the acquisition of skills that are all psychological in nature.  \nThe skills are psychological because each one, in its purest form, is simply a belief. Remember that the \nbeliefs we operate out of will determine our state of mind and shape our experiences in ways that \nconstantly reinforce what we already believe to be true. How truthful a belief is (relative to the \nenvironmental conditions) can be determined by how well it serves us; that is, the degree to which it \nhelps us satisfy our objectives.  \nIf producing consistent results is your primary objective as a trader, then creating a belief (a conscious, \nenergized concept that resists change and demands expression) that \"I am a consistently successful \ntrader\" will act as a primaiy source of energy that will manage your perceptions, interpretations, \nexpectations, and actions in ways that satisfy the belief and, consequently, the objective. Creating a \ndominant belief that \"I am a consistently successful trader\" requires adherence to several principles of \nconsistent success. Some of these principles will undoubtedly be in direct conflict with some of the \nbeliefs you've already acquired about trading. If this is the case, then what you have is a classic \nexample of beliefs that are in direct conflict with desire. \nThe energy dynamic here is no different from what it was for the boy who wanted to be like the other \nchildren who were not afraid to play with dogs. He desired to express himself in a way that he found, at \nleast initially, virtually impossible. To satisfy his desire, he had to step into an active process of \ntransformation. His technique was simple: He tried as hard as he could to stay focused on what he was \ntrying to accomplish and, little by little, he de-activated the conflicting belief and strengthened the \nbelief that was consistent with his desire.  \nAt some point, if that is your desire, then you will have to step into the process of transforming yourself \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 124,
      "text": "into a consistent winner. When it comes to personal transformation, the most important ingredients are \nyour willingness to change, the clarity of your intent, and the strength of your desire. Ultimately, for \nthis process to work, you must choose consistency over eveiy other reason or justification you have for \ntrading. If all of these ingredients are sufficiently present, then regardless of the internal obstacles you \nfind yourself up against, what you desire will eventually prevail.  \n \nObserve Yourself \n \nThe first step in the process of creating consistency is to start noticing what you're thinking, saying, and \ndoing. Why? Because everything we think, say, or do as a trader contributes to and, therefore, \nreinforces some belief in our mental system. Because the process of becoming consistent is \npsychological in nature, it shouldn't come as a surprise that you'll have to start paying attention to your \nvarious psychological processes. The idea is eventually to learn to become an objective observer of \nyour own thoughts, words, and deeds. Your first line of defense against committing a trading error is to \ncatch yourself thinking about it. Of course, the last line of defense is to catch yourself in the act. If you \ndon't commit yourself to becoming an observer to these processes, your realizations will always come \nafter the experience, usually when you are in a state of deep regret and frustration.  \nObserving yourself objectively implies doing it without judging about yourself. This might not be so \neasy for some of you to do considering the harsh, judgmental treatment you may have received from \nother people throughout your life. As a result, one quickly learns to associate any mistake with \nemotional pain. No one likes to be in a state of emotional pain, so we typically avoid acknowledging \nwhat we have learned to define as a mistake for as long as possible.  \nNot confronting mistakes in our everyday lives usually doesn't have the same disastrous consequences \nit can have if we avoid confronting our mistakes as traders. For example, when I am working with floor \ntraders, the analogy I use to illustrate how precarious a situation they are in is to ask them to imagine \nthemselves walking across a bridge over the Grand Canyon. The width of the bridge is directly related \nto the number of contracts they trade. So, for example, for a one-contract trader the bridge is very wide, \nsay 20 feet. A bridge 20 feet wide allows you a great deal of tolerance for error, so you don't have to be \ninordinately careful or focused on each step you take. Still, if you do happen to stumble and trip over \nthe edge, the drop to the canyon floor is one mile.  \nI don't know how many people would walk across a narrow bridge with no guardrails, where the \nground is a mile down, but my guess is relatively few. Similarly, few people will take the kinds of risks \nassociated with trading on the floor of the futures exchanges. Certainly a one-contract floor trader can \ndo a great deal of damage to himself, not unlike falling off a mile-high bridge. But a one-contract trader \nalso can give himself a wide tolerance for errors, miscalculations, or unusually violent market moves \nwhere he could find himself on the wrong side. On the other hand, one of the biggest floor traders I \never worked with trades for his own account with an average position of 500 Treasury bond futures at a \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 125,
      "text": "time. He often puts on a position of well over a thousand contracts.  \nA position of 1,000 T-bond contracts amounts to $31,500 per tic (the smallest incremental price change \nthat a bond contract can make). Of course, T-bond futures can be very volatile and can trade several \ntics in either direction in a matter of seconds. As the size of a traders position increases, the width of \nour bridge over the Grand Canyon narrows. In the case of the large bond trader, the bridge has \nnarrowed to the size of a thin wire. Obviously, he has to be extremely well-balanced and very focused \non each step that he takes. The slightest misstep or gust of wind could cause him to fall off the wire. \nNext stop, one mile down. Now, when he's in the trading pit, that tiny misstep or slight gust of wind is \nthe equivalent to one distracting thought. That's all, just a thought or anything else where he allows \nhimself to lose his focus for even a second or two. In that moment of distraction, he could miss his last \nfavorable opportunity to liquidate his position.  \nThe next price level with enough volume to take him out of his trade could be several tics away, either \ncreating a huge loss or forcing him to give a substantial winning trade back to the market. If producing \nconsistent results is a function of eliminating errors, then it is an understatement to say that you will \nencounter great difficulty in achieving your objective if you can't acknowledge a mistake. Obviously, \nthis is something very few people can do, and it accounts for why there are so few consistent winners. \nIn fact, the tendency not to acknowledge a mistake is so pervasive throughout mankind, it could lead \none to assume that it's an inherent characteristic of human nature. I do not believe this is the case, nor \ndo I believe we are born with the capacity to ridicule or think less of ourselves for making a mistake, \nmiscalculation, or error. Making mistakes is a natural function of living and will continue to be until we \nreach a point at which:  \n \n1. all our beliefs are in absolute harmony with our desires, and  \n2. all our beliefs are structured in such a way that they are completely consistent with what works from \nthe environment's perspective.  \nObviously, if our beliefs are not consistent with what works from the environments perspective, the \npotential for making a mistake is high, if not inevitable. We won't be able to perceive the appropriate \nset of steps to our objective. Worse, we won't be able to perceive that what we want may not be \navailable, or available in the quantity we desire or at the time when we want it.  \nOn the other hand, mistakes that are the result of beliefs that are in conflict with our objectives aren't \nalways apparent or obvious. We know they will act as opposing forces, expressing their versions of the \ntruth on our consciousness, and they can do that in many ways.  \nThe most difficult to detect is a distracting thought that causes a momentary lapse in focus or \nconcentration. On the surface this may not sound significant. But, as in the analogy of the bridge over \nthe canyon, when there's a lot at stake, even a slightly diminished capacity to stay focused can result in \nan error of disastrous proportions. This principle applies whether it's trading, sporting events, or \ncomputer programming. When our intent is clear and undiminished by any opposing energy, then our \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 127,
      "text": "This means that if you're going to trade and not monitor yourself, but at the same time you desire \nconsistent results, then trading exclusively from the mechanical stage will resolve the dilemma.  \nOtherwise, learning how to monitor yourself is a relatively simple process once you have rid yourself \nof negatively charged energy associated with mistakes. In fact, it's easy. All you have to do is decide \nwhy you want to monitor yourself, which means you first need to have a clear purpose in mind. When \nyou're clear about your purpose, simply start directing your attention to what you think, say, or do.  \nIf and when you notice that you're not focused on your objective or on the incremental steps to \naccomplish your objective, choose to redirect your thoughts, words, or actions in a way that is \nconsistent with what you are trying to accomplish. Keep redirecting as often as necessary. The more \nwillfully you engage in this process, especially if you can do it with some degree of conviction, the \nfaster you will create a mental framework free to function in a way that is consistent with your \nobjectives, without any resistance from conflicting beliefs.  \n \nTHE ROLE OF SELF-DISCIPLINE \n \nI call the process I just described self-discipline. I define self-discipline as a mental technique to \nredirect (as best we can) our focus of attention to the object of our goal or desire, when that goal or \ndesire conflicts with some other component (belief) of our mental environment. The first thing you \nshould notice about this definition is that self-discipline is a technique to create a new mental \nframework. It is not a personality trait; people aren't born with self-discipline. In fact, when you \nconsider how I define it, being born with discipline isn't even possible. However, as a technique to be \nused in the process of personal transformation, anybody can choose to use self-discipline. Here is an \nexample from my life that illustrates the underlying dynamics of how this technique works. In 1978 I \ndecided that I wanted to become a runner.  \nI don't exactly remember what my underlying motivation was, except that I had spent the previous \neight years in a very inactive life style. I wasn't involved with any sports or hobbies, unless you call \nwatching television a hobby. Previously in both high school and at least part of college I was very \nactive in sports, especially ice hockey. However, coming out of college, my life was unfolding in the \nway that was very different from what I had expected. It was not to my liking, but at the time I felt \npowerless to do anything about it. This led to a period of inactivity, which is a nice way of saying that I \nwas severely depressed. Again, I'm not sure what prompted me to suddenly want to become a runner \n(maybe I saw some TV program that sparked my interest).  \nI do, however, remember that the motivation was verv strong. So, I went out and bought myself some \nrunning shoes, put them on, and went out to run. The first thing I discovered was that I couldn't do it. I \ndidn't have the physical stamina to run more than fifty or sixty yards. This was very surprising. I didn't \nrealize, nor would I have ever believed, that I was so out of shape that I couldn't run even a hundred \nyards. This realization was so disheartening that I didn't attempt to run again for two or three weeks. \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 129,
      "text": "But then, something really interesting and completely unanticipated happened before I got there. As I \ngot closer to fulfilling my five-mile objective, little by little, the conflicting thoughts began to dissipate. \nEventually they didn't exist at all. At that point, I found that if I wanted to run, I was completely free to \ndo so without any mental resistance, conflict, or competing thoughts. Given what a struggle it had been, \nI was amazed (to say the least). The result: I went on to run on a very regular basis for the next 16 \nyears. For those of you who may be interested, I don't run so much now because five years ago I \ndecided to start playing ice hockey again.  \nHockey is an extremely strenuous sport. Sometimes I play as many as four times a week. Considering \nmy age (over u\\j) and the level of exertion the sport requires, it usually takes me a day or two to \nrecover, which doesn't leave much room for running any more. Now, if you take these experiences and \nput them into the context of what we now understand about the nature of beliefs, there are a number of \nobservations we can make:  \n \n1. Initially, my desire to be a runner had no foundation of support in my mental system. In other words, \nthere was no other source of energy (an energized concept demanding expression) consistent with my \ndesire.  \n2. I actually had to do something to create that support. To create a belief that \"I am a runner\" required \nthat I create a series of experiences consistent with the new belief. Remember that everything we think, \nsay, or do contributes energy to some belief in our mental system. Each time I experienced a \nconflicting thought and was able to successfully refocus on my objective, with enough conviction to get \nme into my running shoes and out the door, I added energy to the belief that \"I am a runner.\" And, just \nas important, I inadvertently drew energy away from all of the beliefs that would argue otherwise. I say \ninadvertently because there are various techniques specifically designed to identify and de-activate \nconflicting beliefs, but at that time in my life, I didn't understand the underlying dynamics of the \nprocess of transformation I was going through. So, it wouldn't have occurred to me to avail myself of \nsuch techniques.  \n3. Now I can effortlessly (from a mental perspective) express myself as a runner, because \"I am a \nrunner.\" That energized concept is now a functioning part of my identity. When I first started out, I \nhappened to have a number of conflicting beliefs about running. As a result, I needed the technique of \nself-discipline to bfCCITic One. Now I don't need self-discipline because \"bHn\" a. rj^iicr\" 'c \"who I L -\n~o am.\" When our bfeliers are completely aligned with our goals or desires, there's no source of \nconflicting energy. If there's no source of conflicting energy, then there's no source of distracting \nthoughts, excuses, rationalizations, justifications, or mistakes (conscious or subconscious).  \n4. Beliefs can be changed, and if it's possible to change one belief, then it's possible to change any \nbelief, if you understand that you really aren't changing them, but are only transferring energy from one \nconcept to another. (The form of the belief targeted for change remains intact.) Therefore, two \ncompletely contradictory beliefs can exist in your mental system, side by side. But if you've drawn the \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 130,
      "text": "energy out of one belief and completely energized the other, no contradiction exists from a functional \nperspective; only the belief that the energy will have the capacity to act as a force on your state of \nmind, on your perception and interpretation of information, and your behavior. Now, the sole purpose \nof trading mechanically is to transform yourself into a consistently successful trader. If there's anything \nin your mental environment that's in conflict with the principles of creating the belief that \"I am a \nconsistently successful trader,\" then you will need to employ the technique of self-discipline to \nintegrate these principles as a dominant, functioning part of your identity. Once the principles become \n\"who you are,\" you will no longer need self-discipline, because the process of \"being consistent\" will \nbecome effortless. Remember that consistency is not the same as the ability to put on a winning trade, \nor even a string of winning trades for that matter, because putting on a winning trade requires \nabsolutely no skill. All you have to do is guess correctly, which is no different than guessing the \noutcome of a coin toss, whereas consistency is a state of mind that, once achieved, won't allow you to \n\"be\" any other way. You won't have to try to be consistent because it will be a natural function of your \nidentity. In fact, if you have to try, it's an indication that you haven't completely integrated the \nprinciples of consistent success as dominant, unconflicted beliefs. For example, predefining your risk is \na step in the process of \"being consistent.\" If it takes any special effort to predefine your risk, if you \nhave to consciously remind yourself to do it, if you experience any conflicting thoughts (in essence, \ntrying to talk you out of doing it), or if you find yourself in a trade where you haven't predefined your \nrisk, then this principle is not a dominant, functioning part of your identity. It isn't \"who you are.\" If it \nwere, it wouldn't even occur to you not to predefine your risk. If and when all of the sources of conflict \nhave been de-activated, there's no longer a potential for you to \"be\" any other way. What was once a \nstruggle will become virtually effortless. At that point, it may seem to other people that you are so \ndisciplined (because you can do something they find difficult, if not impossible), but the reality is that \nyou aren't being disciplined at all; you are simply functioning from a different set of beliefs that compel \nyou to behave in a way that is consistent with your desires, goals, or objectives.  \n \nCREATING A BELIEF IN CONSISTENCY \n \nCreating a belief that \"I am a consistent winner\" is the primary objective, but like my intention to \nbecome a runner, it's too broad and abstract to implement without breaking it down into a step-by-step \nprocess. So what I'm going to do is break this belief down into its smallest definable parts and then give \nyou a plan to integrate each part as a dominant belief. The following sub-beliefs are the building \nThinking Like a Trader 185 blocks that provide the underlying structure for what it means \"to be a \nconsistent winner.\"  \n \n \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 131,
      "text": "I AM A CONSISTENT WINNER BECAUSE:  \n1. I objectively identify my edges.  \n2. I predefine the risk of every trade.  \n3. I completely accept risk or I am willing to let go of the trade.  \n4. I act on my edges without reservation or hesitation.  \n5. I pay myself as the market makes money available to me.  \n6. I continually monitor my susceptibility for making errors.  \n7. I understand the absolute necessity of these principles of consistent success and, therefore, I \nnever violate them.  \nThese beliefs are the seven principles of consistency. To integrate these principles into your mental \nsystem at a functional level requires that you purposely create a series of experiences that are consistent \nwith them. This is no different from the boy who wanted to play with dogs or my desire to be a runner. \nBefore he could play with a dog, the boy first had to make several attempts just to get close to one. \nEventually, as the balance of energy in his mental system shifted, he could play with dogs without any \ninternal resistance. To become a runner, I had to create the experience of running in spite of everything \ninside me that argued otherwise. Eventually, as the energy shifted more and more in favor of this new \ndefinition of myself, running became a natural expression of my identity.  \nObviously, what we're trying to accomplish here is far more complex than becoming a runner or petting \na dog, but the underlying dynamics of the process are identical. We'll start with a specific objective. \nThe first principle of consistency is the belief, \"I objectively identify my edges.\" The key word here is \nobjectively. Being objective means there's no potential to define, interpret, and therefore perceive any \nmarket information from either a painful or euphoric perspective.  \nThe way to be objective is to operate out of beliefs that keep your expectations neutral and to always \ntake the unknown forces into consideration. Remember, you have to specifically train your mind to be \nobjective and to stay focused in the \"now moment opportunity flow.\" Our minds are not naturally wired \nto think this way, so to be an objective observer you have to learn to think from the market's \nperspective. From the market's perspective, there are always unknown forces (traders) waiting to act on \nprice movement. Therefore, from the market's perspective, \"every moment is truly unique,\" even \nthough the moment may look, sound, or feel exactly the same as some moment logged away in your \nmemory bank.  \nThe instant you either decide or assume you know what's going to happen next, you will automatically \nexpect to be right. However, what you know, at least at the rational level of thinking, can only take into \nconsideration your unique past, which may not have any relationship to what is actually happening \nfrom the markets perspective. At that point, any market information that is not consistent with your \nexpectation has the potential to be defined and interpreted as painful. To avoid experiencing the pain, \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 132,
      "text": "your mind will automatically compensate, with both conscious and subconscious pain-avoidance \nmechanisms, for any differences between what you expect and what the market is offering. What you \nwill experience is commonly referred to as an \"illusion.\" In a state of illusion, you are neither objective \nnor connected to the \"now moment opportunity flow.\"  \nInstead, you become susceptible to committing all the typical trading errors (hesitating, jumping the \ngun, not predefining your risk, defining your risk but refusing to take the loss and letting the trade turn \ninto a bigger loser, getting out of a winning trade too soon, not taking any profits out of a winning \ntrade, letting a winning trade turn into a loser, moving a stop closer to your entry point, getting stopped \nout and watching the market trade back in your favor, or trading too large a position in relationship to \nyour equity). The five fundamental truths about the market will keep your expectations neutral, focus \nyour mind in the \"now moment opportunity flow\" (by disassociating die present moment from your \npast), and, therefore, eliminate your potential to commit these errors. When you stop making trading \nerrors, you'll begin trusting yourself. As your sense of self-trust increases, so will your sense of \nselfconfidence. The greater your confidence, the easier it will be to execute your trades (act on your \nedges without reservation or hesitation).  \nThe five truths will also create a state of mind in which you will genuinely accept the risks of trading. \nWhen you genuinely accept the risks, you will be at peace with any outcome. When you're at peace \nwith any outcome, you will experience a carefree, objective state of mind, where you make yourself \navailable to perceive and act upon whatever the market is offering you (from its perspective) at any \ngiven \"now moment.\" The first objective is to integrate as a dominant belief, \"I objectively identify my \nedges.\" The challenge now is, how do you get there? How do you transform yourself into a person who \ncan consistently think in the market's perspective? The process of transformation starts with your desire \nand your willingness to refocus on the object of your desire (self-discipline). Desire is a force. It does \nnot have to coincide or agree with anything that you currently believe to be true about the nature of \ntrading.  \nA clear desire aimed squarely at a specific objective is a very powerful tool. You can use the force of \nyour desire to create an entirely new version or dimension to your identity; shift energy between two or \nmore conflicting concepts; or change the context or polarity of your memories from negative to \npositive. I'm sure you are familiar with the saying, \"Make up your mind.\" The implication of \"making \nup our minds\" is that we decide exactly what we desire with so much clarity (absolutely no lingering \ndoubts) and with so much conviction that literally nothing stands in our way, either internally or \nexternally. If there's enough force behind our resolve, it's possible to experience a major shift in our \nmental structure virtually instantaneously.  \nDe-activating internal conflicts is not a function of time; it's a function-focused desire (although it can \ntake a considerable amount of time to get to the point where we really make up our minds). Otherwise, \nin the absence of extreme clarity and conviction, the technique of self-discipline, over time, will do the \njob quite nicely (if, of course, you're willing to use it). To get there, you must \"make up your mind,\" \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 133,
      "text": "with as much conviction and clarity as possible, that more than anything else you desire consistency \n(the state of mind of trust, confidence, and objectivity) from your trading. This is necessary because if \nyou're like most traders, you're going to be up against some very formidable conflicting forces. For \nexample, if you've been trading to get high from the euphoria of catching a big move, to impress your \nfamily and friends, to be a hero, to fulfill an addiction to random rewards, to be right about your \npredictions, or for any other reason that has nothing to do with being consistent, then you'll find the \nforce of these other motivations will not only act as an obstacle making the trading exercise I'm about \nto give you veiy difficult, but it could very well be strong enough even to keep you from doing the \nexercise at all. Remember the boy who had no desire to be like the other children and interact with \ndogs? In essence, he decided to live with the active contradiction between his minimally charged \npositive belief that not all dogs are dangerous and his core, negatively charged belief that all dogs are \ndangerous. He had the ability to perceive friendly dogs, but at the same time found it impossible to \ninteract with them. Unless he desires to change it, the imbalance of energy between these two beliefs \nwill stay exactly as it is for his entire life.  \nTo even start this process, you have to want consistency so much that you would be willing to give up \nall the other reasons, motivations, or agendas you have for trading that aren't consistent with the \nprocess of integrating the beliefs that create consistency. A clear, intense desire is an absolute \nprerequisite if you're going to make this process work for you.  \n \nEXERCISE: LEARNING TO TRADE AND EDGE LIKE A CASINO’ \n \nThe object of this exercise is to convince yourself that trading is just a simple game of probabilities \n(numbers), not much different from pulling the handle of a slot machine. At the micro level, the \noutcomes to individual edges are independent occurrences and random in relationship to one another. \nAt the macro level, the outcomes over a series of trades will produce consistent results. From a \nprobabilities perspective, this means that instead of being the person playing the slot machine, as a \ntrader, you can be the casino, if:  \n \n1. you have an edge that genuinely puts the odds of success in your favor;  \n2. you can think about trading in the appropriate manner (the five fundamental truths); and  \n3. you can do everything you need to do over a series of trades. Then, like the casinos, you will own the \ngame and be a consistent winner.  \n \n \n \n \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 134,
      "text": "SETTING UP THE EXERCISE  \nPick a market. \n Choose one actively traded stock or futures contract to trade. It doesn't matter what it is, as long as it's \nliquid and you can afford the margin requirements for trading at least three hundred shares or three \nfutures contracts per trade.  \n \nChoose a set of market variables that define an edge. This can be any trading system you want. The \ntrading system or methodology you choose can be mathematical, mechanical, or visual (based on \npatterns in price charts). It doesn't matter whether you personally design the system or purchase it from \nsomeone else, nor do you need to take a long time or be too picky trying to find or develop the best or \nright system. This exercise is not about system development and it is not a test of your analytical \nabilities. In fact, the variables you choose can even be considered mediocre by most traders' standards, \nbecause what you are going to learn from doing this exercise is not dependent upon whether you \nactually make money.  \nIf you consider this exercise an educational expense, it will cut down on the amount of time and effort \nyou might otherwise expend trying to find the most profitable edges. For those of you who might be \nwondering, I'm not going to make any specific recommendations about what system or variables you \nshould use, because I assume that most of the people reading this book are already well schooled in \ntechnical analysis. If you need additional assistance, there are hundreds of books available on the topic, \nas well as system vendors who are more than willing to sell you their ideas. However, if you've made a \ngenuine attempt to do this on your own but are still having problems picking a system, you can contact \nme at markdouglas.com or tradinginthezone.com and I will make some recommendations. Whatever \nsystem you choose to use has to fit within the following specifications.  \n \nTrade Entry. The variables you use to define your edge have to be absolutely precise. The system has \nto be designed so that it does not require you to make any subjective decisions or judgments about \nwhether your edge is present. If the market is aligned in a way that conforms with the rigid variables of \nyour system, then you have a trade; if not, then you don't have a trade. Period! No other extraneous or \nrandom factors can enter into the equation.  \n \nStop-Loss Exit. The same conditions apply to getting out of a trade that's not working. Your \nmethodology has to tell you exactly how much you need to risk to find out if the trade is going to work. \nThere is always an optimum point at which the possibility of a trade not working is so diminished, \nespecially in relationship to the profit potential, that you're better off taking your loss and getting your \nmind clear to act on the next edge. Let the market structure determine where this optimum point is, \nrather than using an arbitrary dollar amount that you are willing to risk on a trade. In any case, \nwhatever system you choose, it has to be absolutely exact, requiring no subjective decision making. \n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 135,
      "text": "Again, no extraneous or random variables can enter into the equation.  \n \nTime Frame. Your trading methodology can be in any time frame that suits you, but all your entry and \nexit signals have to be DUSCCi Hi cne same time frame. For example, if you use variables that identify \na particular support and resistance pattern on a 30-minute bar chart, then your risk and profit objective \ncalculations also have to be determined in a 30-minute time frame. However, trading in one time frame \ndoes not preclude you from using other time frames as filters. For example, you could have as a filter a \nrule that states you're only going to take trades that are in the direction of the major trend. There's an \nold trading axiom that \"The trend is your friend.\" It means that you have a higher probability of success \nwhen you trade in the direction of the major trend, if there is one. In fact, the lowest-risk trade, with the \nhighest probability of success, occurs when you are buying dips (support) in an up-trending market or \nselling rallies (resistance) in a down-trending market. To illustrate how this rule works, let's say that \nyou've chosen a precise way of identifying support and resistance patterns in a 30- minute time frame \nas your edge. The rule is that you are only going to take trades in the direction of the major trend. A \ntrending market is defined as a series of higher highs and higher lows for an up-trending market and a \nseries of lower highs and lower lows for a downtrending market. The longer the time frame, the more \nsignificant the trend, so a trending market on a daily bar chart is more significant than a trending \nmarket on a 30-minute bar chart. Therefore, the trend on the daily bar chart would take precedence over \nthe trend on the 30-minute bar chart and would be considered the major trend.  \nTo determine the direction of the major trend, look at what is happening on a daily bar chart. If the \ntrend is up on the daily, you are only going to look for a sell-off or retracement down to what your edge \ndefines as support on the 30-minute chart. That's where you will become a buyer. On the other hand, if \nthe trend is down on the daily, you are only going to look for a rally up to what your edge defines as a \nresistance level to be a seller on the 30-minute chart. Your objective is to determine, in a down-\ntrending market, how far it can rally on an intraday basis and still not violate the symmetry of the \nlonger trend. In an up-trending market, your objective is to determine how far it can sell off on an \nintraday basis without violating the symmetry of the longer trend. There's usually very little risk \nassociated with these intraday support and resistance points, because you don't have to let the market \ngo very far beyond them to tell you the trade isn't working.  \n \nTaking Profits. Believe it or not, of all the skills one needs to learn to be a consistently successful \ntrader, learning to take profits is probably the most difficult to master. A multitude of personal, often \nvery complicated psychological factors, as well as the effectiveness of one's market analysis, enter into \nthe equation. Unfortunately, sorting out this complex matrix of issues goes way beyond the scope of \nthis book. I point this out so that those of you who might be inclined to beat yourselves up for leaving \nmoney on the table can relax and give yourselves a break. Even after you've acquired all the other \nskills, it might take a very long time before you get this one down pat. Don't despair. There is a way to \n",
      "candlestick_hits": 2,
      "is_highly_relevant": false
    },
    {
      "page": 136,
      "text": "set up a profit-taking regime that at least fulfills the objective of the fifth principle of consistency (\"I \npay myself as the market makes money available to me\").  \nIf you're going to establish a belief in yourself that you're a consistent winner, then you will have to \ncreate experiences that correspond with that belief. Because the object of the belief is winning \nconsistently, how you take profits in a winning trade is of paramount importance. This is the only part \nof the exercise in which you will have some degree of discretion about what you do. The underlying \npremise is that, in a winning trade, you never know how far the market is going to go in your direction. \nMarkets rarely go straight up or straight down. (Many of the NASDAQ Internet stocks in the fall of \n1999 were an obvious exception to this statement.) Typically, markets go up and then retrace some \nportion of the upward move; or go down and then retrace some portion of the downward move. These \nproportional reiracerr^nts can make it very difficult to stay in a winning trade. You would have to be an \nextremely sophisticated and objective analyst to make the distinction between a normal retracement, \nwhen the market still has the potential to move in the original direction of your trade, and a retracement \nthat isn't normal, when the potential for any further movement in the original direction of your trade is \ngreatly diminished, if not nonexistent.  \nIf you never know how far the market is going to go in your direction, then when and how do you take \nprofits? The question of when is a function of your ability to read the market and pick the most likely \nspots for it to stop. In the absence of an ability to do this objectively, the best course of action from a \npsychological perspective is to divide your position into thirds (or quarters), and scale out the position \nas the market moves in your favor. If you are trading futures contracts, this means your minimum \nposition for a trade is at least three (or four) contracts. For stocks, the minimum position is any number \nof shares that is divisible by three (or four), so you don't end up with an odd-lot order. Here's the way I \nscale out of a winning position. When I first started trading, especially during the first three years (1979 \nthrough 1981), I would thoroughly and regularly analyze the results of my trading activities. One of the \nthings I discovered was that I rarely got stopped out of a trade for a loss, without the market first going \nat least a little way in my direction. On average, only one out of every ten trades was an immediate \nloser that never went in my direction. Out of the other 25 to 30 percent of the trades that were \nultimately losers, the market usually went in my direction by three or four tics before revising and \nstopping me out. I calculated that if I got into the habit of taking at least a third of my original position \noff every time the market gave me those three or four tics, at the end of the year the accumulated \nwinnings would go a long way towards paying my expenses. I was right. To this day, I always, without \nreservation or hesitation, take off a portion of a winning position whenever the market gives me a little \nto take.  \nHow much that might be depends on the market; it will be a different amount in each case. For \nexample, in Treasury bond futures, I take a third of my position off when I get four tics. In the S&P \nfutures, I take a third off for a profit of one and a half to two full points. In a bond trade, I usually don't \nrisk more than six tics to find out if the trade is going to work. Using a three-contract trade as an \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 137,
      "text": "example, here's how it works: If I get into a position and the market immediately goes against me \nwithout giving me at least four tics first, I get stopped out of the trade for an 18-tic loss, but as I've \nindicated, this doesn't happen often. More likely, the trade goes in my favor by some small amount \nbefore becoming a loser. If it goes in my favor by at least four tics, I take those four tics on one \ncontract. What I have done is reduce my total risk on the other two contracts by 10 tics. If the market \nthen stops me out of the last two contracts, the net loss on the trade is only 8 tics. If I don't get stopped \nout on the last two contracts and the market moves in my direction, I take the next third of the position \noff at some predetermined profit objective.  \nThis is based on some longer time frame support or resistance, or on the test of a previous significant \nhigh or low. When I take profits on the second third, I also move the stop-loss to my original entry \npoint. Now I have a net profit on the trade regardless of what happens to the last third of the position. \nIn other words, I now have a \"risk-free opportunity.\" I can't emphasize enough nor can the publisher \nmake the words on this page big enough to stress how important it is for you to experience the state of \n\"risk-free opportunity.\" When you set up a situation in which there is \"risk-free opportunity,\" there's no \nway to lose unless something extremely unusual happens, like a limit up or limit down move through \nyour stop. If, under normal circumstances, there's no way to lose, you get to experience what it really \nfeels like to be in a trade with a relaxed, carefree state of mind. To illustrate this point, imagine that you \nare in a winning trade; the market made a fairly significant move in your direction, but you didn't take \nany profits because you thought it was going even further.  \nHowever, instead of going further, the market trades all the way back to or very close to your original \nentry point. You panic and, as a result, liquidate the trade, because you don't want to let what was once \na winning trade turn into a loser. But as soon as you're out, the market bounces right back into what \nwould have been a winning trade. If you had locked in some profits by scaling out, putting yourself in a \nriskfree opportunity situation, it s very unlikely that you would have panicked or felt any stress or \nanxiety for that matter. I still have a third of my position left. What now? I look for the most likely \nplace for the market to stop. This is usually a significant high or low in a longer time frame. I place my \norder to liquidate just below that spot in a long position or just above that spot in a short position. I \nplace my orders just above or just below because I don't care about squeezing the last tic out of the \ntrade. I have found over the years that trying to do that just isn't worth it. One other factor you need to \ntake into consideration is your risk-to-reward ratio. The risk-to-reward ratio is the dollar value of how \nmuch risk you have to take relative to the profit potential. Ideally, your risk-to-reward ratio should be at \nleast 3:1, which means you are only risking one dollar for every three dollars of profit potential. If your \nedge and the way you scale out of your trades give you a 3:1 risk-to-reward ratio, your winning trade \npercentage can be less than 50 percent and you will still make money consistently. A 3:1 risk-to-reward \nratio is ideal. However, for the purposes of this exercise, it doesn't matter what it is, nor does it matter \nhow effectively you scale out, as long as you do it. Do the best you can to pay yourself at reasonable \nprofit levels when the market makes the money available. Every portion of a trade that you take off as a \n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 138,
      "text": "winner will contribute to your belief that you are a consistent winner. All the numbers will eventually \ncome into better alignment as your belief in your ability to be consistent becomes stronger.  \n \nTrading in Sample Sizes. The typical trader practically lives or dies (emotionally) on the results of the \nmost recent trade. If it was a winner, he'll gladly go to the next trade; if it wasn't, he'll start questioning \nthe viability of his edge. To find out what variables work, how well they work, and what doesn't work, \nwe need a systematic approach, one that doesn't take any random variables into consideration. This \nmeans that we have to expand our definition of success or failure from the limited trade-by-trade \nperspective of the typical trader to a sample size of 20 trades or more. Any edge you decide on will be \nbased on some limited number of market variables or relationships between those variables that \nmeasure the market's potential to move either up or down. From the market's perspective, each trader \nwho has the potential to put on or take off a trade can act as a force on price movement and is, \ntherefore, a market variable. No edge or technical system can take into consideration every trader and \nhis reasons for putting on or taking off a trade. As a result, any set of market variables that defines an \nedge is like a snapshot of something very fluid, capturing only a limited portion of all the possibilities. \nWhen you apply any set of variables to the market, they may work very well over an extended period \nof time, but after a while you may find that their effectiveness diminishes. That's because the \nunderlying dynamics of the interaction between all the participants (the market) is changing. New \ntraders come into the market with their own unique ideas of what is high and what is low, and other \ntraders leave.  \nLittle by little, these changes affect the underlying dynamics of how the market moves. No snapshot \n(rigid set of variables) can take these subtle changes into consideration. You can compensate for these \nsubtle changes in the underlying dynamics of market movement and still maintain a consistent \napproach by trading in sample sizes. Your sample size has to be large enough to give your variables a \nfair and adequate test, but at the same time small enough so that if their effectiveness diminishes, you \ncan detect it before you lose an inordinate amount of money. I have found that a sample size of at least \n20 trades fulfills both of these requirements.  \n \nTesting. Once you decide on a set of variables that conform to these specifications, you need to test \nthem to see how well they work. If you have the appropriate software to do this, you are probably \nalready familiar with the procedures. If you don't have testing software, you can either forward test \nyour variables or hire a testing service to do it for you. If you need a recommendation for a testing \nservice, contact me at markdouglas.com or tradinginthezone.com for a referral. In any case, keep in \nmind that the object of the exercise is to use trading as a vehicle to learn how to think objectively (in \nthe market's perspective), as if you were a casino operator. Right now, the bottom-line performance of \nyour system isn't very important, but it is important that you have a good idea of what you can expect \nin the way of a win-to-loss ratio (the number of winning trades relative to the number of losing trades \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 139,
      "text": "for your sample size).  \n \nAccepting the Risk. A requirement of this exercise is that you know in advance exactly what your risk \nis on each trade in your 20- trade sample size. As you now know, knowing the risk and accepting the \nrisk are two different things. I want you to be as comfortable as possible with the dollar value of the \nrisk you are taking in this exercise. Becuse the exercise requires that you use a 20-trade sample size, the \npotential risk is that you will lose on all 20 trades. This is obviously the worst-case scenario. It is as \nlikely an occurrence as that you willwin on all 20 trades, which means it isn't very likely. Nevertheless, \nit is a possibility. Therefore, you should set up the exercise in such a way that you can accept the risk \n(in dollar value) of losing on all 20 trades.  \nFor example, if you're trading S&P futures, your edge might require that you risk three full points per \ncontract to find out if the trade is going to work. Since the exercise requires that you trade a minimum \nof three contracts per trade, the total dollar value of the risk per trade is $2,250, if you use big contracts. \nThe accumulated dollar value of risk if you lose on all 20 trades is $45,000, You may not be \ncomfortable risking $45,000 on this exercise.  \nIf you're not comfortable, you can reduce the dollar value of the risk by trading S&P mini contracts (E-\nMini). They are one-fifth the value of the big contracts, so the total dollar value of the risk per trade \ngoes down to $450 and the accumulated risk for all 20 trades is $9,000. You can do the same thing if \nyou are trading stocks: Just keep on reducing the number of shares per trade until you get to a point \nwhere you are comfortable with the total accumulated risk for all 20 trades. What I don't want you to \ndo is change your established risk parameters to satisfy your comfort levels.  \nIf, based on your research, you have determined that a three-point risk in the S&Ps is the optimum \ndistance you must let the market trade against your edge to tell you it isn't worth staying in the position, \nthen leave it at three points. Change this variable only if it is warranted from a technical analysis \nperspective. If you've done everything possible to reduce your position size and find that you still aren't \ncomfortable with the accumulated dollar value of losing on all 20 trades, then I suggest you do the \nexercise with a simulated brokerage service. With a simulated brokerage service, everything about the \nprocess of putting on and taking off trades, including fills and brokerage statements, is exactly the same \nas with an actual brokerage firm, except that the trades are not actually entered into the market. As a \nresult, you don't actually have any money at risk. A simulated brokerage service is an excellent tool to \npractice with in real time, under real market conditions; it is also an excellent tool for forward testing a \ntrading system. There may be others, but the only service of this nature that I know of is \nAuditrack.com.  \n \nDoing the Exercise. When you have a set of variables that conforms to the specifications described, \nyou know exactly what each trade is going to cost to find out if it's going to work, you have a plan for \ntaking profits, and you know what you can expect as a win-loss ratio for your sample size, then you are \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 140,
      "text": "ready to begin the exercise. The rules are simple: Trade your system exactly as you have designed it. \nThis means you have to commit yourself to trading at least the next 20 occurrences of your edge—not \njust the next trade or the next couple of trades, but all 20, no matter what. You cannot deviate, use or be \ninfluenced by any other extraneous factors, or change the variables that define your edge until you have \ncompleted a full sample size. By setting up the exercise with rigid variables that define your edge, \nrelatively fixed odds, and a commitment to take every trade in your sample size, you have created a \ntrading regime that duplicates how a casino operates.  \nWhy do casinos make consistent money on an event that has a random outcome? Because they know \nthat over a series of events, the odds are in their favor. They also know that to realize the benefits of the \nfavorable odds, they have to participate in every event. They can't engage in a process of picking and \nchoosing which hand of blackjack, spin of the roulette wheel, or roll of the dice they are going to \nparticipate in, by trying to predict in advance the outcome of each of these individual events. If you \nbelieve in the five fundamental truths and you believe that trading is just a probability game, not much \ndifferent from pulling the handle of a slot machine, then you'll find that this exercise will be \neffortless—effortless because your desire to follow through with your commitment to take every trade \nin your sample size and your belief in the probabilistic nature of trading will be in complete harmony. \nAs a result, there will be no fear, resistance, or distracting thoughts. What could stop you from doing \nexactly what you need to do, when you need to do it, without reservation or hesitation? Nothing!  \nOn the other hand, if it hasn't already occurred to you, this exercise is going to create a head-on \ncollision between your desire to think objectively in probabilities and all the forces inside you that are \nin conflict with this desire. The amount of difficulty you have in doing this exercise will be in direct \nproportion to the degree to which these conflicts exist. To one degree or another, you will experience \nthe exact opposite of what I described in the previous paragraph. Don't be surprised if you find your \nfirst couple of attempts at doing this exercise virtually impossible. How should you handle these \nconflicts? Monitor yourself and use the technique of self-discipline to refocus on your objective. Write \ndown the five fundamental truths and the seven principles of consistency, and keep them in front of you \nat all times when you are trading.  \nRepeat them to yourself frequently, with conviction. Every time you notice that you are thinking, \nsaying, or doing something that is inconsistent with these truths or principles, acknowledge the conflict. \nDon't try to deny the existence of conflicting forces. They are simply parts of your psyche that are \n(understandably) arguing for their versions of the truth. When this happens, refocus on exactly what \nyou are trying to accomplish. If your purpose is to think objectively, disrupt the association process (so \nyou can stay in the \"now moment opportunity flow\"); step through your fears of being wrong, losing \nmoney, missing out, and leaving money on the table (so you can stop making errors and start trusting \nyourself), then you'll know exactly what you need to do. Follow the rules of your trading regime as best \nyou can. Doing exactly what your rules call for while focused on the five fundamental truths will \neventually resolve all your conflicts about the true nature of trading. Every time you actually do \n",
      "candlestick_hits": 1,
      "is_highly_relevant": false
    },
    {
      "page": 141,
      "text": "something that confirms one of the five fundamental truths, you will be drawing energy out of the \nconflicting beliefs and adding energy to a belief in probabilities and in your ability to produce \nconsistent results. Eventually, your new beliefs will become so powerful that it will take no conscious \neffort on your part to think and act in a way that is consistent with your objectives.  \nYou will know for sure that thinking in probabilities is a functioning part of your identity when you \nwill be able to go through one sample size of at least 20 or more trades without any difficulty, \nresistance, or conflicting thoughts distracting you from doing exactly what your mechanical system \ncalls for. Then, and only then, will you be ready to move into the more advanced subjective or intuitive \nstages of trading.  \n \nA FINAL NOTE \n \nTry not to prejudge how long it will take before you can get through at least one sample size of trades, \nfollowing your plan without deviation, distracting thoughts, or hesitation to act. It will take as long as it \ntakes. If you wanted to be a professional golfer, it wouldn't be unusual to dedicate yourself to hitting \n10,000 or more golf balls until the precise combination of movements in your swing were so ingrained \nin your muscle memory that you no longer had to think about it consciously. When you're out there \nhitting those golf balls, you aren't playing an actual game against someone or winning the big \ntournament. You do it because you believe that skill acquisition and practice will help you win. \nLearning to be a consistent winner as a trader isn't any different. I wish you great prosperity, and would \nsay \"good luck,\" but you really won't need luck if you work at acquiring the appropriate skills.  \n \nATTITUDE SURVEY \n \n1. To make money as a trader you have to know what the market is going co do next.  \nAgree Disagree  \n \n2. Sometimes I find myself thinking that there must be a way to trade without having to take a loss.  \nAgree Disagree  \n \n3. Making money as a trader is primarily a function of analysis.  \nAgree Disagree  \n \n4. Losses are an unavoidable component of trading.  \nAgree Disagree  \n \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 142,
      "text": "5. My risk is always defined before I enter a trade.  \nAgree Disagree  \n \n6. In my mind there is always a cost associated with finding out what the market may do next.  \nAgree Disagree  \n \n7. I wouldn't even bother putting on the next trade if I wasn't sure that it was going to be a winner.  \nAgree Disagree  \n \n8. The more a trader learns about the markets and how they behave, the easier it will be for him to \nexecute his trades.  \nAgree Disagree  \n \n9. My methodology tells me exactly under what market conditions to either enter or exit a trade.  \nAgree Disagree  \n \n10. Even when I have a clear signal to reverse my position, I find it extremely difficult to do.  \nAgree Disagree  \n \n11. I have sustained periods of consistent success usually followed by some fairly drastic draw-downs \nin my equity.  \nAgree Disagree  \n \n12. When I first started trading I would describe my trading methodology as haphazard, meaning some \nsuccess in between a lot of pain.  \nAgree Disagree  \n \n13. I often find myself feeling that the markets are against me personally.  \nAgree Disagree  \n \n14. As much as I might try to \"let go,\" I find it very difficult to put past emotional wounds behind me.  \nAgree Disagree  \n \n15. I have a money management philosophy that is founded in the principle of always taking some \nmoney out of the market when the market makes it available.  \nAgree Disagree  \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 143,
      "text": "16. A trader s job is to identify patterns in the markets' behavior that represent an opportunity and then \nto determine the risk of finding out if these patterns will play themselves out as they have in the past.  \nAgree Disagree  \n \n17. Sometimes I just can't help feeling that I am a victim of the market.  \nAgree Disagree  \n \n18. When I trade I usually try to stay focused in one time frame. Agree Disagree  \n19. Trading successfully requires a degree of mental flexibility far beyond the scope of most people.  \nAgree Disagree  \n \n20. There are times when I can definitely feel the flow of the market; however, I often have difficulty \nacting on these feelings.  \nAgree Disagree  \n \n21. There are many times when I am in a profitable trade and I know the move is basically over, but I \nstill won't take my profits.  \nAgree Disagree  \n \n22. No matter how much money I make in a trade, I am rarely ever satisfied and feel that I could have \nmade more.  \nAgree Disagree  \n \n23. When I put on a trade, I feel I have a positive attitude. I anticipate all of the money I could make \nfrom the trade in a positive way.  \nAgree Disagree  \n \n24. The most important component in a trader's ability to accumulate money over time is having a \nbelief in his own consistency.  \nAgree Disagree  \n \n25. If you were granted a wish to be able to instantaneously acquire one trading skill, what skill would \nyou choose?  \n \n26. I often spend sleepless nights worrying about the market.  \nAgree Disagree  \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    },
    {
      "page": 144,
      "text": "27. Do you ever feel compelled to make a trade because you are afraid that you might miss out?  \nYes No  \n \n28. Although it doesn't happen very often, I really like my trades to be perfect. When I make a perfect \ncall it feels so good that it makes up for all of the times that I don't.  \nAgree Disagree  \n \n29. Do you ever find yourself planning trades you never execute, and executing trades you never \nplanned?  \nYes No  \n \n30. In a few sentences explain why most traders either don't make money or aren't able to keep what \nthey make.  \n \n \n \n \n \n \n",
      "candlestick_hits": 0,
      "is_highly_relevant": false
    }
  ]
}